{
    "Okinawa": {
        "owned": false,
        "title": "Been There – Okinawa",
        "url": "https://starbucks-mugs.com/mug/been-there-okinawa/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/10/bt_okinawa_main.jpg",
        "description": "\nStarbucks Been There – Okinawa is a mug for a prefecture in Japan that has a rich and diverse history that stretches back thousands of years. The origin of the term “Okinawa” remains unclear, with one of the possible meanings being “rope in the open ocean”, referring to how the islands form a chain along the China Sea from Kagoshima to Taiwan. The history of Okinawa dates back to prehistoric times, with the earliest Okinawans known as the Minatogawa people. From the 12th century, during the Gusuku era, farming developed on the islands, and communities grew.… Read more \n"
    },
    "Japan 2 Spring Edition": {
        "owned": false,
        "title": "Been There – Japan 2 Spring Edition",
        "url": "https://starbucks-mugs.com/mug/been-there-japan-2-spring-edition/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/04/bt_japan_2_spring_main.jpg",
        "description": "\nSimilarly to the previous collection, Starbucks released the Special Edition country mugs for Japan. In fact, each season gets a custom interpretation of the regular mug’s design.\nBeen There – Japan 2 Spring Edition is dedicated to the spring season, known as “haru”. It is a breathtaking tapestry of renewal and vibrant beauty. Cherry blossoms, or “sakura,” symbolize the essence of this season, painting the landscape in shades of pink and white as they bloom across the country. These delicate flowers not only herald the arrival of warmer weather but also evoke a sense of fleeting yet profound beauty, celebrated through hanami, the centuries-old tradition of flower viewing.… Read more \n"
    },
    "Beijing": {
        "owned": false,
        "title": "Been There – Beijing",
        "url": "https://starbucks-mugs.com/mug/been-there-beijing/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/08/bt_Beijing_main.jpg",
        "description": "\nStarbucks Been There – Beijing is a mug for the capital of the People’s Republic of China and one of the world’s largest cities, encompassing an area of approximately 6,500 square miles. With a population exceeding 21 million people, it stands as China’s second-most populous city, serving as a bustling hub of culture, politics, and innovation.\nBeijing boasts a rich history dating back over three millennia. Originally known as Ji, it became a prominent city during the Zhou Dynasty (1046–256 BCE).… Read more \n"
    },
    "Baylor": {
        "owned": false,
        "title": "Been There – Baylor",
        "url": "https://starbucks-mugs.com/mug/been-there-baylor/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/03/bt_baylor_main.jpg",
        "description": "\nStarbucks Been There – Baylor is a fresh release from the Campus Collection for one of the oldest universities in Texas. Founded in 1845 in Independence, Baylor University was chartered by the Republic of Texas and named after Judge R.E.B. Baylor, a prominent figure in Texas law. Initially established as a Baptist university, it later moved to Waco in 1886. Baylor’s commitment to academic excellence and Christian values has made it a respected institution nationwide. Over the years, it has grown into a comprehensive research university offering a wide range of undergraduate, graduate, and professional programs.… Read more \n"
    },
    "Manila 2": {
        "owned": false,
        "title": "Been There – Manila 2 – Summer Edition 2023",
        "url": "https://starbucks-mugs.com/mug/been-there-manila-2-summer-edition-2023/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/11/bt_manila_summer-2023_main.jpg",
        "description": "\nIn one of my previous posts, I mentioned that last summer there were four Philippines mugs released in the scope of a mini sub-series. Starbucks Been There Manila 2 Summer Edition 2023 is one of them.\nAs you can see from the pictures below, it resembles the regular mug very much, with the only difference being the black outlined design.\nHere are some points of interest that can be seen on the sides of the mug:\n– The Manila City Hall, an iconic symbol of governance and history, stands proudly in the heart of Manila, Philippines.… Read more \n"
    },
    "Barranquilla": {
        "owned": false,
        "title": "Been There – Barranquilla",
        "url": "https://starbucks-mugs.com/mug/been-there-barranquilla/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/bt_barranquilla_main.jpg",
        "description": "\nStarbucks Been There – Barranquilla is a mug for a bustling city with a rich history situated on the northern Caribbean coast of Colombia. Its name is believed to originate from the Spanish word “barranco,” meaning ravine or cliff, and “quilla,” a term from the indigenous Muysccubun language, possibly referring to a stone wall. Founded in 1629 by Gonzalo Fernández de Oviedo y Valdés, Barranquilla initially served as a port for the transportation of goods, becoming a crucial hub for trade in the region.… Read more \n"
    },
    "Philippines 2": {
        "owned": false,
        "title": "Been There – Philippines 2 – Summer Edition 2023",
        "url": "https://starbucks-mugs.com/mug/been-there-philippines-2-summer-edition-2023/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/03/bt_philippines_summer_2023_main.jpg",
        "description": "\nWhat you’re seeing is the mug that popped up last summer and caused some confusion. At first glance, Been There – Philippines 2 – Summer Edition 2023 looked like the Christmas mug, outlined with black only. However, after a quick search, I found out that the somewhat official name of the new four Philippines mugs (see the last photo in this post) is “Summer Been There Series”. The cover is not different from the regular version and has no additional writing, however, the actual box is black.… Read more \n"
    },
    "Australia": {
        "owned": false,
        "title": "Been There – Australia",
        "url": "https://starbucks-mugs.com/mug/been-there-australia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/04/bt_australia_main_.jpg",
        "description": "\nFive mugs from the Land Down Under were released about a year ago. They are available in stores but are still harder to get for collectors in Europe or the Americas due to high-cost shipping. But if you’re a true hardcore fan, that should not stop you, right? Let’s start with the Starbucks Been There – Australia mug.\nAustralia, known colloquially as the “The Lucky Country,” boasts a rich history and cultural diversity. Indigenous Australians, believed to have settled the continent around 65,000 years ago, possess one of the oldest continuous cultures on Earth.… Read more \n"
    },
    "Boracay 2": {
        "owned": false,
        "title": "Been There – Boracay 2 – Summer Edition 2023",
        "url": "https://starbucks-mugs.com/mug/been-there-boracay-2-summer-edition-2023/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/11/bt_boracay_summer-2023_1.jpg",
        "description": "\nStarbucks Been There – Boracay 2 – Summer Edition 2023 is the fourth and final mug from the last summer batch release. I wonder if there is going to be a new version soon. Let’s keep an eye on that.\nBoracay, often hailed as one of the world’s most beautiful islands, is a tropical paradise located in the Philippines. This small island, measuring just under four square miles, is famous for its powdery white sand beaches, crystal-clear turquoise waters, and vibrant marine life.… Read more \n"
    },
    "Tokyo": {
        "owned": false,
        "title": "Been There – Tokyo",
        "url": "https://starbucks-mugs.com/mug/been-there-tokyo/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/04/bt_tokyo_main.jpg",
        "description": "\nIt has been a while since the release of the Japanese mugs, and Starbucks Been There – Tokyo was one of them.\nTokyo, the vibrant capital of Japan, is a bustling metropolis renowned for its modernity, rich history, and cultural heritage. With a population exceeding 13 million people, it stands as one of the most populous cities globally. Originally known as Edo, Tokyo became the official capital in 1868 during the Meiji Restoration, marking a pivotal moment in Japanese history as the country transitioned towards modernization and opened up to the world.… Read more \n"
    },
    "Aruba": {
        "owned": false,
        "title": "Been There – Aruba",
        "url": "https://starbucks-mugs.com/mug/been-there-aruba/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/01/bt_aruba_1.jpg",
        "description": "\nLet’s move to South America for a second and review Starbucks Been There – Aruba mug.\nAruba, a Caribbean gem renowned for its pristine beaches and vibrant culture, boasts a rich history that spans centuries. Believed to have been inhabited as early as 1000 AD by the Caquetio indigenous people, Aruba later became a Spanish colony in the 16th century before falling under Dutch control in 1636. Its name is thought to derive from the Spanish phrase “oro hubo,” meaning “there was gold,” reflecting the island’s once thriving gold mining industry.… Read more \n"
    },
    "Cebu 2": {
        "owned": false,
        "title": "Been There – Cebu 2 – Summer Edition 2023",
        "url": "https://starbucks-mugs.com/mug/been-there-cebu-2-summer-edition-2023/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/11/bt_cebu_summer-2023_main.jpg",
        "description": "\nStarbucks Been There Cebu 2 Summer Edition 2023 is the third mug from last summer’s batch release. Similar to others it has the design of the regular mug outlined in black. Do you see how the Starbucks reusable cup is not red? This tells us that the mug is not a Christmas edition, but rather something else.\nCebu, the bustling province located in the Central Visayas region of the Philippines, is a vibrant tapestry of history and culture. It holds a significant place in Philippine history as the site of Ferdinand Magellan’s arrival in 1521, marking the beginning of Spanish colonization in the archipelago.… Read more \n"
    },
    "China": {
        "owned": false,
        "title": "Been There – China",
        "url": "https://starbucks-mugs.com/mug/been-there-china/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/09/bt_china_country_main.jpg",
        "description": "\nStarbucks Been There – China is probably the best-looking mug from this series that I’ve seen. The designers did a great job while using bright red and shiny gold colors. This, however, comes with the inconvenience of not being able to use it in the microwave or dishwasher. Please note, that there are dozens of Been There city mugs from China that I will be adding soon, stay tuned!\nThere are many symbols and points of interest from China that can be seen on the mug.… Read more \n"
    },
    "Cartagena": {
        "owned": false,
        "title": "Been There – Cartagena",
        "url": "https://starbucks-mugs.com/mug/been-there-cartagena/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/bt_cartagena_main_m.jpg",
        "description": "\nStarbucks Been There – Cartagena should be available in stores for a while now. It’s not the first Colombian city mug from this series, but rather the part of the second batch.\nCartagena, a vibrant city nestled on the northern coast of Colombia, is a cultural gem steeped in history and charm. Originally inhabited by indigenous peoples, the city was founded by Spanish explorer Pedro de Heredia in 1533, becoming a strategic port in the Spanish colonial empire. Over the centuries, Cartagena thrived as a vital hub for trade, drawing merchants, adventurers, and pirates alike.… Read more \n"
    },
    "Guyana": {
        "owned": false,
        "title": "Been There – Guyana",
        "url": "https://starbucks-mugs.com/mug/been-there-guyana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/04/bt_guyana_main.jpg",
        "description": "\nStarbucks Been There – Guyana is a mug for the only English-speaking country in South America. Guyana, officially known as the Co-operative Republic of Guyana, shares borders with Venezuela to the west, Brazil to the south, and Suriname to the east, with the Atlantic Ocean gracing its northern shores. The capital and largest city, Georgetown, situated at the mouth of the Demerara River, serves as the cultural and economic hub of the nation.\nGuyana’s history is a tapestry woven with threads of indigenous cultures, European colonialism, and the struggles for independence.… Read more \n"
    },
    "Mississippi 3": {
        "owned": false,
        "title": "Been There – Mississippi 3",
        "url": "https://starbucks-mugs.com/mug/been-there-mississippi-3/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/03/bt_mississippi_v3_main.jpg",
        "description": "\nWhile the new mugs keep coming regularly, Starbucks continues revising its existing inventory by releasing updated versions of some of its Been There mugs. In a way, it became a hallmark of this series. Yes, we’ve seen some YAHs updated, but all those were exceptions caused by some legal reasons. And of course, that doesn’t apply to Disney YAHs, which we’ve seen plenty of.\nAlright, so, Starbucks Been There – Mississippi 3 is the updated version of the previously released mug.… Read more \n"
    },
    "Japan": {
        "owned": false,
        "title": "Been There – Japan",
        "url": "https://starbucks-mugs.com/mug/been-there-japan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/03/bt_japan_1_main.jpg",
        "description": "\nIt has been a while since the release of the Starbucks Been There – Japan mug, and I have no excuse for not adding it to the collection. Similar to the YAH series, the Japan country mug is unique in the sense, that it has four siblings representing four seasons of the year: Spring, Summer, Fall, and Winter. I will be adding those four to the collection soon.\nThe design of this “regular” mug uses red and yellow colors. Here are some symbols of Japan that I am seeing on it:\nFuji, also known as Mount Fuji, is Japan’s iconic stratovolcano and the country’s tallest peak, standing at 12,389 ft.… Read more \n"
    },
    "Cambridge": {
        "owned": false,
        "title": "Been There – Cambridge",
        "url": "https://starbucks-mugs.com/mug/been-there-cambridge/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/02/bt_cambridge_main.jpg",
        "description": "\nStarbucks Been There – Cambridge is a mug for a city in Massachusetts, located just across the Charles River from Boston. Cambridge is renowned for its prestigious universities, Harvard University, the Massachusetts Institute of Technology (MIT), and Lesley University, which have shaped its identity as an intellectual and cultural hub. I am expecting Starbucks to release the mugs for these academic institutions later, in the scope of the Campus Collection. Stay tuned for the latest news about that!\nCambridge was settled in 1630 by the Massachusetts Bay Company and was originally called New Towne.… Read more \n"
    },
    "Curacao": {
        "owned": false,
        "title": "Been There – Curacao",
        "url": "https://starbucks-mugs.com/mug/been-there-curacao/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/05/bt_curacao_main_m.jpg",
        "description": "\nStarbucks Been There – Curaçao mug was initially spotted in personal collections back in 2019, however it was never seen in stores till recently. Not sure what was the reason for the delay, but here it is, brand new and nice looking.\nCuraçao, a constituent country of the Kingdom of the Netherlands, lies in the southern Caribbean Sea, about 65 kilometers north of the Venezuelan coast. Its capital and largest city, Willemstad, is renowned for its colorful Dutch colonial architecture, earning it recognition as a UNESCO World Heritage Site.… Read more \n"
    },
    "Michigan State": {
        "owned": false,
        "title": "Been There – Michigan State",
        "url": "https://starbucks-mugs.com/mug/been-there-michigan-state/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/01/bt_michigan_state_1.jpg",
        "description": "\nStarbucks Been There – Michigan State mug is designed using mostly two colors: green which symbolizes the agricultural heritage of the university and the lush landscapes of Michigan, and white which represents purity and integrity.\nFounded in 1855, Michigan State University (MSU) has a rich and storied history that spans over 160 years. Situated in East Lansing, Michigan, MSU has evolved from a small agricultural college into a globally recognized institution of higher learning. Initially named the Agricultural College of the State of Michigan, MSU was the first land-grant college in the United States, emphasizing practical education and research in agriculture and the mechanical arts.… Read more \n"
    },
    "Savannah": {
        "owned": false,
        "title": "Been There – Savannah",
        "url": "https://starbucks-mugs.com/mug/been-there-savannah/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/12/bt_savannah_main.jpg",
        "description": "\nI am still catching up with the USA releases, and here’s one of them. Starbucks Been There – Savannah mug should be available in stores for a while now.\nSavannah’s history is as captivating as its picturesque landscape. Founded in 1733 by British General James Oglethorpe, Savannah served as the first colonial capital of Georgia. The city’s strategic location along the Savannah River facilitated trade and commerce, contributing to its early growth and prosperity.\nThroughout the centuries, Savannah bore witness to pivotal events in American history.… Read more \n"
    },
    "The University of Utah": {
        "owned": false,
        "title": "Been There – The University of Utah",
        "url": "https://starbucks-mugs.com/mug/been-there-the-university-of-utah/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/03/bt_uni_utah_main.jpg",
        "description": "\nHere’s the new release from the Campus Collection for a public research university in Salt Lake City. Starbucks Been There – The University of Utah mug is designed using the official colors of the University: Utah Red, Black, and White.\nThe University of Utah (UU, U of U, or simply Utah) traces its origins back to the early days of the Utah Territory when Brigham Young, then the president of The Church of Jesus Christ of Latter-day Saints, saw the need for a higher education institution.… Read more \n"
    },
    "University of Wisconsin-Madison": {
        "owned": false,
        "title": "Been There – University of Wisconsin-Madison",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-wisconsin-madison/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/01/bt_wisconsin_madison_1.jpg",
        "description": "\nStarbucks Been There – University of Wisconsin-Madison is a mug for a prestigious institution known for its rich history, vibrant traditions, and iconic symbols. The University of Wisconsin-Madison, often referred to as UW-Madison or simply Wisconsin has established itself as a hub of academic excellence and a center for innovation.\nFounded in 1848, the University of Wisconsin-Madison has a storied past that has shaped its identity. Initially named the University of the Territory of Wisconsin, it became the first public university in the state and the birthplace of the Wisconsin Idea.… Read more \n"
    },
    "South Carolina 2": {
        "owned": false,
        "title": "Been There – South Carolina 2",
        "url": "https://starbucks-mugs.com/mug/been-there-south-carolina-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/08/bt_south_carolina_v2_main.jpg",
        "description": "\nUnexpectedly, Starbucks made a decision to issue an updated version of the previously released mug. The design of Been There South Carolina v2 shows some rearrangement of the elements and removal of “the rice state” nickname. The latter doesn’t seem to be widely used, so I guess the change makes sense. The Palmetto State, on the other hand, is widely known as the reference to the state tree, the Palmetto. Speaking of which, the v1 had two of these trees in the design, one red and one yellow.… Read more \n"
    },
    "Punta Cana": {
        "owned": false,
        "title": "Been There – Punta Cana",
        "url": "https://starbucks-mugs.com/mug/been-there-punta-cana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/02/bt_punta_cana_main.jpg",
        "description": "\nStarbucks Been There – Punta Cana is a mug for a popular tourist destination located on the eastern coast of La Hispaniola island, which is shared by the Dominican Republic and Haiti. It is known for its beautiful beaches, luxurious resorts, and vibrant culture. \nPunta Cana’s transformation from an unknown area to a world-renowned beach destination began in 1969 when a group of American investors purchased 30 square miles of undeveloped land along the Dominican Republic’s east coast. The first hotel in Punta Cana was built in 1971, and from there, tourism in the area took off .… Read more \n"
    },
    "Stanford": {
        "owned": true,
        "title": "Been There – Stanford",
        "url": "https://starbucks-mugs.com/mug/been-there-stanford/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/06/bt_stanford_1.jpg",
        "description": "\nBeen There – Stanford is a mug for the university nestled in the heart of Silicon Valley which stands as a beacon of academic excellence and innovation. Established in 1885 by Leland and Jane Stanford in memory of their son, Leland Stanford Jr., it aimed to create a center of learning that would benefit humanity. The campus, designed by landscape architect Frederick Law Olmsted, opened its doors in 1891. Over the years, Stanford has played a pivotal role in advancing knowledge and research, particularly in areas such as technology, entrepreneurship, and the sciences.… Read more \n",
        "latlong": [
            37.42410599999999,
            -122.1660756
        ]
    },
    "University of Minnesota": {
        "owned": false,
        "title": "Been There – University of Minnesota",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-minnesota/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/02/bt_uni_minnesota_main.jpg",
        "description": "\nThis mug was in my queue since last year, and I am finally adding it to the site. Been There – University of Minnesota is a release for the university nestled along the banks of the Mississippi River in Minneapolis and St. Paul. Often referred to as UMN or simply the U, it stands as a beacon of academic excellence and innovation in the heart of the Midwest. Founded in 1851, it is one of the oldest public research universities in the United States and has played a pivotal role in shaping the intellectual and cultural landscape of the region.… Read more \n"
    },
    "University of Southern California": {
        "owned": true,
        "title": "Been There – University of Southern California",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-southern-california/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/01/bt_usc_main.jpg",
        "description": "\nLet’s get back on Campus Collection releases. This time it’s Been There – University of Southern California, a mug for a prestigious private research university located in Los Angeles. It was founded in 1880 and has since grown to become one of the leading institutions of higher education in the United States. USC offers a wide range of academic programs and is known for its strong emphasis on research, innovation, and community engagement.\nUSC has a rich history that spans over a century.… Read more \n",
        "latlong": [
            34.0223519,
            -118.285117
        ]
    },
    "Arendelle": {
        "owned": false,
        "title": "Been There Disney – Arendelle",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-arendelle/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2024/01/bt_arendelle_main.jpg",
        "description": "\nBeen There Disney – Arendelle mug was released earlier this year and is dedicated to a fictional kingdom that serves as the main setting for Disney’s animated film “Frozen” and its sequel “Frozen II.” Created by Disney, Arendelle is a Nordic-inspired kingdom with elements reminiscent of Scandinavian and Norwegian landscapes and architecture. The story revolves around the relationship between two royal sisters, Elsa and Anna, and their adventures as they navigate challenges related to Elsa’s magical ice powers. The franchise has gained widespread popularity, and Arendelle has become synonymous with the Frozen universe, capturing the imagination of audiences around the world.… Read more \n",
        "latlong": null
    },
    "Penn State": {
        "owned": false,
        "title": "Been There – Penn State",
        "url": "https://starbucks-mugs.com/mug/been-there-penn-state/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/08/bt_penn_state_1.jpg",
        "description": "\nThe Campus Collection is expanding with the release of Starbucks Been There Penn State mug. It has been available in stores within the University Park campus since spring now, so you you should be able to find it when in town.\nPenn State University, located in State College, Pennsylvania, is a renowned institution known for its strong academic programs, vibrant campus life, and passionate community. With a rich history spanning over 150 years, Penn State offers a wide range of undergraduate and graduate programs across various disciplines, including business, engineering, liberal arts, and health sciences.… Read more \n",
        "latlong": [
            41.2033216,
            -77.1945247
        ]
    },
    "The University of Arizona": {
        "owned": false,
        "title": "Been There – The University of Arizona",
        "url": "https://starbucks-mugs.com/mug/been-there-the-university-of-arizona/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/12/bt_the_university_of_arizona_main.jpg",
        "description": "\nThe University of Arizona, nestled in the vibrant city of Tucson, is a place where academic excellence, rich traditions, and the spirit of the Southwest converge. Starbucks Been There The University of Arizona mug encapsulates its essence, featuring an array of symbols and elements that reflect its history, campus life, and the unique beauty of the surrounding landscape.\nThe University of Arizona, also known as U of A, is a public research university located in Tucson. Founded in 1885, it is the state’s oldest university and is known for its academic excellence and research contributions.… Read more \n",
        "latlong": [
            32.2318981,
            -110.9535407
        ]
    },
    "Memphis": {
        "owned": false,
        "title": "Been There – Memphis",
        "url": "https://starbucks-mugs.com/mug/been-there-memphis/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_memphis_main_876.jpg",
        "description": "\nHere’s Starbucks Been There Memphis, a mug released for the city nestled along the mighty Mississippi River, a city that resonates with history, culture, and a unique blend of flavors. As you sip from this coffee mug, adorned with iconic symbols, you’re transported to a place where the soulful tunes of live music mingle with the aroma of delicious barbecue, creating an unforgettable experience.\nHere are some easily identifiable symbols of the city that were used in the design of the mug:\n– Memphis’s claim to fame as the “BBQ pork capital of the world” is celebrated in its mouthwatering culinary scene.… Read more \n",
        "latlong": [
            35.1495343,
            -90.0489801
        ]
    },
    "Indianapolis": {
        "owned": false,
        "title": "Been There – Indianapolis",
        "url": "https://starbucks-mugs.com/mug/been-there-indianapolis/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_indianapolis_main.jpg",
        "description": "\nPlease keep in mind that Starbucks Been There – Indianapolis mug was released back in 2021, so I am catching up by adding it to my collection.\nIndianapolis was founded in 1821 and is now home to around 900k people. The city boasts a range of symbols that reflect its identity and values.\n– The city’s flag (see the back of the mug) showcases a blue field with a gold torch and stars, symbolizing liberty and enlightenment.\n– The city’s motto, “Amicus Certus in Re Incerta,” translates to “A True Friend in Uncertain Times,” embodying the city’s spirit of community and unity.… Read more \n",
        "latlong": [
            39.768403,
            -86.158068
        ]
    },
    "Tampa Bay": {
        "owned": false,
        "title": "Been There – Tampa Bay",
        "url": "https://starbucks-mugs.com/mug/been-there-tampa-bay/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/12/bt_tampa_bay_main_876.jpg",
        "description": "\nStarbucks Been There Tampa Bay is not a city mug, but rather a collectible inspired by a beautiful area located on the west coast of Florida. It is a popular destination offering a variety of activities and attractions to suit any interest. The region is home to several cities, including Tampa, St. Petersburg, and Clearwater, each with its own unique charm and personality.\nOne of the main draws of Tampa Bay is its stunning beaches. Clearwater Beach, consistently rated one of the top beaches in the country, boasts soft white sand and crystal-clear water.… Read more \n",
        "latlong": [
            27.763383,
            -82.5436722
        ]
    },
    "Santa Barbara": {
        "owned": true,
        "title": "Been There – Santa Barbara",
        "url": "https://starbucks-mugs.com/mug/been-there-santa-barbara/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/bt_santa_barbara_1_876.jpg",
        "description": "\nStarbucks Been There Santa Barbara is a mug from early 2023, inspired by the city nestled along the picturesque California coastline. Santa Barbara stands as a testament to the seamless blend of natural beauty, architectural elegance, and a laid-back yet sophisticated lifestyle. Known as the “American Riviera,” this coastal gem has captured the hearts of residents and visitors alike, offering a unique combination of stunning landscapes, cultural riches, and a Mediterranean-inspired atmosphere. The city’s history dates back centuries, shaped by a tapestry of indigenous Chumash communities and Spanish colonization.… Read more \n",
        "latlong": [
            34.4208305,
            -119.6981901
        ]
    },
    "Wakanda": {
        "owned": false,
        "title": "Been There Marvel – Wakanda",
        "url": "https://starbucks-mugs.com/mug/been-there-marvel-wakanda/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/08/bt_wakana_main_876.jpg",
        "description": "\nThis is a milestone release from Starbucks and I am sure, that Been There Wakanda is just the first from the new collection of Marvel mugs that are coming soon.\nAs you can see from the pictures below, the box has an unique design. Even though it’s similar to Star Wars boxes, with each of them having the name of the mug specified, here are some things specific to this new release:\n– the cover of the box has a distinctive shade of dark blue, while the box itself is red.… Read more \n",
        "latlong": null
    },
    "University of Florida": {
        "owned": false,
        "title": "Been There – University of Florida",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-florida/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/02/bt_uni_florida_main.jpg",
        "description": "\nHere’s a very bright and colorful mug from the Campus Collection: Been There University of Florida. UF has a renowned history that dates back to its establishment in 1853. Originally known as the East Florida Seminary, the institution began as a small boarding school in Ocala before moving to Gainesville in 1906. Over the years, UF grew in size and scope, evolving into a comprehensive research university. Throughout its history, UF has been dedicated to providing a high-quality education, fostering innovation, and serving the state of Florida.… Read more \n",
        "latlong": [
            29.6465428,
            -82.3533266
        ]
    },
    "The University of Mississippi": {
        "owned": false,
        "title": "Been There – The University of Mississippi",
        "url": "https://starbucks-mugs.com/mug/been-there-the-university-of-mississippi/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/12/bt_uni_mississippi_main.jpg",
        "description": "\nStarbucks Been There The University of Mississippi is a mug for The University of Mississippi, commonly known as Ole Miss. It is a prestigious educational institution located in Oxford, Mississippi. Founded in 1848, it has a rich history and a strong commitment to academic excellence and community engagement. Ole Miss offers a wide range of undergraduate and graduate programs across various fields, including liberal arts, business, education, engineering, and health sciences. The university boasts a beautiful campus adorned with iconic red-brick buildings and a vibrant student life.… Read more \n",
        "latlong": [
            34.3662492,
            -89.5379687
        ]
    },
    "Purdue University": {
        "owned": false,
        "title": "Been There – Purdue University",
        "url": "https://starbucks-mugs.com/mug/been-there-purdue-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/11/bt_purdue_main_876.jpg",
        "description": "\nHaven’t posted about the new Campus Collection mugs in a while, so it is time to fix that. Starbucks Been There Purdue University mug was released back in 2022 for the public research university located in West Lafayette, Indiana. Established in 1869, it is one of the leading institutions of higher education in the country. Purdue is known for its strong emphasis on science, technology, engineering, and mathematics (STEM) disciplines, although it offers a wide range of programs across various fields.… Read more \n",
        "latlong": [
            40.4237054,
            -86.92119459999999
        ]
    },
    "Coruscant": {
        "owned": false,
        "title": "Star Wars Been There – Coruscant",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-coruscant/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/05/bt_coruscant_1.jpg",
        "description": "\nBeen There – Coruscant is the third mug released on May 4th, 2023, the day that holds great significance for Star Wars fans worldwide. Coruscant, also known as Imperial Center, was a unique and remarkable planet of the Core Worlds. The whole surface of the planet was entirely covered in sprawling cities and urban landscapes, an ecumenopolis as it was called in the Star Wars metaverse. It was believed by many to be the original homeworld of humanity. The planet served as a bustling hub of activity, and held immense political significance during the rule of the Galactic Empire.… Read more \n",
        "latlong": null
    },
    "Jakku": {
        "owned": false,
        "title": "Star Wars Been There – Jakku",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-jakku/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/05/bt_jakku_1.jpg",
        "description": "\nBeen There Jakku is the mug from the 2023 trio released on May 4th. Jakku was a desert planet located in the Western Reaches of the galaxy’s Inner Rim. Known for its vast expanses of barren sand dunes and harsh, unforgiving environment, Jakku holds great importance in the Star Wars universe for several reasons. One of them is that it was the place of the Battle of Jakku. It was a decisive clash between  the New Republic and the remnants of the Galactic Empire.… Read more \n",
        "latlong": null
    },
    "Mustafar": {
        "owned": false,
        "title": "Star Wars Been There – Mustafar",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-mustafar/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/05/bt_mustafar_1.jpg",
        "description": "\nAs I’ve mentioned in the previous post, there were three new Star Wars mugs released for the May 4th this year. Here is the first of them: Starbucks Been There – Mustafar mug.\nMustafar is a volcanic planet located in the Outer Rim Territories of the Star Wars galaxy. It is characterized by its harsh and unforgiving environment, with rivers of lava, towering volcanoes, and a perpetually fiery landscape. The planet’s intense volcanic activity makes it inhospitable for most forms of life, and its treacherous terrain poses numerous dangers to those who venture there.… Read more \n",
        "latlong": null
    },
    "Alabama 2": {
        "owned": false,
        "title": "Been There – Alabama 2",
        "url": "https://starbucks-mugs.com/mug/been-there-alabama-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2023/01/bt_alabama_2_1.jpg",
        "description": "\nStarbucks Been There Alabama v2 is an updated version of the mug that was released five years ago. I am not surprised that designers removed “the cotton state” nickname from the mug, as it was raising the question of what it has to do with Alabama. Other rather obvious changes include:\n – the appearance of a friendly-looking bear and a giant butterfly\n – the planes are gone. As a reminder, these were related to the Tuskegee Airmen, which were the first African-American military aviators in the United States Armed Forces.… Read more \n",
        "latlong": [
            31.7510453,
            -86.0937312
        ]
    },
    "Niagara-on-the-Lake": {
        "owned": false,
        "title": "Been There – Niagara-on-the-Lake",
        "url": "https://starbucks-mugs.com/mug/been-there-niagara-on-the-lake/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/12/bt_niagara_on_the_lake_main.jpg",
        "description": "\nHere is an interesting release from the Pin Drop Collection subset of the Been There Series. As a reminder, the boxes of these mugs are orange, compared to regular blue and the cover has slightly different wording. You can see the comparison of the boxes below.\nStarbucks Been There Niagara-on-the-Lake  is a mug for a town in Ontario, Canada located at the Niagara river mouth, where it flows into Lake Ontario. An interesting historical detail is that the town served as the first capital of the province of Upper Canada.… Read more \n",
        "latlong": [
            43.2549988,
            -79.0772616
        ]
    },
    "Vientiane": {
        "owned": false,
        "title": "Been There – Vientiane",
        "url": "https://starbucks-mugs.com/mug/been-there-vientiane/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/10/bt_vientiane_1.jpg",
        "description": "\nBeen There – Vientiane mug is dedicated to the opening of the first Starbucks store in Laos and the further expansion of the company in Southeast Asia. The store is designed in collaboration with local artists while honoring the heritage and beauty of Laotian art and folklore.\nVientiane is the capital of the country and its largest city. It is located right on the border with Thailand separated from it by the Mekong river.\nHere are some symbols and points of attraction from the design of the mug:\n– Patuxai (the arch next to the handle) is a war monument dedicated to those who fought in the war for independence from France (1949).… Read more \n",
        "latlong": [
            17.9757058,
            102.6331035
        ]
    },
    "The University of Oklahoma": {
        "owned": false,
        "title": "Been There – The University of Oklahoma",
        "url": "https://starbucks-mugs.com/mug/been-there-the-university-of-oklahoma/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/09/bt_uni_oklahoma_1_876.jpg",
        "description": "\nMore mugs from the Campus Collection have been released recently. One of them is the Been There The University of Oklahoma for the public research university in Norman, Oklahoma. It was founded in 1890, seventeen years before Oklahoma officially became the state!\nThe mug is designed using the official colors of the University – crimson and cream. You can see an official abbreviation of the name of the University – OU, to the left of the title.\nHere are some landmarks and symbols of the OU.… Read more \n",
        "latlong": [
            35.1987162,
            -97.4448963
        ]
    },
    "Manila": {
        "owned": true,
        "title": "Been There – Manila",
        "url": "https://starbucks-mugs.com/mug/been-there-manila/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_manila_1_main.jpg",
        "description": "\nHere is the mug for the capital of the Philippines, Starbucks Been There – Manila. With around 120k people per square mile, Manila is the most densely populated city proper in the world. The initial settlement existed even before Spanish conquistador Miguel López de Legazpi founded the Spanish city of Manila on June 24, 1571, hence it is home to many historic sites.\n– The Manila City Hall is the official seat of the government of the City of Manila.… Read more \n",
        "latlong": [
            14.5995124,
            120.9842195
        ]
    },
    "Philippines": {
        "owned": true,
        "title": "Been There – Philippines",
        "url": "https://starbucks-mugs.com/mug/been-there-philippines/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_philippines_v1_main.jpg",
        "description": "\nBT Collection is making a spectacular appearance to Republika ng Pilipinas with seventeen mugs and four ornaments! And yes, Been There – Philippines is the first one in the list. Are you ready for that?\nHere are some key elements from the front of the mug. Big thanks to a local reader, who provided the list:\n– Coconut Tree (1) – the Philippines is one of the world’s largest producers of coconuts and related products. Pretty much every part of the tree can be used for something, from the top of its leaves to the bottom of its roots and surely the fruit itself.… Read more \n",
        "latlong": [
            12.879721,
            121.774017
        ]
    },
    "Pike Place 3": {
        "owned": false,
        "title": "Been There Christmas – Pike Place 3",
        "url": "https://starbucks-mugs.com/mug/been-there-christmas-pike-place-3/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/11/btc_pike_place_3_1.jpg",
        "description": "\nWith the holiday season approaching fast, Starbucks delights us with the release of the Been There Christmas Pike Place v3 mug. It looks similar to the last year’s release, at first glance, however, when giving it a second look it becomes obvious that the new mug’s color is much darker, making it black, almost. If you decide to buy this mug online, you need to pay attention, as the pictures might be deceiving, depending on the light. To be absolutely sure, ask for the picture of the bottom, which clearly shows the year.… Read more \n",
        "latlong": [
            47.6113714,
            -122.3339244
        ]
    },
    "Clemson University": {
        "owned": false,
        "title": "Been There – Clemson University",
        "url": "https://starbucks-mugs.com/mug/been-there-clemson-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/10/bt_clemson_main.jpg",
        "description": "\nStarbucks Been There Clemson University mug is the newest addition to the Campus Collection. It is dedicated to a public land-grant research university in South Carolina. The University was founded in 1889 as Clemson Agricultural College of South Carolina. It was later renamed Clemson University in 1964, in recognition of expanded academic offerings.\nHere are some landmarks and symbols from the mug:\n– Clemson University Outdoor Theater is the venue for outdoor events. The Theater seats approximately 1206 on grass and concrete-tiered seating levels.… Read more \n",
        "latlong": [
            34.6749926,
            -82.8406184
        ]
    },
    "Sacramento State": {
        "owned": false,
        "title": "Been There – Sacramento State",
        "url": "https://starbucks-mugs.com/mug/been-there-sacramento-state/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/08/bt_sacramento_state_main.jpg",
        "description": "\nHere’s the second in the row Campus Collection release from this week, Starbucks Been There – Sacramento State mug. The full name of this public university is California State University, Sacramento (CSUS) a.k.a. Sacramento State a.k.a. Sac State. Speaking of the California State University system, it incorporates another 22 campuses, and some of them we’ve already seen releases for: Fresno and San Diego. It doesn’t necessarily mean that all 23 campuses are getting the mug, however, I am sure, we can expect more.… Read more \n",
        "latlong": [
            38.564761,
            -121.4276493
        ]
    },
    "Notre Dame": {
        "owned": false,
        "title": "Been There – Notre Dame",
        "url": "https://starbucks-mugs.com/mug/been-there-notre-dame/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/08/bt_notre_dame_1_876.jpg",
        "description": "\nStarbucks Been There – Notre Dame mug is expanding the Campus Collection, making me question how many are there planned for us. The University of Notre Dame du Lac, a.k.a. Notre Dame, a.k.a. ND, is a private Catholic research university in Notre Dame, Indiana. Established in 1842, the University consists of seven schools and colleges now and is considered one of the top universities in the US. Students of the ND enroll in more than fifty master’s, doctoral, and professional degrees in law, science, engineering, medicine, architecture, and business.… Read more \n",
        "latlong": [
            41.7050504,
            -86.2355439
        ]
    },
    "University of Missouri": {
        "owned": false,
        "title": "Been There – University of Missouri",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-missouri/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/bt_mizzou_preview_1.jpg",
        "description": "\nThe latest addition to the Campus Collection is Starbucks Been There – University of Missouri mug, designed using black and “MU Gold” colors. The latter, as you could guess, is an official custom color of the University.\nThe University of Missouri (Mizzou, MU, or Missouri) is a public university located in Columbia. When founded in 1839, it was the first public university west of the Mississippi River. As many as 30,000 students enroll in more than 300-degree academic programs at Mizzou, each year.… Read more \n",
        "latlong": [
            38.9403808,
            -92.32773750000001
        ]
    },
    "Georgetown University": {
        "owned": false,
        "title": "Been There – Georgetown University",
        "url": "https://starbucks-mugs.com/mug/been-there-georgetown-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/bt_Georgetown-University_preview.jpg",
        "description": "\nEven though Been There – Georgetown University has been already released, I am not seeing a lot of inventory just yet. But that just makes the hunt even more exciting!\nGeorgetown University is a private research university founded in 1789 as Georgetown College. It is ranked among the top universities in the US, admitting only 10-12% of the applicants each year. Here’s an interesting fact, two of Georgetown’s students became US presidents later: Bill Clinton and Lyndon Johnson. It is worth mentioning, however, that Lyndon Johnson quit after the first semester.… Read more \n",
        "latlong": [
            38.9076089,
            -77.07225849999999
        ]
    },
    "Canada’s Wonderland": {
        "owned": false,
        "title": "Been There – Canada’s Wonderland",
        "url": "https://starbucks-mugs.com/mug/been-there-canadas-wonderland/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_canadas_wonderland_main_407.jpg",
        "description": "\nBeen There – Canada’s Wonderland is a mug for Canada’s largest amusement park, which is located near Toronto. It took two years to build the park and it was opened to the public in May 1981. Canada’s Wonderland has the third highest amount of coasters (seventeen) in a single park, right behind Six Flags Magic Mountain in the US and Poland’s Energylandia respectively.\nHere are some of the elements of the design, featuring attractions and sections of the park:\n– the front of the mug shows the main entrance to the park with the Canadian Flag flowerbed, fountains, and Wonder Mountain with a huge waterfall.… Read more \n",
        "latlong": [
            43.8423619,
            -79.54121549999999
        ]
    },
    "Northeastern University": {
        "owned": false,
        "title": "Been There – Northeastern University",
        "url": "https://starbucks-mugs.com/mug/been-there-northeastern-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/07/been_there_NEU_1_407.jpg",
        "description": "\nBeen There – Northeastern University is the tenth mug from the Campus Collection, at least so far. I didn’t hear about any other University mugs for now, but that doesn’t mean Starbucks doesn’t have more coming.\nNortheastern University (NU or NEU) is a private research university founded in 1898. The main campus is located in Boston, with smaller campuses in many other states and even Canada. A distinctive characteristic of the University is its cooperative education (co-op) programs. In these programs students alternate periods of academic study with periods of professional employment related to their major.… Read more \n",
        "latlong": [
            42.339904,
            -71.0898892
        ]
    },
    "Fresno State": {
        "owned": true,
        "title": "Been There – Fresno State",
        "url": "https://starbucks-mugs.com/mug/been-there-fresno-state/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_fresno_main_407.jpg",
        "description": "\nStarbucks is expanding the Campus Collection with Been There – Fresno State mug. Founded in 1911 as the Fresno State Normal School, Fresno State (California State University, Fresno) is a public university with some unique facilities like a planetarium, on-campus raisin, and wine grape vineyards, and even a commercial winery. You can see the references to that in the design of the mug: a person holding a bunch of grapes and also a wine press on the back.\nOther symbols of the Fresno State that were added to the mug’s design:\n– Victor E., the bulldog, was chosen as the University’s mascot in 1921.… Read more \n",
        "latlong": [
            36.8136777,
            -119.7461767
        ]
    },
    "University of Georgia": {
        "owned": false,
        "title": "Been There – University of Georgia",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-georgia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_university_of_georgia_1_407.jpg",
        "description": "\nI am finally reviewing a new mug from the Campus Collection, namely Been There – University of Georgia. Although “new” is probably not the right word since these have been available in stores for a couple of months now.\nThe University of Georgia (UGA) founded in 1785, is one of the oldest public universities in the United States. Its main campus is located in Athens, Georgia, and consists of five sections, North, South, Central, East, and West Campuses. UGA is now considered one of the best public universities in the US.… Read more \n",
        "latlong": [
            33.9566656,
            -83.375192
        ]
    },
    "University of Colorado Boulder": {
        "owned": false,
        "title": "Been There – University of Colorado Boulder",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-colorado-boulder/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_boulder_1_main_407.jpg",
        "description": "\nHere’s another addition to the Campus Collection, a mug from the Centennial State, Starbucks Been There – University of Colorado Boulder. CU Boulder is the flagship university of the University of Colorado System. It was fascinating to learn that it was founded five months before Colorado became a state in 1876. Another rather interesting fact is that CU Boulder is the alma mater for 5 Nobel Prize laureates and 10 Pulitzer Prize winners so far.\nThe front of the mug showcases the aerial views of the campus, Folsom Field (stadium), and the beautiful peaks of the Rocky Mountains in the background.… Read more \n",
        "latlong": [
            40.0073499,
            -105.2659871
        ]
    },
    "Naboo": {
        "owned": false,
        "title": "Been There – Naboo",
        "url": "https://starbucks-mugs.com/mug/been-there-naboo/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_naboo_1_407.jpg",
        "description": "\nStarbucks Been There – Naboo is the third mug from the 2022 batch of the Star Wars themed releases. In the Star Wars universe, Naboo was a beautiful planet from the Mid Rim Territories. Originally, it was populated by the amphibian Gungans. One of their representative, Jar Jar Binks, is depicted on the lower front part of the mug. Later in time a group of human colonists from Grizmallt landed on the planet and named it and themselves Naboo. Unfortunately, their arrival led to a series of conflicts with Gungans over territory and resources.… Read more \n",
        "latlong": null
    },
    "Nevarro": {
        "owned": false,
        "title": "Been There – Nevarro",
        "url": "https://starbucks-mugs.com/mug/been-there-nevarro/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_nevarro_1_407.jpg",
        "description": "\nThis is Starbucks Been There – Nevarro, a mug for the volcanic planet from the Outer Rim Territories. In the time of the New Republic, the planet and its city became headquarters for bounty hunters. Din Djarin, a.k.a “the Mandalorian” or “Mando”, is probably the most well-known among them. He’s depicted right on the front of the mug. Din Djarin dragged the Bounty Hunters’ Guild into the conflict when he rescued Grogu, a.k.a. “The Child” (you can see him on the right side of the front of the mug).… Read more \n",
        "latlong": null
    },
    "Ahch-To": {
        "owned": false,
        "title": "Been There – Ahch-To",
        "url": "https://starbucks-mugs.com/mug/been-there-ahch-to/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/05/bt_ahchto_1_407.jpg",
        "description": "\nStarbucks Been There – Ahch-To is a mug for a planet from the Unknown Regions that was mostly covered with water and numerous rocky islands poking here and there. It was believed to be the birthplace of the Jedi Order. Luke Skywalker made this planet his home many years after the Galactic Civil War, you can see him on the front of the mug. It was Ahch-To where he agreed to train Rey (Skywalker) (the right side of the front of the mug).… Read more \n",
        "latlong": null
    },
    "UNLV": {
        "owned": false,
        "title": "Been There – UNLV",
        "url": "https://starbucks-mugs.com/mug/been-there-unlv/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/04/bt_unlv_m_1_407.jpg",
        "description": "\nHere is the Starbucks Been There – UNLV mug that was released for the University of Nevada, Las Vegas this week. It makes it the sixth mug from the Campus Collection\nUNLV was officially founded as the Southern Division of the University of Nevada, Reno (UNR) on September 10, 1957, with the first classes starting in 1959. It changed its name to Nevada Southern University in 1965. As the university grew it gained equal status with its parent from Reno (UNR) and it was decided to change the name once again to the present one.… Read more \n",
        "latlong": [
            36.107496,
            -115.1435252
        ]
    },
    "Pennsylvania 2": {
        "owned": false,
        "title": "Been There – Pennsylvania 2",
        "url": "https://starbucks-mugs.com/mug/been-there-pennsylvania-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/05/bt_penn_2_2_407-407x446.jpg",
        "description": "\nHere’s a long-due release of Been There – Pennsylvania 2 mug. And just to give you some context, the mini-version (ornament) was updated to v2 a long time ago. Similar to that release, Been There v2 brings the following changes:\n – “Youse!” instead of “Youze!”. Both are used as an alternative form for “you” (singular and plural) in certain regions of the USA (and some other English-speaking countries).\n – “TURN-PIKE” now has the dash in the name and refers to the Pennsylvania Turnpike (a.k.a Penna Turnpike or PA Turnpike).… Read more \n",
        "latlong": [
            40.0431613,
            -75.03775019999999
        ]
    },
    "University of Washington": {
        "owned": false,
        "title": "Been There – University of Washington",
        "url": "https://starbucks-mugs.com/mug/been-there-university-of-washington/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/12/bt_uw_1_407-407x325.jpg",
        "description": "\nStarbucks Been There – University of Washington is finalizing the list of mugs from Campus Collection for now. There is a big chance there will be more of this kind this year, so stay tuned for the news.\nThe University of Washington (also informally known as U-Dub) was founded in Seattle in 1861, making it one of the oldest universities on the West Coast. The city itself was founded just ten years prior, and it was growing along with the university since.… Read more \n",
        "latlong": [
            47.65464069999999,
            -122.3074579
        ]
    },
    "Orlando 2": {
        "owned": false,
        "title": "Been There – Orlando 2",
        "url": "https://starbucks-mugs.com/mug/been-there-orlando-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/12/bt_orlando_2_1_407-407x314.jpg",
        "description": "\nBeen There – Orlando v2 is another revised version of the existing mug. I’d rather Starbucks issue mugs for the new locations, be it cities or parks, but I’ll take v2 as well!\nAs you can see from the comparison collage below, even though the change is somewhat obvious, being on the front of the mug, it’s not as big, when compared with this recent release, as an example. Specifically, the “Theme Park Capital of the World” nickname is gone now.… Read more \n",
        "latlong": [
            28.5383832,
            -81.3789269
        ]
    },
    "Nevada 2": {
        "owned": false,
        "title": "Been There – Nevada 2",
        "url": "https://starbucks-mugs.com/mug/been-there-nevada-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/12/bt_nevada_2_main_407-407x297.jpg",
        "description": "\nThe moment I saw Been There – Nevada v2 mug photo I thought it was just some issue with its color balance. The mug was not supposed to be blue, but rather red and orange. Just to be sure, I’ve compared this photo with the pictures of the Nevada mug from this post. Well, what do you know, it turned out to be the new, v2 version! Check out the comparison picture below. The first thing we see on the front of the mug is that the bird has changed.… Read more \n",
        "latlong": [
            40.0384749,
            -116.419389
        ]
    },
    "Epcot 2": {
        "owned": false,
        "title": "Been There Disney – Epcot 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-epcot-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_epcot_2_1_m_407-407x291.jpg",
        "description": "\nAnd last but not least from the recent Disney releases, is Been There Disney – Epcot v2 mug. The list below is what Starbucks designers have used as inspiration for the mug. Please note, that some of the symbols that can be seen on the mug, are not a part of the park anymore. The way I understand it, they are included to pay homage to the park’s discontinued attractions and as a part of the Walt Disney World 50th Anniversary Celebration\n1.… Read more \n",
        "latlong": [
            31.8786156,
            131.4253138
        ]
    },
    "Arizona State University": {
        "owned": false,
        "title": "Been There –  Arizona State University",
        "url": "https://starbucks-mugs.com/mug/been-there-arizona-state-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_asu_main_407-407x325.jpg",
        "description": "\nYet another mug from Campus Collection, Been There – Arizona State University has been released this week. It seems that apart from Starbucks stores inside the university campuses, you can buy this mug around the city as well. ASU is a public research university located in Phoenix, one of the largest by enrollment in the U.S. It was founded in 1885 as Territorial Normal School.\nThe front of the mug shows the Future Sun Devil Welcome Center which is a mixed-use facility that also serves as the ASU School of Sustainable Engineering and the Built Environment and the Sun Devil Marketplace.… Read more \n",
        "latlong": [
            33.4229975,
            -111.9278306
        ]
    },
    "Magic Kingdom 2": {
        "owned": false,
        "title": "Been There Disney – Magic Kingdom 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-magic-kingdom-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_magic_kingdom_2_1_407-407x298.jpg",
        "description": "\nI am finally reviewing the Been There Disney – Magic Kingdom v2 mug that was delayed for some reason. All four new mugs for the Walt Disney World have the “50th Anniversary” theme in their design however it is only Magic Kingdom that was opened 50 years ago, on October 1, 1971. The second park, Epcot, was only opened 11 years later!\nSimilar to other recent Disney mugs, this one has a legend on the cover with a list of all the elements from the mug’s design.… Read more \n",
        "latlong": [
            28.4188163,
            -81.5817689
        ]
    },
    "Rutgers": {
        "owned": false,
        "title": "Been There – Rutgers",
        "url": "https://starbucks-mugs.com/mug/been-there-rutgers/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_rutgers_1_407-407x289.jpg",
        "description": "\nStarbucks Been There – Rutgers was not on the list of the mugs I expected for the Campus Collection. Well, like I always say, the more the better\n\nRutgers, The State University of New Jersey, is a public land-grant research university based in New Brunswick, New Jersey. Chartered in 1766, Rutgers was originally called Queen’s College. It is the eighth-oldest college in the United States.\n“The Birthplace of College Football” phrase can be seen on the front of the mug. It is the reference to Rutgers being the place for the first intercollegiate football game between Rutgers and Princeton on November 6, 1869.… Read more \n",
        "latlong": null
    },
    "San Diego State": {
        "owned": false,
        "title": "Been There – San Diego State",
        "url": "https://starbucks-mugs.com/mug/been-there-san-diego-state/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_san_diego_state_uni_main_407.jpg",
        "description": "\nStarbucks Been There – San Diego State University mug is the second out of four that were planned so far as a part of “Campus Collection” (sub-set of Been There Series).\nSDSU is a public research university founded in 1897 as San Diego Normal School and is now accepting around 25k students per year. The front of the mug is featuring Hepner Hall, the iconic academic building in the center of SDSU’s campus. The same building can also be seen on the University’s official logo.… Read more \n",
        "latlong": [
            32.7774047,
            -117.0714068
        ]
    },
    "California Adventure 2": {
        "owned": false,
        "title": "Been There Disney – California Adventure 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-california-adventure-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/11/bt_california_adventure_2_main_407-407x294.jpg",
        "description": "\nBeen There Disney – California Adventure v2 follows Disneyland v2 that we’ve seen earlier. I am happy to see both Disney parks from California receiving the revision, and not just World Disney World parks (for 50th Anniversary).\nI really like the new design for its bright colors and the fact that all the elements are listed in the legend on the cover of the box. Here are they:\n(1) Popcorn is a popular snack in any of the Disney parks. Here’s a hint: using the refillable popcorn bucket might save you some bucks during your visit.… Read more \n",
        "latlong": [
            36.778261,
            -119.4179324
        ]
    },
    "Florida International University": {
        "owned": false,
        "title": "Been There – Florida International University",
        "url": "https://starbucks-mugs.com/mug/been-there-florida-international-university/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/10/bt_fiu_1-407x335.jpg",
        "description": "\nBeen There – Florida International University is the first out of at least four “University Mugs” that I’ve heard are coming out soon. It seems that Starbucks is expanding the list of Been There mugs by adding new types of locations and we’ve seen the trend with Star Wars and Yosemite mugs. It adds variety and attracts new collectors on one hand, but also can blow your budget on the other hand (in case you decide to collect the whole series).… Read more \n",
        "latlong": [
            25.7562465,
            -80.3755401
        ]
    },
    "Disneyland 2": {
        "owned": false,
        "title": "Been There Disney – Disneyland 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-disneyland-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/10/bt_disneyland_2_1_1_1-407x291.jpg",
        "description": "\nHere’s Been There Disney – Disneyland v2 that continues the second wave of the Disney releases. Similar to Hollywood Studios v2 and Animal Kingdom v2, it’s more than just the new design of the mug that we see, the box has some changes as well:\n– the top of the cover has “Disneyland Resort” logo instead of Disney Parks as seen on the previous version\n– there is a legend of all the elements from the mug on the side of the cover of the box.… Read more \n",
        "latlong": [
            33.8120918,
            -117.9189742
        ]
    },
    "Fukuoka": {
        "owned": false,
        "title": "Been There – Fukuoka",
        "url": "https://starbucks-mugs.com/mug/been-there-fukuoka/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2022/01/bt_fukuoka_1_1-407x282.jpg",
        "description": "\n… Read more \n",
        "latlong": [
            33.5901838,
            130.4016888
        ]
    },
    "Animal Kingdom 2": {
        "owned": false,
        "title": "Been There Disney – Animal Kingdom 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-animal-kingdom-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/10/bt_animal_kingdom_2_main-407x294.jpg",
        "description": "\nLike I’ve mentioned in the previous post, two parks got new releases so far, and Starbucks Been There Disney – Animal Kingdom 2 is the other mug from today. Again, we can see the gold box and the big “50th Anniversary” detail on the cover. I am waiting for the better pics of the mug and the box, especially the side with the legend mentioning all the elements from the mug. Stay tuned for the full review!\n… Read more \n",
        "latlong": null
    },
    "Hollywood Studios 2": {
        "owned": false,
        "title": "Been There Disney – Hollywood Studios 2",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-hollywood-studios-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/10/bt_hollywood_studios_2_main-407x291.jpg",
        "description": "\nThe rumors about the releases commemorating the Walt Disney World 50th Anniversary have been in the air for quite some time. And it is now official, Starbucks has revealed the new mugs and ornaments for at least two parks today.\nThis is Been There Disney – Hollywood Studios 2 and as you can see it’s quite different from the “regular” releases, even Disney ones. The box is not orange anymore but has a rather gold color and the top of the cover reminds us about the 50th Anniversary of the WDW.… Read more \n",
        "latlong": null
    },
    "Texas 3": {
        "owned": false,
        "title": "Been There – Texas 3",
        "url": "https://starbucks-mugs.com/mug/been-there-texas-3/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/09/bt_texas_3_1-407x392.jpg",
        "description": "\nThis is not a regular release, but rather a limited edition mug, that won’t be available to the public. Yes, it seems that Been There Texas 3 will be a “very hard to find mug” unless you work for or with Starbucks Texas.\nAs you can see from the images below, it is drastically different from Texas v1 or Texas v2 (which are almost identical). However, the moment I saw the new mug, I’ve realized I’d seen this design before. A quick review of the previous releases brought me to Been There Dallas mug.… Read more \n",
        "latlong": null
    },
    "Sacramento": {
        "owned": false,
        "title": "Been There – Sacramento",
        "url": "https://starbucks-mugs.com/mug/been-there-sacramento/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/06/bt_sacramento_1_407-407x317.jpg",
        "description": "\nHere’s the brand new mug – Been There Sacramento. It seems that Starbucks will be releasing mugs for more and more US cities, which is great. The design of this mug is using a color palette similar to the San Francisco mug and is featuring many points of interest and landmarks of the city.\nI would like to mention one of the symbols of Sacramento, which is its nickname – the “City of Trees”. Indeed, the city has above average number of trees per capita when compared with other major cities in the United States and the world.… Read more \n",
        "latlong": [
            38.5815719,
            -121.4943996
        ]
    },
    "Oklahoma 2": {
        "owned": false,
        "title": "Been There – Oklahoma 2",
        "url": "https://starbucks-mugs.com/mug/been-there-oklahoma-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_oklahoma_2_1-407x345.jpg",
        "description": "\nIt has been almost two years, since an updated version of the Oklahoma ornament was introduced. I have been monitoring the web and keeping an eye on a similar revision for the full-size mug. My understanding, is that there were so many v1s produced that Starbucks had to wait till all the inventory is sold out. The change that Been There – Oklahoma 2 introduces is an addition of an apostrophe to “Boomers’ Paradise”, see the comparison photo of v1 and v2 below.… Read more \n",
        "latlong": [
            34.7432484,
            -95.3939551
        ]
    },
    "Arizona 3": {
        "owned": false,
        "title": "Been There – Arizona 3",
        "url": "https://starbucks-mugs.com/mug/been-there-arizona-3/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/08/bt_arizona_3_1-407x312.jpg",
        "description": "\nA similar change to what’s just happened to mini mug we can witness with the release of Been There – Arizona 3. The best way to distinguish the new version from v1 and v2 is to look at the front of it and spot the “Red Rock Sedona” label that’s replaced the “Grand Canyon” (it has been moved to the back of the mug). Another element that can help is two chili peppers just below the title.\nIf we count the Christmas version too, we now have four variants of the Arizona Been There mug.… Read more \n",
        "latlong": [
            34.0489281,
            -111.0937311
        ]
    },
    "Barbados": {
        "owned": false,
        "title": "Been There – Barbados",
        "url": "https://starbucks-mugs.com/mug/been-there-barbados/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/07/bt_barbados_1_407-407x307.jpg",
        "description": "\nStarbucks Been There – Barbados mug commemorates, in a way, the official opening of the first Starbucks store in this island country from the Caribbean region. Located at Haggatt Hall, Bridgetown (the country’s capital), it welcomes its first customers starting today (July 30).\nThe mug showcases the flora and fauna of the island, which is one of the major touristic destinations of the region.\nI am seeing Carlisle Bay, with Bridgetown in the back. This natural harbor has been turned into a marine park which became a popular spot for scuba diving.… Read more \n",
        "latlong": [
            13.193887,
            -59.543198
        ]
    },
    "Kentucky 2": {
        "owned": false,
        "title": "Been There – Kentucky 2",
        "url": "https://starbucks-mugs.com/mug/been-there-kentucky-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/07/bt_kentucky_v2_1_407-407x304.jpg",
        "description": "\nLong time no see, Starbucks. The most recent release brings the update for the “Bluegrass State”. Been There – Kentucky v2 introduces the change from “Mammoth Caves” to “Mammoth Cave” on the front of the mug. Although, the more I look at the mugs (see comparison picture below), the more I think it was actually “Mammuth”. They’ve definitely changed the look of that “o” (or was it “u”?). What do you guys think about it? Leave a comment below, please.\n… Read more \n",
        "latlong": [
            37.5687365,
            -85.93045459999999
        ]
    },
    "Yosemite National Park": {
        "owned": false,
        "title": "Been There – Yosemite National Park",
        "url": "https://starbucks-mugs.com/mug/been-there-yosemite-national-park/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/05/bt_yosemite_1_407-407x308.jpg",
        "description": "\nThe release of Been There – Yosemite National Park denotes the further expansion of the BT series beyond cities and countries. Yes, we had amusement parks, but never a National Park, which made me wonder what other parks have Starbucks stores in them? After a quick search, it seems that this is the only one so far, and I think I know what could be the reason for that. It seems that the news about the opening of the store in Yosemite National Park was not well received by many park admirers.… Read more \n",
        "latlong": [
            37.8651011,
            -119.5383294
        ]
    },
    "Tatooine": {
        "owned": false,
        "title": "Star Wars Been There – Tatooine",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-tatooine/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/05/Tatooine_1_407-407x319.jpg",
        "description": "\nStar Wars Been There – Tatooine is a mug for probably one of the most well-known locations from the Star Wars franchise. Home planet to both Luke and Anakin Skywalker, it is remembered for its desert landscapes and beautiful sunsets of its two suns. I believe it is the only planet featured in all six episodes of the saga (although only mentioned in The Empire Strikes Back). It is also the very first planet to be seen in the film franchise (Episode IV – A New Hope) and that’s what most of the mug is dedicated to.… Read more \n",
        "latlong": null
    },
    "Endor": {
        "owned": false,
        "title": "Star Wars Been There – Endor",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-endor/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/05/Endor_1_407-407x316.jpg",
        "description": "\nStar Wars Been There – Endor is a mug for a small forested moon that orbited the Tana (Endor), a gas giant from the Endor system. Other names of the moon included the Forest Moon of Endor or the Sanctuary Moon.\nThe front of the mug shows Ewoks, native inhabitants of the moon. They were primitive but curious and friendly furred bipeds that used spears, slings, and knives as weapons. On the other hand, they appeared to be quick learners of advanced technologies and concepts brought by the Empire.… Read more \n",
        "latlong": null
    },
    "Batuu": {
        "owned": false,
        "title": "Star Wars Been There – Batuu",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-batuu/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/05/batuu_1_407-407x314.jpg",
        "description": "\nHere’s Star Wars Been There – Batuu, the release that I’ve mentioned in my previous post. It makes it the fourth mug from this mini collection.\nIn the Star Wars universe, Batuu is a remote terrestrial planet on the edge of the galaxy’s Outer Rim Territories. Batuu was once covered by massive trees, that later transformed into stone towers after a cataclysm. These formations, referred to by local Batuuans as “spires”, became landmarks for settlers. Black Spire Outpost is the largest settlement on the planet, which was a busy stop for travelers before the invention of hyperspace travel.… Read more \n",
        "latlong": null
    },
    "Delhi": {
        "owned": true,
        "title": "Been There – Delhi",
        "url": "https://starbucks-mugs.com/mug/been-there-delhi/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_delhi_1_407-407x372.jpg",
        "description": "\nAt the very first glance it might seem that Starbucks Been There Delhi is the mug for the same city as we’ve seen within the YAH collection: New Delhi. Make no mistake, these are two different entities. New Delhi is an administrative district within the borders of Delhi. In other words, it’s a city within another city.\nDelhi is one of the oldest cities in the world and has always been a dominant trading and commercial center in northern India.… Read more \n",
        "latlong": [
            28.6139391,
            77.2090212
        ]
    },
    "Mumbai": {
        "owned": true,
        "title": "Been There – Mumbai",
        "url": "https://starbucks-mugs.com/mug/been-there-mumbai/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_mumbai_1_407-407x319.jpg",
        "description": "\nStarbucks Been There Mumbai is the mug for the second-largest city in India. It is the financial, commercial, and entertainment center of the country. The official name of the city was Bombay till 1995.\nThe front of the mug is occupied by Chhatrapati Shivaji Terminus. It was built in 1888 from Bori Bunder railway station under the new name: Victoria Terminus. It is now considered a UNESCO World Heritage Site thanks to its High Victorian Gothic style of architecture.\nThe back of the mug shows the Gateway of India which is an arch built between 1913 and 1924 to commemorate the arrival of King-Emperor George V and Queen-Empress Mary in Mumbai.… Read more \n",
        "latlong": [
            19.0759837,
            72.8776559
        ]
    },
    "Bengaluru": {
        "owned": true,
        "title": "Been There – Bengaluru",
        "url": "https://starbucks-mugs.com/mug/been-there-bengaluru/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_Bengaluru_1_407-407x314.jpg",
        "description": "\nStarbucks Been There Bengaluru is the mug for the “IT capital of India” thanks to its role as a hub for major IT companies both from India and abroad and a home for many IT professionals in the country. The front of the mug showcases the skyline of the city and also a picture of Lal Bagh Botanical Garden which is more than 200 years old.\n… Read more \n",
        "latlong": [
            12.9715987,
            77.5945627
        ]
    },
    "Hyderabad": {
        "owned": true,
        "title": "Been There – Hyderabad",
        "url": "https://starbucks-mugs.com/mug/been-there-hyderabad/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_Hyderabad_1_407-407x309.jpg",
        "description": "\nStarbucks Been There – Hyderabad is yet another mug from India that has been released as a batch recently. The name of the city can literally be translated as “Lion City”, where Haydar means ‘lion’ and ābād goes for ‘city’. There are different theories about the origin of the name. One of them suggests it was named after Caliph Ali Ibn Abi Talib, also known as Haydar (since he was brave as a lion in battles). Another nickname, “City of Pearl”, it got from being the main pearl trading center in India.… Read more \n",
        "latlong": [
            17.406498,
            78.47724389999999
        ]
    },
    "India": {
        "owned": true,
        "title": "Been There – India",
        "url": "https://starbucks-mugs.com/mug/been-there-india/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_india_1_407-407x294.jpg",
        "description": "\nStarbucks Been There – India is one of the five mugs from BT series released for this country recently. As a reminder, there were only two YAHs from India: New Delhi and Mumbai.\nThis new mug is designed using the blue palette (my favorite) and showcases certain landmarks which India is known for: from architecture and animals to Bollywood and dancing.\nDance has always been a major part of the religious and cultural life in India. It dates back to ancient times and is believed to originate from dances and rituals of the Vedic period (circa 1500 – 500 BC).… Read more \n",
        "latlong": [
            20.593684,
            78.96288
        ]
    },
    "Guatemala": {
        "owned": false,
        "title": "Been There – Guatemala",
        "url": "https://starbucks-mugs.com/mug/been-there-guatemala/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_guatemala_1_1_407-407x342.jpg",
        "description": "\nStarbucks Been There – Guatemala is a mug for the most populous country in Central America. The territory of modern Guatemala is considered the historical center of the Mayan civilization, hence the pyramid-shaped structure that you can see on the left of the front of the mug. This is Tikal Temple I (a.k.a. the Temple of the Great Jaguar) located in Tikal, one of the largest cities and archaeological sites of the pre-Columbian Maya civilization in Mesoamerica. This funerary temple is built over the tomb of Jasaw Chan K’awiil I who ruled AD 682–734\n… Read more \n",
        "latlong": [
            15.783471,
            -90.23075899999999
        ]
    },
    "El Salvador": {
        "owned": false,
        "title": "Been There – El Salvador",
        "url": "https://starbucks-mugs.com/mug/been-there-el-salvador/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_el_salvador_1_1_407-407x320.jpg",
        "description": "\nStarbucks Been There – El Salvador is a mug for the smallest country in Central America. One of the elements on the front of the mug is Pupusa. This is a national Salvadoran dish which is essentially a thick corn tortilla stuffed with the filling of your choice, which usually includes beef, beans, cheese, or pork. Pupusas are often served with curtido, a fermented cabbage relish, which usually includes carrots, onions, spices, and garlic. This authentic food is so popular that it even has its own festival – Festival Nacional De La Pupusa, which is held in November.… Read more \n",
        "latlong": [
            13.794185,
            -88.89653
        ]
    },
    "Macau": {
        "owned": false,
        "title": "Been There – Macau",
        "url": "https://starbucks-mugs.com/mug/been-there-macau/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/02/bt_macau_407-407x278.jpg",
        "description": "\nStarbucks Been There – Macau marks another milestone for this collection. It seems that Starbucks is rolling out BT mugs in a similar fashion to what it used to with YAH. Just as a reminder, YAH Macau was released back in 2016, it was then accompanied by Hong Kong. These two cities, as you probably know, are two special administrative regions of the People’s Republic of China. It took Starbucks another three years to release YAHs for Mainland China.… Read more \n",
        "latlong": [
            22.198745,
            113.543873
        ]
    },
    "The Florida Keys": {
        "owned": false,
        "title": "Been There – The Florida Keys",
        "url": "https://starbucks-mugs.com/mug/been-there-the-florida-keys/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/03/bt_florida_keys_1_407-407x308.jpg",
        "description": "\nLike I’ve mentioned in my previous post, here is the second mug from the recent U.S. release: Starbucks Been There – The Florida Keys. It is a mug for the 120 miles long chain of islands that begins at the tip of Florida and ends just 90 miles to the North from Cuba. The Keys are divided into five regions: Key Largo, Islamorada, Marathon, Big Pine, and Lower Keys and Key West. The great part of the keys is that you can get there by car.… Read more \n",
        "latlong": [
            25.0979464,
            -80.4369215
        ]
    },
    "Monterey": {
        "owned": true,
        "title": "Been There – Monterey",
        "url": "https://starbucks-mugs.com/mug/been-there-monterey/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/03/bt_Monterey_1_407-407x333.jpg",
        "description": "\nAfter a long period of no releases for the U.S. (except updating certain cities and states with version #2), Starbucks issues two new mugs. Been There – Monterey is one of those. You might remember that there is already the Been There mug from Mexico with the name that sounds very similar. I was even confused at first, but after a closer look realized the difference (double “r” for the Mexican city).\nMonterey is located on the Pacific Coast of California.… Read more \n",
        "latlong": [
            36.6002378,
            -121.8946761
        ]
    },
    "Morelia": {
        "owned": false,
        "title": "Been There – Morelia",
        "url": "https://starbucks-mugs.com/mug/been-there-morelia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_Morelia_1_407-407x333.jpg",
        "description": "\nStarbucks Been There – Morelia is the mug for the capital of the central Mexican state of Michoacán. The city is well worth visiting for its well-preserved colonial architecture. The historic center resembles the layout of the city when it was founded in 1541. Some of the most notable landmarks include the Cathedral of Morelia as well as plazas that surround it: the Plaza de Armas, (Plaza de Los Mártires), the Juárez Plaza, and the Melchor Ocampo Plaza. The front of the mug showcases the Morelia Aqueduct, which was in use till 1910.… Read more \n",
        "latlong": [
            19.7059504,
            -101.1949825
        ]
    },
    "Mazatlan": {
        "owned": false,
        "title": "Been There – Mazatlan",
        "url": "https://starbucks-mugs.com/mug/been-there-mazatlan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_Mazatlan_1_407-407x352.jpg",
        "description": "\nStarbucks Been There – Mazatlan was released back in 2018. It is the mug for the city on the Pacific coast of the Mexican state Sinaloa, that overlooks the southernmost tip of the Baja California Peninsula. It offers a nice combination of great sand beaches and a 13 miles long boardwalk (Malecón), which is considered to be one of the longest in the world. Add amazing local cuisine and historical architectural landmarks on top of that and you get a perfect recipe for the vacation gateway.… Read more \n",
        "latlong": [
            23.2494148,
            -106.4111425
        ]
    },
    "Leon": {
        "owned": false,
        "title": "Been There – Leon",
        "url": "https://starbucks-mugs.com/mug/been-there-leon/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_leon_1_1_407-407x333.jpg",
        "description": "\nHere’s Starbucks Been There – Leon from 2018 which is the biggest city in the Mexican state of Guanajuato. For some reason, it was missing from my list.\nThe hot air balloons on the front of the mug are referring to The Leon International Balloon Festival, which is the biggest of its kind in Latin America. It takes place annually since 2002.\nYou can also see the boots, the belt, and the bag, on the side of the mug. That’s for the leather industry of the city, which offers numerous products within Mexico and well outside of the country.… Read more \n",
        "latlong": null
    },
    "Chihuahua": {
        "owned": false,
        "title": "Been There – Chihuahua",
        "url": "https://starbucks-mugs.com/mug/been-there-chihuahua/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/10/bt_chihuahua_1_1_407-407x329.jpg",
        "description": "\nI am catching up by adding missing Mexican mugs to the site. This Starbucks Been There – Chihuahua mug has been released back in 2018. Chihuahua is the name for both the state and the city in Mexico. My understanding it is a state mug since I don’t really see any city symbols or points of interest.\nThe Estado Libre y Soberano de Chihuahua is the largest state in Mexico by area and hence having the nickname El Estado Grande (‘The Big State’).… Read more \n",
        "latlong": null
    },
    "Jamaica": {
        "owned": false,
        "title": "Been There – Jamaica",
        "url": "https://starbucks-mugs.com/mug/been-there-jamaica/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/02/bt_jamaica_1_407-407x347.jpg",
        "description": "\nStarbucks Been There – Jamaica introduces the switch from Icon to Been There series for “the land of wood and water.” As per the company’s Facebook page, this mug is available for purchase in all stores right now. As soon as we get better pics, we will go over the details of the design. So far, it seems they’ve added the famous motto of the island – “no problem”. I guess it is supposed to symbolize the philosophy of life or a part of Jamaican culture, which is a big topic of its own.… Read more \n",
        "latlong": [
            18.109581,
            -77.297508
        ]
    },
    "Hong Kong Disneyland": {
        "owned": false,
        "title": "Been There Disney – Hong Kong Disneyland – 15 Years of Magical Dreams",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-hong-kong-disneyland-15-years-of-magical-dreams/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/11/bt_hong_kong_disneyland_15_407-407x390.jpg",
        "description": "\nHong Kong Disneyland is celebrating 15 Years of Magical Dreams with exclusive Starbucks merchandise. As you can see from the photos below, there is a mug, a tumbler, and a tote that were designed to commemorate September 12, 2005, the date, when fifteen years ago, Hong Kong Disneyland was opened to the public. A special ceremony in front of the Castle of Magical Dreams was held today to mark this milestone. There are special decorations, banners, and outfits for many Disney friends made with purple, pink, and gold colors!… Read more \n",
        "latlong": [
            22.3129666,
            114.0412819
        ]
    },
    "Pike Place 2": {
        "owned": false,
        "title": "Been There Christmas – Pike Place 2",
        "url": "https://starbucks-mugs.com/mug/been-there-christmas-pike-place-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/11/btc_pike_place_2020_preview-407x317.jpg",
        "description": "\nThis could easily be the most exciting Starbucks release of the 2020 Holiday Season. Been There Christmas – Pike Place v2 introduces a completely unique design, never seen before. As you can see from the picture, the color of the mug is something in between chocolate and hickory with golden letters. The same gold color was also used to outline the symbols of Pike Place Market. I like this new design a lot! Let me know in the comments about your thoughts on this mug.… Read more \n",
        "latlong": [
            47.6094454,
            -122.3418219
        ]
    },
    "Turks & Caicos": {
        "owned": false,
        "title": "Been There – Turks & Caicos",
        "url": "https://starbucks-mugs.com/mug/been-there-turks-caicos/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_turks_caicos_1_1_1-407x318.jpg",
        "description": "\nStarbucks Been There – Turks & Caicos is the mug for a British Overseas Territory which consists of two groups of islands: the larger Caicos Islands and smaller Turks Islands. Being the perfect touristic destination it welcomes hundreds of thousands of visitors each year, which is a lot, considering the size of the islands and the population of about 40k people.\nSurely enough, sea life exploration and numerous water activities are what inspired the designers of the mug.\n… Read more \n",
        "latlong": [
            21.694025,
            -71.797928
        ]
    },
    "Cayman Islands": {
        "owned": false,
        "title": "Been There – Cayman Islands",
        "url": "https://starbucks-mugs.com/mug/been-there-cayman-islands/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_cayman_islands_1_407-407x348.jpg",
        "description": "\nStarbucks Been There – Cayman Islands is the mug for the autonomous British Overseas Territory in the western Caribbean Sea. George Town is the capital and the most populous city in the country which consists of three islands: Grand Cayman (the largest), Cayman Brac, and Little Cayman (the smallest).\nThe designers of the mug were inspired by what these islands are known for: the beach resorts, various scuba diving, and snorkeling activities as well as deep-sea fishing excursions.\n… Read more \n",
        "latlong": [
            19.3133,
            -81.2546
        ]
    },
    "Santa Cruz de la Sierra": {
        "owned": false,
        "title": "Been There – Santa Cruz de la Sierra",
        "url": "https://starbucks-mugs.com/mug/been-there-santa-cruz-de-la-sierra/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_santa_cruz_de_la_sierra_1_1_407-407x323.jpg",
        "description": "\nStarbucks Been There – Santa Cruz de la Sierra is the only city mug from Bolivia, with no country mug released so far. This city is the largest in Bolivia being its principal industrial center. It first founded in 1561 by Spanish explorer Ñuflo de Chavez. Interestingly enough, the location of the city has been moved several times since then (125 miles in total to the west).\nDesigners used a green palette for the design of the mug, which reflects the colors of the flag of the city – two green stripes divided by a white stripe.… Read more \n",
        "latlong": [
            -17.8145819,
            -63.1560853
        ]
    },
    "Uruguay": {
        "owned": true,
        "title": "Been There – Uruguay",
        "url": "https://starbucks-mugs.com/mug/been-there-uruguay/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_uruguay_1_1_407-407x300.jpg",
        "description": "\nStarbucks Been There – Uruguay is another mug from South America that I had no chance to add, even though it was released back in 2018. The country, whose official name is the Oriental Republic of Uruguay, borders Brazil on the north and Argentina on the south. Montevideo is the capital and the largest city of the country.\nDuring the colonization times, the ownership of these lands was not very well defined. It was always under influence of both Spain and Portugal.… Read more \n",
        "latlong": [
            -32.522779,
            -55.765835
        ]
    },
    "Ciudad de Mexico": {
        "owned": false,
        "title": "Been There – Ciudad de Mexico",
        "url": "https://starbucks-mugs.com/mug/been-there-ciudad-de-mexico/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/09/bt_ciudad_de_mexico_1_407-407x326.jpg",
        "description": "\nStarbucks Been There – Ciudad de Mexico is a mug for the capital and largest city of Mexico and the most populous city in North America. Did you know that Mexico City is located at the altitude of 7000 ft and hence is considered a high-altitude city? It is also the oldest capital in the Americas. The city was originally built on an island of Lake Texcoco by the Aztecs in 1325 as Tenochtitlan, which was almost completely destroyed by the Spanish in 1521.… Read more \n",
        "latlong": [
            19.4326077,
            -99.133208
        ]
    },
    "Guanajuato": {
        "owned": false,
        "title": "Been There – Guanajuato",
        "url": "https://starbucks-mugs.com/mug/been-there-guanajuato/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/04/bt_guanajuato_1_407-407x355.jpg",
        "description": "\nI believe that Starbucks Been There – Guanajuato is a city mug, based on its design, which is mostly featuring the city’s landmarks.\nHere are they:\n– Alhóndiga de Granaditas was originally built as grain storage but later played a major role in the first battle of the Mexican War of Independence between insurgents and royalist troops on September 28, 1810.\n– The Guanajuato tunnels are a series of wide channels that extended under the city and help divert traffic away from the city center.… Read more \n",
        "latlong": [
            21.0190145,
            -101.2573586
        ]
    },
    "Guadalajara": {
        "owned": false,
        "title": "Been There – Guadalajara",
        "url": "https://starbucks-mugs.com/mug/been-there-guadalajara/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/09/bt_guadalajara_1_407-407x338.jpg",
        "description": "\nStarbucks Been There – Guadalajara is a mug for the second-largest metropolitan area in Mexico. The city is an important center of business, finance, technology, science, culture, and education in the country.\nGuadalajara is considered to be the home of Mariachi which is a well-known genre of Regional Mexican music. The usual mariachi group consists of as many as eight violins, two trumpets and at least one guitar, including a high-pitched vihuela and an acoustic bass guitar, called a guitarrón. You can see four Mariachi men on the front of the mug.… Read more \n",
        "latlong": [
            40.632489,
            -3.16017
        ]
    },
    "Kaohsiung": {
        "owned": false,
        "title": "Been There – Kaohsiung",
        "url": "https://starbucks-mugs.com/mug/been-there-kaohsiung/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_kaohsiung-407x338.jpg",
        "description": "\nStarbucks Been There – Kaohsiung is a mug for Kaohsiung City, a special municipality in southern Taiwan. This is the only mug from the resent batch of Taiwanese mugs that doesn’t start with “T”.… Read more \n",
        "latlong": [
            22.6272772,
            120.3014375
        ]
    },
    "Taichung": {
        "owned": false,
        "title": "Been There – Taichung",
        "url": "https://starbucks-mugs.com/mug/been-there-taichung/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_taichung-407x342.jpg",
        "description": "\nStarbucks Been There – Taichung is a mug for Taiwan’s second most populous city.… Read more \n",
        "latlong": [
            24.1631651,
            120.6746691
        ]
    },
    "Tainan": {
        "owned": false,
        "title": "Been There – Tainan",
        "url": "https://starbucks-mugs.com/mug/been-there-tainan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_tainan-407x341.jpg",
        "description": "\nStarbucks Been There – Tainan is a mug for the city which is also known as the “Capital City” for its over 200 years of history as the capital of Taiwan.… Read more \n",
        "latlong": [
            22.9997281,
            120.2270277
        ]
    },
    "Taipei": {
        "owned": false,
        "title": "Been There – Taipei",
        "url": "https://starbucks-mugs.com/mug/been-there-taipei/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_taipei-407x344.jpg",
        "description": "\nStarbucks Been There – Taipei is the mug for Taipei City, which is the capital and a special municipality of Taiwan (ROC).… Read more \n",
        "latlong": [
            25.0329694,
            121.5654177
        ]
    },
    "Taiwan": {
        "owned": false,
        "title": "Been There – Taiwan",
        "url": "https://starbucks-mugs.com/mug/been-there-taiwan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_taiwan-407x341.jpg",
        "description": "\nBeen There – Taiwan is a mug for the country, whose official name is the Republic of China (ROC). And even though, the country is not as big, there are 5 BT mugs in total released for it recently (with the other 4 being city mugs).… Read more \n",
        "latlong": [
            23.69781,
            120.960515
        ]
    },
    "Ensenada": {
        "owned": false,
        "title": "Been There – Ensenada",
        "url": "https://starbucks-mugs.com/mug/been-there-ensenada/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_ensenada_1_407-407x327.jpg",
        "description": "\nStarbucks Been There – Ensenada is a Mexican city located on the shores of Baja California. It is an important commercial, fishing, and tourist port which has emerged as a major cruise ship destination.\nThe design of the mug represents what Ensenada is also well known for – a starting point for Valle de Guadalupe wine region which offers tours. Wine tasting is available year-round, with some of the wineries also having restaurants where you can try local cuisine to make for an unforgettable experience.… Read more \n",
        "latlong": [
            31.8667427,
            -116.5963713
        ]
    },
    "Cancun": {
        "owned": false,
        "title": "Been There – Cancun",
        "url": "https://starbucks-mugs.com/mug/been-there-cancun/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/04/bt_cancun_1_407-407x330.jpg",
        "description": "\nStarbucks Been There – Cancun is a mug for a major touristic destination on the shores of the Caribbean Sea. The design of the mug represents sea and beach activities one can expect when visiting this area.\nIn terms of the tours, it is worth mentioning that Chichen Itza is just a three-hour drive from Cancun, so it makes sense to visit this amazing pre-Columbian city built by the Maya people.\nPlease note, this mug was released back in 2018\n… Read more \n",
        "latlong": [
            21.161908,
            -86.8515279
        ]
    },
    "Ho Chi Minh": {
        "owned": false,
        "title": "Been There – Ho Chi Minh",
        "url": "https://starbucks-mugs.com/mug/been-there-ho-chi-minh/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/08/bt_hochiminh_407-407x296.jpg",
        "description": "\nHere’s another mug from the pair that has been revealed recently by Starbucks Vietnam. Been There – Ho Chi Minh brought some controversy in the comments below the official news post of this release. It seems that many people would prefer Saigon over Ho Chi Minh for the name of the mug. There could be a couple of reasons for that. The largest city in Vietnam got its current official name, Ho Chi Minh City in 1976 when then Saigon was merged with the surrounding suburbs.… Read more \n",
        "latlong": [
            10.8230989,
            106.6296638
        ]
    },
    "Hanoi": {
        "owned": false,
        "title": "Been There – Hanoi",
        "url": "https://starbucks-mugs.com/mug/been-there-hanoi/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/08/bt_hanoi_407-407x321.jpg",
        "description": "\nStarbucks Been There – Hanoi is the first BT city mug from Vietnam. According to their official Facebook page, this new release is available in stores right now.\nHanoi is the capital of Vietnam and the second-largest city in the country. “City for Peace” was the title presented to Hanoi by UNESCO on 16 July 1999. You can see this nickname on the front of the mug.\n“Ancient Capital” or “The Capital of The Thousand Years Of Civilization” is another nickname that gives us an idea of how old the city is.… Read more \n",
        "latlong": [
            21.0277644,
            105.8341598
        ]
    },
    "Singapore": {
        "owned": true,
        "title": "Been There – Singapore",
        "url": "https://starbucks-mugs.com/mug/been-there-singapore/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/07/bt_singapore_main.jpg",
        "description": "\nStarbucks continues expanding the new collection of mugs in Asia. Been There – Singapore has just hit the stores in this island city-state from Southeast Asia. Modern Singapore was founded in 1819 as a trading port of the British Empire. It remained under British control till 1959 when it gained self-governance (there was a short period of Japan occupation though). It became part of the new federation of Malaysia in 1963 but due to numerous differences, it was expelled from the federation two years later, hence becoming an independent country.… Read more \n",
        "latlong": [
            1.352083,
            103.819836
        ]
    },
    "Santo Domingo": {
        "owned": false,
        "title": "Been There – Santo Domingo",
        "url": "https://starbucks-mugs.com/mug/been-there-santo-domingo/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/06/bt_santo_domingo_1_407-407x313.jpg",
        "description": "\nStarbucks Been There – Santo Domingo is a mug for the capital of the Dominican Republic. Founded by Bartholomew Columbus (younger brother of Christopher Columbus) in 1496, it is the oldest continuously inhabited European settlement in the Americas. The city is a gem for tourists interested in learning about history. There are many buildings from the 1500s, in The Zona Colonial, a historic center.\nStay tuned for more pics and the full review of the mug.\n2020-10-12 update: adding the pictures of all the sides of the mug.… Read more \n",
        "latlong": [
            18.4626178,
            -69.93609239999999
        ]
    },
    "Republica Dominicana": {
        "owned": false,
        "title": "Been There – Republica Dominicana",
        "url": "https://starbucks-mugs.com/mug/been-there-republica-dominicana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/06/bt_Republica_Dominicana_1_407-407x322.jpg",
        "description": "\nStarbucks is coming to Dominicana with two new mugs. Been There – Republica Dominicana is one of them. It is designed using the red color palette with some elements in yellow.\nFrom first glance, it seems that the mug is featuring a baseball player, which refers to baseball being very popular in this Caribbean country. The Dominican Republic Professional Baseball League (LIDOM in Spanish), is a professional baseball league consisting of six teams spread across the Dominican Republic. The league’s players include many prospects that go on to play in Major League Baseball in the United States.… Read more \n",
        "latlong": [
            18.735693,
            -70.162651
        ]
    },
    "Dagobah": {
        "owned": false,
        "title": "Star Wars Been There – Dagobah",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-dagobah/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/05/bt_sw_dagobah_1_407-407x298.jpg",
        "description": "\nStar Wars Been There – Dagobah mug completes the trio released today.\nDagobah made its first appearance in “Episode V – The Empire Strikes Back”. We see it twice: before and after events occurring on the Bespin. In the Star Wars universe, Dagobah is a planet of swamps and forests. One of the purest places in the galaxy within the Force it served as a refuge for Jedi Grand Master Yoda, that is why we see a lot of him on the mug.… Read more \n",
        "latlong": null
    },
    "Bespin": {
        "owned": false,
        "title": "Star Wars Been There – Bespin",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-bespin/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/05/bt_sw_bespin_1_407-407x295.jpg",
        "description": "\nStar Wars Been There – Bespin mug has also been released today and is available for the purchase in the Disney Shop online.\nIn the Star Wars Universe, Bespin is a gas giant with a thin layer of breathable atmosphere a.k.a. the “Life Zone”. The planet is the source of Tiabana gas which is used in hyperdrives and starship weaponry. As the support for the mining industry, several mining complexes float above the planet within “Life Zone”. Cloud City is one of them, you can see it on the front and the back of the mug.… Read more \n",
        "latlong": null
    },
    "Hoth": {
        "owned": false,
        "title": "Star Wars Been There – Hoth",
        "url": "https://starbucks-mugs.com/mug/star-wars-been-there-hoth/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/05/bt_sw_hoth_1_407-407x297.jpg",
        "description": "\nStar Wars Been There – Hoth is a mug that I’ve mentioned and have shared the picture of in my previous post. Well, it is now official! As it was revealed by Disney Shop, new Starbucks Star Wars themed mugs are coming out on May 4h, 2020. Sure thing Disney could not resist choosing this unofficial holiday of the Star Wars franchise to release new merchandise. This pun on a famous line from the saga, “May the Force be with you” got far beyond the fan-based universe.… Read more \n",
        "latlong": null
    },
    "Cozumel": {
        "owned": false,
        "title": "Been There – Cozumel",
        "url": "https://starbucks-mugs.com/mug/been-there-cozumel/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_cozumel_1_407-407x326.jpg",
        "description": "\nStarbucks Been There – Cozumel is a mug for an island and municipality in the Caribbean Sea off the coast of Mexico’s Yucatán Peninsula. It is a well known touristic destination with multiple resorts, restaurants, scuba diving and snorkeling facilities.\nIt is also a popular port for cruize ships, one of those we can see on the front of the mug.\nTumba del Caracol at Punta Sur  (can be seen on the front as well) was Mayan temple built during the Post Classic period (950 – 1539 AD).… Read more \n",
        "latlong": [
            20.4229839,
            -86.9223432
        ]
    },
    "Acapulco": {
        "owned": false,
        "title": "Been There – Acapulco",
        "url": "https://starbucks-mugs.com/mug/been-there-acapulco/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_acapulco_1-407x355.jpg",
        "description": "\nStarbucks Been There – Acapulco is a mug for the resort city on the Pacific Coast of Mexico. The full name of the city is Acapulco de Juárez and it was well known as a port since the early colonial period of Mexico’s history all thanks to the location and deep bay. To add more to that, the port was the final destination for the Manila Galleons – Spanish trading ships making round-trip voyages between the ports of Acapulco and Manila (both being a part of New Spain).… Read more \n",
        "latlong": [
            16.8639515,
            -99.8822807
        ]
    },
    "Monterrey": {
        "owned": false,
        "title": "Been There – Monterrey",
        "url": "https://starbucks-mugs.com/mug/been-there-monterrey/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_Monterrey_1_407-407x352.jpg",
        "description": "\nStarbucks Been There – Monterrey is a mug for the capital of the Mexican state of Nuevo León. Thanks to being a commercial center of northern Mexico and the base of many international corporations, Monterrey’s GDP is the second largest in the country.\nThe city is surrounded by large mountain ranges and even its name is translated as “King mountain”. One of these mountains, the Cerro de la Silla, is depicted on the front of the mug. Its two peaks, Pico Norte and Pico la Virgen form somewhat a saddle on the top of it, hence the name “Saddle mountain”.… Read more \n",
        "latlong": [
            25.6866142,
            -100.3161126
        ]
    },
    "Tulum": {
        "owned": false,
        "title": "Been There – Tulum",
        "url": "https://starbucks-mugs.com/mug/been-there-tulum/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_tulum_1-407x355.jpg",
        "description": "\nTulum is one of the eleven municipalities of the Mexican state of Quintana Roo.  Starbucks Been There – Tulum is a mug for one of the archaeological sites which that municipality is home to. This is the third most-visited archaeological site in Mexico thanks to its proximity to Riviera Maya and Cancun in particular. The ruins of a pre-Columbian Mayan walled city are situated on a 40ft tall cliff. It served as a major port for Coba and saw its development peak in the 13th-15th centuries.… Read more \n",
        "latlong": [
            20.2114185,
            -87.46535019999999
        ]
    },
    "Merida": {
        "owned": false,
        "title": "Been There – Merida",
        "url": "https://starbucks-mugs.com/mug/been-there-merida/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_merida_1_407-407x337.jpg",
        "description": "\nStarbucks Been There – Merida is a mug for the largest city of the Yucatán Peninsula. The origin of its nickname “The White City” (La Ciudad Blanca) is not exactly clear. But what’s certain is that thanks to a distinctive blend of traditions inherited from the ancient Maya civilization and customs brought by Spanish conquistadors, it was named American Capital of Culture in the years 2000 and 2017. And while it is a modern city and state capital, it is also a cultural center, featuring multiple museums, art galleries, restaurants, movie theatres.… Read more \n",
        "latlong": [
            20.9673702,
            -89.5925857
        ]
    },
    "New Zealand": {
        "owned": false,
        "title": "Been There – New Zealand",
        "url": "https://starbucks-mugs.com/mug/been-there-new-zealand/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_new_zealand_407-407x370.jpg",
        "description": "\nAfter a small delay, Starbucks Been There – New Zealand is joining other city mugs from Aotearoa, which is the Māori name for New Zealand. The common translation is “long white cloud” and refers to the legend where Polynesians who discovered these islands first,  thought they were approaching land because of the cloud hovering over it.\nThe design of the mug mostly features flora and fauna of the country. Due to remoteness and separation from the other world, this region developed a distinct flora with 75% of it being unique.… Read more \n",
        "latlong": [
            -40.900557,
            174.885971
        ]
    },
    "Mississippi": {
        "owned": false,
        "title": "Been There – Mississippi",
        "url": "https://starbucks-mugs.com/mug/been-there-mississippi/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_mississippi_v1_1_407-407x412.jpg",
        "description": "\nThis is one of the few rare cases when version 1 of the mug is added after version 2. That’s because no one was sure exactly, whether Starbucks Been There – Mississippi v1 existed, till now. There were some rumors, of course, plus the fact that Mississippi was one of the last state mugs to be released. It now became obvious that the delay was caused by errors found on the mug which had to be recalled and replaced with the “fixed” version.… Read more \n",
        "latlong": [
            32.3546679,
            -89.3985283
        ]
    },
    "Playa del Carmen": {
        "owned": false,
        "title": "Been There – Playa del Carmen",
        "url": "https://starbucks-mugs.com/mug/been-there-playa-del-carmen/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_playa_del_carmen_front-407x286.jpg",
        "description": "\nStarbucks Been There – Playa del Carmen is a mug for a popular tourist destination located in the heart of the Riviera Maya. Apart from relaxing on one of its amazing beaches or getting into water activities like surfing or swimming, you can also enjoy an abundance of wildlife by diving, snorkeling or just wondering around. That’s what we see the most on the mug – a great number of animals such as Yucatan Parrots, Jabiru Storks, Flamingos, Green Sea Turtles, West Indian Manatees, monkeys, fish and many more.… Read more \n",
        "latlong": [
            20.6295586,
            -87.0738851
        ]
    },
    "Los Cabos": {
        "owned": true,
        "title": "Been There – Los Cabos",
        "url": "https://starbucks-mugs.com/mug/been-there-los-cabos/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_los_cabos_1_407-407x331.jpg",
        "description": "\nStarbucks Been There – Los Cabos is a mug for a municipality located at the southern tip of Mexico’s Baja California Peninsula, in the state of Baja California Sur. It is, in fact, two towns linked by a twenty-mile Resort Corridor of beach-front properties and golf courses. The smaller town, San José del Cabo, is the municipal seat, while the bigger one, Cabo San Lucas, is far more commercial with a nice marina and entertainment district. It was not always the case, as up to the 1990s it was a small rural fishing village.… Read more \n",
        "latlong": [
            22.8948129,
            -109.9152149
        ]
    },
    "Puerto Vallarta": {
        "owned": false,
        "title": "Been There – Puerto Vallarta",
        "url": "https://starbucks-mugs.com/mug/been-there-puerto-vallarta/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_puerto_vallarta_1_407-407x312.jpg",
        "description": "\nStarbucks Been There – Puerto Vallarta is a mug for a Pacific Ocean resort city in the Mexican state of Jalisco. Puerto Vallarta is named after Ignacio Vallarta, a former governor of Jalisco. The name of the city is often shortened to “Vallarta” in Spanish.\nHere are some points of interest from the mug:\n– The statue of a man waving his hand as he rides a giant seahorse is one of Puerto Vallarta’s most popular and recognizable landmarks. Upon close examination, one can see that this is actually a boy with a hat behind his back.… Read more \n",
        "latlong": [
            20.6565177,
            -105.211358
        ]
    },
    "Queretaro": {
        "owned": false,
        "title": "Been There – Queretaro",
        "url": "https://starbucks-mugs.com/mug/been-there-queretaro/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_queretaro_1-407x323.jpg",
        "description": "\nStarbucks Been There – Querétaro is a mug for one of the smallest states in Mexico. Its capital city is Santiago de Querétaro.\n– Aqueduct of Querétaro (in El Marqués municipality) supplied water to Querétaro for centuries. It still functions, bringing water for fountains in the historical center.\n– La Fuente de El Marqués, a.k.a. “La fuente de los perros o perritos” (“fountain with dogs and puppies”) commemorates Don Juan Antonio de Urrutia y Arana, Marques de la Villa del Villar del Aguila city’s benefactor, who financed the construction of the aqueduct.… Read more \n",
        "latlong": [
            20.5887932,
            -100.3898881
        ]
    },
    "Puebla": {
        "owned": false,
        "title": "Been There – Puebla",
        "url": "https://starbucks-mugs.com/mug/been-there-puebla/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_puebla_1-407x298.jpg",
        "description": "\nStarbucks Been There – Puebla is a state and city mug from Mexico. Puebla de Zaragoza is the capital and the largest city of Puebla state, giving the latter its name. The city was founded in 1531 in an area called Cuetlaxcoapan, which means “where serpents change their skin”, to secure the trade route between Mexico City and the port of Veracruz.\nHere are some elements from the mug, which the state is famous for:\n– China Poblana was a combination of a skirt, shawl and blouse meant to compliment a woman’s figure, a dress style traditional to the region of Pueblo in the 18th century.… Read more \n",
        "latlong": [
            19.0414398,
            -98.2062727
        ]
    },
    "Veracruz": {
        "owned": false,
        "title": "Been There – Veracruz",
        "url": "https://starbucks-mugs.com/mug/been-there-veracruz/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_veracruz_1-407x306.jpg",
        "description": "\nStarbucks Been There – Veracruz is a mug for a Mexican state on the shores of the Gulf of Mexico. It could very possibly be a mug for the whole state since it has the same name. Veracruz, that developed during Spanish colonization, is the state’s most populous city and has been Mexico’s oldest, largest, and historically most significant port.\nThe original name of the city Villa Rica de la Vera Cruz was given to the settlement by Hernán Cortés who commanded the second expedition to this region.… Read more \n",
        "latlong": [
            19.173773,
            -96.1342241
        ]
    },
    "Oaxaca": {
        "owned": false,
        "title": "Been There – Oaxaca",
        "url": "https://starbucks-mugs.com/mug/been-there-oaxaca/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_oaxaca_1-407x307.jpg",
        "description": "\nStarbucks Been There – Oaxaca is a mug for a state in Southwestern Mexico. The state is best known for its indigenous peoples and cultures who have survived better than most others in México due to the state’s rugged and isolating terrain. The most numerous and best known are the Zapotecs and the Mixtecs.\nThe state is a popular destination for tourists attracted to its archeological sites such as Monte Albán, the pyramid complex from which you can see on the back of the mug.… Read more \n",
        "latlong": [
            17.0731842,
            -96.7265889
        ]
    },
    "Zacatecas": {
        "owned": false,
        "title": "Been There – Zacatecas",
        "url": "https://starbucks-mugs.com/mug/been-there-zacatecas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_zacatecas_1-407x307.jpg",
        "description": "\nStarbucks Been There – Zacatecas is a state mug from Mexico. Zacatecas is best known for its silver mines which made it one of the main economic centers of Nueva España. Its colonial architecture and its big contribution to the Mexican Revolution are other milestones of the state and the city. The name comes from Nahuatl, means “people who live on the edge of the field” and was given to inhabitants of the region by their neighbors.\n… Read more \n",
        "latlong": [
            22.7727913,
            -102.5765714
        ]
    },
    "Villahermosa": {
        "owned": false,
        "title": "Been There – Villahermosa",
        "url": "https://starbucks-mugs.com/mug/been-there-villahermosa/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_villahermosa_1-407x324.jpg",
        "description": "\nStarbucks Been There – Villahermosa is the mug for the capital and largest city of the Mexican state of Tabasco. The name of the city literally translates as “Beautiful Village”, as you might have guessed or knew.\nMy attention was drawn to a giant head on the side of the mug. It is actually known as Monument 1, one of four Olmec colossal heads from La Venta, a pre-Columbian archaeological site. The height of these sculptures range from 5ft to 9ft and weight is 10-20 tonnes.… Read more \n",
        "latlong": [
            17.989456,
            -92.9475061
        ]
    },
    "Chiapas": {
        "owned": false,
        "title": "Been There – Chiapas",
        "url": "https://starbucks-mugs.com/mug/been-there-chiapas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_chiapas-407x317.jpg",
        "description": "\nStarbucks Been There – Chiapas is a mug for the southernmost state of Mexico. It borders with Guatemala to the east and southeast and has a coastline along the Pacific Ocean to the south.\nChiapas is home to the ancient Mayan ruins of Palenque, which can be seen on the back of the mug. Also anciently known as Lakamha (literally: “Big Water”), it was a Maya city that flourished in the 7th century but experienced decline later and was absorbed by the jungle.… Read more \n",
        "latlong": [
            16.7569318,
            -93.12923529999999
        ]
    },
    "San Miguel de Allende": {
        "owned": false,
        "title": "Been There – San Miguel de Allende",
        "url": "https://starbucks-mugs.com/mug/been-there-san-miguel-de-allende/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_san_miguel_de_aliende_front-407x329.jpg",
        "description": "\nStarbucks Been There – San Miguel de Allende is a mug for the Mexican city located in the far eastern part of Guanajuato.\nTwo names of historical persons are incorporated in the city’s name:\n– Friar Juan de San Miguel who arrived in Uruapan in 1533 and helped to evangelize the local villagers\n– Ignacio Allende, a martyr of Mexican Independence, who was born in a house facing the city’s central plaza\nLa Parroquia de San Miguel Arcángel can be seen on the side of the mug.… Read more \n",
        "latlong": [
            20.9144491,
            -100.745235
        ]
    },
    "México": {
        "owned": false,
        "title": "Been There – México",
        "url": "https://starbucks-mugs.com/mug/been-there-mexico/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_mexico_1-407x345.jpg",
        "description": "\nMexican BT mugs are finally making their appearance here. There are 26 in total and I would like to start with, Starbucks Been There – Mexico mug. It is designed using shades of green and yellow. Green, white and red are the colors of the National Flag. There is no official meaning of the colors, however, through the years they had the following symbolism:\n– Green: independence (from Spain); Hope;\n– White: religion (the Roman Catholic); Unity;\n– Red: union (Europe and America); Blood of the national heroes;\nHere are some symbols and points of interest from Mexico that can be seen on the mug:\n– El Castillo (Temple of Kukulcan) a must-visit part of Chichen Itza, a pre-Columbian city built by the Maya people.… Read more \n"
    },
    "Cebu": {
        "owned": false,
        "title": "Been There – Cebu",
        "url": "https://starbucks-mugs.com/mug/been-there-cebu/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/03/bt_cebu_main.jpg",
        "description": "\nStarbucks Been There – Cebu is a mug for the province of the Philippines located in the Central Visayas. It consists of the main island and 167 surrounding islands and islets. Its capital, Cebu City, a.k.a. “the Queen City of the South”, is the oldest city and first capital of the Philippines. The origin of the province name is probably coming from the old Cebuano language, where “sibu” or “sibo” means “trade”. Metro Cebu is the second-largest metropolitan area in the Philippines (after Metro Manila) with Cebu City being one of the busiest seaports in the Philippines and the second-largest air hub.… Read more \n",
        "latlong": [
            10.3156992,
            123.8854366
        ]
    },
    "Cavite": {
        "owned": false,
        "title": "Been There – Cavite",
        "url": "https://starbucks-mugs.com/mug/been-there-cavite/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_cavite-407x282.jpg",
        "description": "\nStarbucks Been There – Cavite is a mug for a province on the southern shores of Manila Bay, Philippines. It is considered “Historical Capital of the Philippines” and one of the most industrialized and fastest-growing provinces in the country.\nThese are some points of interest to visit:\n– Fort San Felipe is a military fortress built by Spanish military in 1609 for the protection of the city. Less than half of the original historic structure survived through years\n– Naval Station Sangley Point was a communication and hospital facility of the United States Navy\n– The Emilio F.… Read more \n",
        "latlong": [
            14.4791297,
            120.8969634
        ]
    },
    "Cagayan de Oro": {
        "owned": false,
        "title": "Been There – Cagayan de Oro",
        "url": "https://starbucks-mugs.com/mug/been-there-cagayan-de-oro/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_cagayan_de_oro-407x282.jpg",
        "description": "\nStarbucks Cagayan de Oro – is a city mug from Philippines. The name of the city can literally be translated as “River of Gold”. The addition of “Oro” might be related to the gold mining in the 1500s that were present in the barrios around the settlement of Cagayan.\nFrom the mug:\n– White water rafting or kayaking activities are popular along Cagayan de Oro River and are being promoted as major adventures of the region.\n– The MacArthur Memorial Marker is a landmark at Macabalan Wharf (the peaked cap on the front of the mug).… Read more \n",
        "latlong": [
            8.4802729,
            124.6497636
        ]
    },
    "Bulacan": {
        "owned": false,
        "title": "Been There – Bulacan",
        "url": "https://starbucks-mugs.com/mug/been-there-bulacan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_bulacan-407x282.jpg",
        "description": "\nStarbucks Been There – Bulacan is a province mug from the Luzon island in the Philippines.\nThe hanging bridge and the mount covered with trees is a reference to Biak-na-Bato National Park that was declared as such in 1937. More than a hundred caves of varying sizes and crystalline mineral formations are spread across the park. Among the most explored caves are the Aguinaldo Cave and the Bahay Paniki or Bat Cave, said to be home of at least six species of winged mammals: kabag-kabag, ngusong kabayo, bungisngis, sibsib, bayakan and pakibu.… Read more \n",
        "latlong": [
            14.7942735,
            120.8799008
        ]
    },
    "Batangas": {
        "owned": false,
        "title": "Been There – Batangas",
        "url": "https://starbucks-mugs.com/mug/been-there-batangas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_batangas-407x282.jpg",
        "description": "\nI am not exactly sure, whether Starbucks Been There – Batangas is a mug for Batangas province or the city of Batangas. Either way, here are some points of interest worth visiting/knowing about:\n– Snorkeling/diving (1), Tilapia Fish (3), Tawilis (6) – a popular activity in this region, thanks to the clear and calm waters that host colorful species of fish, wildlife and corals. That is pretty much all you need for an amazing snorkeling experience.\n– Lambanóg (2) is a traditional Filipino distilled palm liquor made from coconut or nipa palm sap\n– Taal Volcano (4) is located in the middle of the Taal Lake just 40 miles from Manila and poses a real danger since it’s the second most active volcano in the Philippines.… Read more \n",
        "latlong": [
            13.7564651,
            121.0583076
        ]
    },
    "Davao": {
        "owned": false,
        "title": "Been There – Davao",
        "url": "https://starbucks-mugs.com/mug/been-there-davao/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_davao-407x282.jpg",
        "description": "\nStarbucks Been There – Davao is the mug for the largest city in the Philippines in terms of land area.\nFrom the mug:\n– A huge crocodile on the front seems to be Pangil – a massive 18-foot saltwater crocodile, the largest in the Philippines. He lives in Davao Crocodile Park which is a popular touristic destination. There are many more crocodiles in the park as well as some other animals.\n– The People’s Park hosts 1,101 species of plants and trees, both indigenous and non-indigenous.… Read more \n",
        "latlong": [
            7.0736114,
            125.6110248
        ]
    },
    "Pampanga": {
        "owned": false,
        "title": "Been There – Pampanga",
        "url": "https://starbucks-mugs.com/mug/been-there-pampanga/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_pampanga-407x282.jpg",
        "description": "\nStarbucks Been There – Pampanga is a mug for a province on the northern shore of Manila Bay. Pampanga is rightfully considered as the Culinary Capital of the Philippines. Kapampangan cuisine is known for having exotic dishes such as Crispy Camaru (fried crickets) or Betute (stuffed frog) but if you’re just at the beginning of your food journey, there are other amazing dishes you can start with:\n– Morcon (Stuffed Meat Loaf) – made from pork with the sausage and boiled egg inside\n– Sisig – is made mostly from pig’s head.… Read more \n",
        "latlong": [
            15.079409,
            120.6199895
        ]
    },
    "Makati": {
        "owned": false,
        "title": "Been There – Makati",
        "url": "https://starbucks-mugs.com/mug/been-there-makati/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_makati-407x282.jpg",
        "description": "\nThis is a city-mug for a financial center of the Philippines – Starbucks Been There – Makati. The city is home for many multinational and local corporations, major banks, the Philippine Stock Exchange as well as foreign embassies. This is reflected on the mug in the form of tie and collar (2), Central Business District (4), Laptop (IT District) (8), Shopping (6).\nHere are other key elements from the front of the mug:\n– The Estrella–Pantaleon Bridge (1), a.k.a. the Rockwell Bridge is a two-lane bridge crossing the Pasig River\n– Legazpi Sunday Market (3) – a weekly market that is known for homemade local and organic food and other products.… Read more \n",
        "latlong": [
            14.554729,
            121.0244452
        ]
    },
    "Iloilo": {
        "owned": false,
        "title": "Been There – Iloilo",
        "url": "https://starbucks-mugs.com/mug/been-there-iloilo/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_iloilo-407x282.jpg",
        "description": "\nStarbucks Been There – Iloilo is a mug for a province in the Philippines.\nLocal food to try:\n– Iloilo (La Paz) Batchoy – the pork noodle soup which is prepared with pork offal and topped with crushed chicharron, pork cracklings that found its way into the local cuisine via Spain. Chicken stock and beef loin could also be added.\n– Pancit Molo is a soup with wontons that are stuffed with ground pork and shrimp. A very important ingredient is roasted garlic used for garnish which makes this soup something special.… Read more \n",
        "latlong": [
            10.7201501,
            122.5621063
        ]
    },
    "Boracay": {
        "owned": false,
        "title": "Been There – Boracay",
        "url": "https://starbucks-mugs.com/mug/been-there-boracay/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_boracay-407x282.jpg",
        "description": "\nStarbucks Been There – Boracay is a mug for a small island in the central Philippines known for its resorts and beaches. No wonder that the design of the mug pretty much reflects the following activities, sorted from “easy” to more “adventurous”:\n– Flip-Flops (3), Sand Castle (5) – experience full relaxation at one of many island’s beaches. You might choose White Beach for its fine white sand and amazing sunset views.\n– Willys Rock (4) – a nice rock in the middle of the shallow water.… Read more \n",
        "latlong": [
            11.9673753,
            121.924815
        ]
    },
    "Bacolod": {
        "owned": false,
        "title": "Been There – Bacolod",
        "url": "https://starbucks-mugs.com/mug/been-there-bacolod/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_bacolod-407x282.jpg",
        "description": "\nStarbucks Been There – Bacolod is a mug for the City of Smiles because of its Mardi Grass-like MassKara Festival with a spectacularly vivid mix of dance, color, and music.\nIt is also a “football city of the Philippines” with its Panaad Stadium which is used for tournaments and sports events. That’s why you see soccer players on the front of the mug.\nYou might also want to visit Bat Sanctuary when in town. It’s not something you get to see on a daily basis.… Read more \n",
        "latlong": [
            10.6713397,
            122.9510716
        ]
    },
    "Quezon City": {
        "owned": false,
        "title": "Been There – Quezon City",
        "url": "https://starbucks-mugs.com/mug/been-there-quezon-city/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_quezon_city-407x282.jpg",
        "description": "\nStarbucks Been There – Quezon City is a mug for a city which was the capital of the Philippines between 1948 and 1976. It was founded by and named after Manuel L. Quezon, the 2nd President of the Philippines, to replace Manila as the national capital. It looks like the main reason for that was to have government buildings further from the bay and hence from the reach of naval artillery.\n– An oval frame with the trees on the front of the mug symbolizes Quezon Memorial Circle I believe.… Read more \n",
        "latlong": [
            14.6760413,
            121.0437003
        ]
    },
    "Laguna": {
        "owned": false,
        "title": "Been There – Laguna",
        "url": "https://starbucks-mugs.com/mug/been-there-laguna/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_laguna-407x282.jpg",
        "description": "\nStarbucks Been There – Laguna is another Filipino mug for a province located on Luzon island.\n – Pagsanjan Falls, a.k.a Cavinti Falls a.k.a. Magdapio Falls is one of the major tourist attractions of the region, and one of the most famous waterfalls in the Philippines.\n– The horse on the front of the mug refers to Taka (paper mache) – a famous local craft, a toy that can be your perfect souvenir to take back home.… Read more \n",
        "latlong": null
    },
    "Tagaytay": {
        "owned": false,
        "title": "Been There – Tagaytay",
        "url": "https://starbucks-mugs.com/mug/been-there-tagaytay/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_tagaytay-407x282.jpg",
        "description": "\nStarbucks Been There – Tagaytay is a mug for a city in the province of Cavite, Philippines. Along with Baguio it is considered to be the second Summer capital of the Philippines thanks to a cooler climate due to elevation. The views of the Taal Lake and Taal Volcano Island are landmarks of the city attracting tourists all year round.\nHere are some symbols of the city and points of interests worth visiting:\n– Ferris Wheel (1) is a part of Sky Ranch – a network of amusement parks in the Philippines\n– Ilog Maria Honeybee Farm (2) – a nice stop with a variety of local honey related products including lip balm, wax candles, soaps, etc.… Read more \n",
        "latlong": [
            14.115286,
            120.9621165
        ]
    },
    "Baguio": {
        "owned": false,
        "title": "Been There – Baguio",
        "url": "https://starbucks-mugs.com/mug/been-there-baguio/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_baguio-407x282.jpg",
        "description": "\nStarbucks Been There – Baguio is a fresh release from Philippines. The City of Baguio is a mountain city in Northern Luzon. Due to the elevation of 4,810 ft above sea level and its cool climate, it is considered the Summer Capital of the Philippines.\nHere are some points of interest and symbols spotted on the mug, thanks to a Facebook user:\n– Sunflower (1) is considered a symbol of the city.\n– The Lions Head is a statue (2) along Kennon Road that leads to the city.… Read more \n",
        "latlong": [
            16.4023332,
            120.5960071
        ]
    },
    "Korea": {
        "owned": false,
        "title": "Been There – Korea",
        "url": "https://starbucks-mugs.com/mug/been-there-korea/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_korea_preview-407x337.jpg",
        "description": "\nBeen There collection is expanding pretty fast now. It is becoming obvious that 2020 is a big year for Asia. Been There – Korea mug is a brand new example of that. This release is interesting in a sense that there were no YAH mugs for Korea. Starbucks did have very similar mugs by size, but different design, not related to YAH. I kind of liked those, but still wished for more.\nAnyway, here are some highlights of Been There – Korea:\n– Hahoetal mask – is a mask used in one of Korea’s most traditional folk plays featuring various characters – Hahoe Tal Chum (Hahoe Mask Dance Drama).… Read more \n",
        "latlong": [
            37.66399759999999,
            127.9784585
        ]
    },
    "Wellington": {
        "owned": false,
        "title": "Been There – Wellington",
        "url": "https://starbucks-mugs.com/mug/been-there-wellington/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/02/bt_wellington-407x294.jpg",
        "description": "\nI have no good real pictures of Starbucks Been There – Wellington yet, but it is out in stores. This mug completes the New Zealand BT team of four.\nWellington is the capital and second-most populous city in New Zealand. Thanks to the location on the hills surrounding the harbor, Wellington seems to be a nice place to live or at least visit. You should definitely stroll along the waterfront, relax at Oriental Bay, Wellington’s golden-sand inner-city beach and probably hop into one of the numerous restaurants in that area.… Read more \n",
        "latlong": [
            -41.2923814,
            174.7787463
        ]
    },
    "Queenstown": {
        "owned": false,
        "title": "Been There – Queenstown",
        "url": "https://starbucks-mugs.com/mug/been-there-queenstown/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/01/bt_queenstown_1-407x348.jpg",
        "description": "\nStarbucks Been There – Queenstown is a mug for a resort town in New Zealand. Queenstown is built around an inlet called Queenstown Bay on Lake Wakatipu. Amazing views of the lake and nearby mountains such as The Remarkables, Cecil Peak, Walter Peak make this town a great touristic destination. These are some of the activities you can expect in and around the city: skiing and snowboarding, bungy jumping, mountain biking and hiking, jet boating, rafting, sky diving and many more.… Read more \n",
        "latlong": [
            -45.0301511,
            168.6615141
        ]
    },
    "Christchurch": {
        "owned": false,
        "title": "Been There – Christchurch",
        "url": "https://starbucks-mugs.com/mug/been-there-christchurch/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/01/bt_christchurch_1-407x340.jpg",
        "description": "\nStarbucks Been There – Christchurch is the mug for the biggest city in the South Island of New Zealand. The exact origin of the name “Christ Church” is not known, however, it has been suggested that it is named in honor of Christ Church, Oxford.\nI didn’t know much about New Zealand but I remember hearing about Christ Church on news and unfortunately in regards to a series of earthquakes between 2010 and 2012, with the biggest one claiming the lives of 185 people and causing widespread destruction.… Read more \n",
        "latlong": [
            -43.5320301,
            172.636648
        ]
    },
    "Auckland": {
        "owned": false,
        "title": "Been There – Auckland",
        "url": "https://starbucks-mugs.com/mug/been-there-auckland/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/01/bt_auckland-407x349.jpg",
        "description": "\nStarbucks Been There – Auckland introduces the new series for New Zealand. Auckland is the most populous city in the country with 1.5 million people living in its urban area. It is home to the largest Polynesian population in the world. Tāmaki Makaurau (its Māori-language name), can be translated as “Tāmaki desired by many”, and is referencing to the city’s location and climate.\nHere’s what I was able to spot on the mug:\n– The Auckland Harbour Bridge over the Waitematā Harbour.… Read more \n",
        "latlong": [
            -36.85088270000001,
            174.7644881
        ]
    },
    "West Virginia 2": {
        "owned": false,
        "title": "Been There – West Virginia 2",
        "url": "https://starbucks-mugs.com/mug/been-there-west-virginia-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/01/bt_wv_v2_1-407x379.jpg",
        "description": "\nStarbucks is finally switching from “PANHANDLE STATE” to “THE MOUNTAIN STATE” with the release of Been There – West Virginia v2 mug. I’ve mentioned this strange choice when reviewed v1 ornament. And even though West Virginia has two panhandles, Eastern Panhandle and the Northern Panhandle (which is a piece of land similar to a peninsula in shape), I think the use of the official nickname makes much more sense. West Virginia is located entirely within the Appalachian Mountains with Snowshoe Mountain Resort in Pocahontas County being the largest winter resort in the Mid-Atlantic region\n… Read more \n",
        "latlong": [
            39.3398965,
            -81.405836
        ]
    },
    "Vietnam": {
        "owned": false,
        "title": "Been There – Vietnam",
        "url": "https://starbucks-mugs.com/mug/been-there-vietnam/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2020/01/bt_vietnam_main.jpg",
        "description": "\nSomething special has finally happened. We knew it was just a matter of time till Starbucks expands Been There Series beyond the Americas. Well, this time has come on Friday with the release of the first Asian BT mug and ornament. It is this Been There Vietnam mug that has been chosen for this role in particular. The box it comes with is of the same light blue color as we’re used to. As a nice touch, you can also buy it in a special gift box, which, along with the mug, includes a card and coffee filter (see the photo below).… Read more \n",
        "latlong": [
            14.058324,
            108.277199
        ]
    },
    "Missouri 2": {
        "owned": false,
        "title": "Been There – Missouri 2",
        "url": "https://starbucks-mugs.com/mug/been-there-missouri-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_missouri_v2-407x426.jpg",
        "description": "\nDash is another very popular “fix” for the BT series mugs. Starbucks Been There – Missouri v2 replaces “SHOW ME STATE” with “SHOW-ME STATE” right on the front of the mug. And I can clearly understand the designers because I was able to find both readings from the official sources. Just look at this “welcome” sign that can be seen as you enter the state by road, then two license plates. It is indeed confusing.\n\n\nThere are multiple versions where this nickname is originating from.… Read more \n",
        "latlong": [
            37.9642529,
            -91.8318334
        ]
    },
    "Kansas City 2": {
        "owned": false,
        "title": "Been There – Kansas City 2",
        "url": "https://starbucks-mugs.com/mug/been-there-kansas-city-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/12/bt_kansas_city_v2-407x293.jpg",
        "description": "\nThis could be the smallest change among all BT v2s so far. Starbucks Been There – Kansas City v2 adds a dot on the sign of the intersection of 18th and Vine streets. In particular, “VINE st” became “VINE st.”\nShould you decide to collect both, please be ready to answer the same question from your friends, over and over: “Why are there two identical mugs in your display?”\n… Read more \n",
        "latlong": null
    },
    "Calgary 2": {
        "owned": false,
        "title": "Been There – Calgary 2",
        "url": "https://starbucks-mugs.com/mug/been-there-calgary-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/12/bt_calgary_v2-407x488.jpg",
        "description": "\nStarbucks Been There – Calgary v2 is another updated Canadian mug design, which again includes a minor change. Very similar to the BC mug I’ve reviewed last week, it has an apostrophe added to the landmark’s name: “ST. PATRICKS ISLAND” becomes “ST. PATRICK’S ISLAND”. It’s one of Calgary’s oldest parks, which invites visitors to enjoy family-friendly space since 1890. Btw, it’s even got National Urban Design Award in 2016.\nThe photo is provided by a reader of this blog.\n… Read more \n",
        "latlong": [
            51.026561,
            -113.9994844
        ]
    },
    "Texas 2": {
        "owned": false,
        "title": "Been There – Texas 2",
        "url": "https://starbucks-mugs.com/mug/been-there-texas-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/12/yah_texas_Colorado_river_v2-407x334.jpg",
        "description": "\nStarbucks Been There – Texas v2 introduces a minor update to the “Colorado river” writing on the side of the mug, which becomes “Colorado River”. Is that a significant change for you to have both in your collection? Let me know in the comments.\n… Read more \n",
        "latlong": null
    },
    "British Columbia 2": {
        "owned": false,
        "title": "Been There – British Columbia 2",
        "url": "https://starbucks-mugs.com/mug/been-there-british-columbia-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/12/bt_british_columbia_v2-407x344.jpg",
        "description": "\nHere’s another revised mug from Starbucks, Been There – British Columbia v2. You probably remember that missing apostrophes is the Achilles’ heel of the company’s designers. They already had to fix a couple of mugs in the past because of that, and as we can see, we’re not even close to the end. Anyway, the “HELLS GATE” becomes “HELL’S GATE”, which is the proper name of an abrupt narrowing of Fraser River, located in the Canadian Province of British Columbia.… Read more \n",
        "latlong": [
            55.625371,
            -120.1170085
        ]
    },
    "New Jersey 2": {
        "owned": false,
        "title": "Been There – New Jersey 2",
        "url": "https://starbucks-mugs.com/mug/been-there-new-jersey-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/12/bt_nj_v2-407x305.jpg",
        "description": "\nStarbucks introduces the updated version of the previously released mug, Starbucks Been There – New Jersey v2. The change they bring in is that “Red Oak” is replaced with “Northern Red Oak” right on the front of the mug. Funny enough I was mentioning this tree in my review of the NJ ornament, but it didn’t come to my mind that Starbucks was planning to “fix” that. It also means that the small mug will also be replaced, stay tuned for the update!… Read more \n",
        "latlong": [
            39.3964336,
            -74.8741045
        ]
    },
    "Arequipa": {
        "owned": false,
        "title": "Been There – Arequipa",
        "url": "https://starbucks-mugs.com/mug/been-there-arequipa/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/11/bt_arequipa_1-407x321.jpg",
        "description": "\nStarbucks Been There – Arequipa has also been released today, along with the other three Peruvian mugs. The city is the seat of the Constitutional Court of Peru and often dubbed “legal capital of Peru.”\nThere are many things to discover on the mug, stay tuned for a full review. The photos were offered by the follower of the blog.\n… Read more \n",
        "latlong": [
            -16.4090474,
            -71.53745099999999
        ]
    },
    "Cusco": {
        "owned": false,
        "title": "Been There – Cusco",
        "url": "https://starbucks-mugs.com/mug/been-there-cusco/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/11/bt_cusco_1-407x317.jpg",
        "description": "\nI now think that Starbucks Been There – Cusco mug had to be released no matter what since the Constitution of Peru designates it as the Historical Capital of Peru (it was the historic capital of the Inca Empire between the 13th and 16th century). It attracts more than 2 million visitors a year as a World Heritage Site by UNESCO and a major touristic destination.\nThe full review is yet to come, stay tuned. The photos were offered by the follower of the blog.… Read more \n",
        "latlong": [
            -13.53195,
            -71.96746259999999
        ]
    },
    "Perú": {
        "owned": false,
        "title": "Been There – Perú",
        "url": "https://starbucks-mugs.com/mug/been-there-peru/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/11/bt_peru_r_407-407x313.jpg",
        "description": "\nStarbucks Been There – Perú is one of four mugs from Peru, revealed today. Stay tuned for the full review of the mug.\nThe photos were offered by the follower of the blog.\n… Read more \n",
        "latlong": [
            -9.189967,
            -75.015152
        ]
    },
    "Panamá": {
        "owned": false,
        "title": "Been There – Panamá",
        "url": "https://starbucks-mugs.com/mug/been-there-panama/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_panama_front-407x330.jpg",
        "description": "\nStarbucks Been There – Panama was released earlier this year and is finally getting here.\nThis country is probably the best known for the Panama Canal, and while I am not seeing it on the mug specifically, here are some interesting facts about this wonder of the modern world:\n– The first attempts worth mentioning were done by France between 1881 and 1894 but were halted due to numerous issues on the engineering side. The high mortality rate of the workers was also a huge factor – thousands died due to yellow fever and malaria.… Read more \n",
        "latlong": [
            8.537981,
            -80.782127
        ]
    },
    "Trinidad & Tobago": {
        "owned": false,
        "title": "Been There – Trinidad & Tobago",
        "url": "https://starbucks-mugs.com/mug/been-there-trinidad-tobago/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_Trinidad_And_Tobago_front-407x304.jpg",
        "description": "\nStarbucks Been There – Trinidad & Tobago is a mug for the southernmost island country in the Caribbean. It consists of two main islands, Trinidad and Tobago, of course, and many smaller ones. During the centuries of colonization, it has been under the rule and influence of numerous European countries: Spain and Britain and to a smaller extent France and the Netherlands. The Republic of Trinidad and Tobago became independent in 1962.\nInteresting fact: unlike other Caribbean countries, which rely heavily on tourism, the economy of Trinidad & Tobago is primarily industrial with an emphasis on petroleum and petrochemicals thanks to its large reserves of oil and natural gas.… Read more \n",
        "latlong": [
            10.691803,
            -61.222503
        ]
    },
    "Rio de Janeiro": {
        "owned": false,
        "title": "Been There – Rio de Janeiro",
        "url": "https://starbucks-mugs.com/mug/been-there-rio-de-janeiro/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_rio_de_janeiro_main-407x310.jpg",
        "description": "\nCidade Maravilhosa (Marvellous City) is joining BT mugs series with Starbucks Been There – Rio de Janeiro.\nDid you know that the name of the city literally translates as the River of January? And the reason for this is pretty prosaic: Portuguese expedition under explorer Gaspar de Lemos first encountered Guanabara Bay on 1 January 1502 and named it Ria de Janeiro (“January’s Lagoon”). Ria became Rio (river) later and the actual city was only founded on 1 March 1565 under the name São Sebastião do Rio de Janeiro.… Read more \n",
        "latlong": [
            -22.9068467,
            -43.1728965
        ]
    },
    "São Paulo": {
        "owned": false,
        "title": "Been There – São Paulo",
        "url": "https://starbucks-mugs.com/mug/been-there-sao-paulo/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_sao_paulo_1-407x341.jpg",
        "description": "\nHere’s another Brazilian mug for your collection: Starbucks Been There – São Paulo. It is the largest Portuguese-speaking city in the world with about 22 million people living in the metro area. According to historical documents, the city was founded on January 25, 1554, after Paul the Apostle.\nThese are some architectural elements to consider when visiting the city:\n– I believe it is Paulista Avenue on the left to the handle which is a symbol and the center of the economic and political power of São Paulo where the headquarters of many financial and cultural institutions are located.… Read more \n",
        "latlong": [
            -23.5557714,
            -46.6395571
        ]
    },
    "Brasil": {
        "owned": false,
        "title": "Been There – Brasil",
        "url": "https://starbucks-mugs.com/mug/been-there-brasil/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_brasil_main-407x293.jpg",
        "description": "\nThere are three Brazilian mugs from BT series so far. Starbucks Been There – Brasil is the first one. As you can see, the Portuguese spelling was used. Using local spelling for mugs has been a common practice for Starbucks.\nHere are some points of interest and symbols from the mug:\n– The Amazon River is the largest river by discharge volume of water in the world. Did you know that the river starts in Peru? Peruvian part is also known as Marañón.… Read more \n",
        "latlong": [
            -14.235004,
            -51.92528
        ]
    },
    "North Carolina 2": {
        "owned": false,
        "title": "Been There – North Carolina 2",
        "url": "https://starbucks-mugs.com/mug/been-there-north-carolina-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/02/bt_north_carolina_2_1-407x307.jpg",
        "description": "\nRemember when I’ve asked you to stay tuned to see whether North Carolina will get v2? Well, it took Starbucks almost a year to introduce the fix into the regular mug. Again, the Christmas version came fixed already. Anyway, here’s Starbucks Been There – North Carolina v2, where “WHITE WATER FALLS” has been changed to “WHITEWATER FALLS”. For your convenience, I am posting a collage of all three mugs together. What are your thoughts, guys? Is the change worth to have both mugs in your collection?… Read more \n",
        "latlong": [
            35.8506032,
            -78.6114999
        ]
    },
    "Lima": {
        "owned": false,
        "title": "Been There – Lima",
        "url": "https://starbucks-mugs.com/mug/been-there-lima/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_lima_1_1-407x333.jpg",
        "description": "\nStarbucks Been There – Lima is the only BT mug for Peru so far. Not sure why they decided to do the city prior to releasing the country, but that is how it is.\nLima is the capital and the largest city of Peru, it was founded in 1535 by Spanish conquistador Francisco Pizarro under the name City of Kings (Spanish: Ciudad de los Reyes). This name lost the battle with time, though and the local name of the oracle – Limaq (“talker”, “speaker”) took over.… Read more \n",
        "latlong": [
            -12.0463731,
            -77.042754
        ]
    },
    "Colombia": {
        "owned": false,
        "title": "Been There – Colombia",
        "url": "https://starbucks-mugs.com/mug/been-there-colombia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_colombia_1-407x331.jpg",
        "description": "\nI am wrapping up Colombian BT mugs with Starbucks Been There – Colombia. It has a distinctive design with green and yellow colors.\n– The huge hat on the front of the mug is Sombrero Vueltiao, which literally translates as “turned hat”. It is a traditional Colombian headwear made from caña flecha, a type of cane that grows in the country. The production of the hat is a pretty long process and might take days or weeks. The strips of cane have to be dried and prepared in a way that they look uniform and can be easily bent.… Read more \n",
        "latlong": [
            4.570868,
            -74.297333
        ]
    },
    "Cali": {
        "owned": false,
        "title": "Been There – Cali",
        "url": "https://starbucks-mugs.com/mug/been-there-cali/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_cali_preview.jpg",
        "description": "\nSince I only have one picture of Starbucks Been There – Cali mug, this is considered a preview with the expectation to give it a second look when pictures of all of the sides will be available to me.\nSantiago de Cali (which is the full name of the city) – is the capital of the Valle del Cauca department. With access to the Pacific Ocean, it is the main urban and economic center in the south part of the country.… Read more \n",
        "latlong": null
    },
    "San José": {
        "owned": false,
        "title": "Been There – San José",
        "url": "https://starbucks-mugs.com/mug/been-there-san-jose/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/10/bt_san_jose_1-407x308.jpg",
        "description": "\nStarbucks Been There – San José is the mug for the capital and largest city of Costa Rica. The architecture was chosen as the main motive of the design. Here’s what I was able to identify:\n– There is a statue of León Cortés Castro on the side of the mug. He served as President of Costa Rica from 1936 to 1940. He is remembered for introducing important bank and agrarian reforms. His construction projects include the former International Airport of La Sabana.… Read more \n",
        "latlong": [
            9.9281,
            -84.0907
        ]
    },
    "Costa Rica": {
        "owned": false,
        "title": "Been There – Costa Rica",
        "url": "https://starbucks-mugs.com/mug/been-there-costa-rica/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/05/bt_costa_rica_1_1-407x313.jpg",
        "description": "\nStarbucks Been There – Costa Rica mug is fully dedicated to wildlife and nature of this country.\n– Guarianthe Skinneri or also know as Guaria Moradais in Costa Rica is a species of orchid. As per the Lankester Botanical Garden, there are 1,400 species of orchid in Costa Rica, 20 percent of which are only found there. This is maybe why it is the national flower of the country.\n– There is Sloth Sanctuary in Costa Rica, which is probably one of the best places to view and study these incredible animals.… Read more \n",
        "latlong": [
            9.748916999999999,
            -83.753428
        ]
    },
    "Bahamas": {
        "owned": false,
        "title": "Been There – Bahamas",
        "url": "https://starbucks-mugs.com/mug/been-there-bahamas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/03/bt_bahamas_1-407x298.jpg",
        "description": "\nStarbucks Been There – Bahamas has been released quite a while ago and I am finally adding it to the collection. As it shows on the mug, the Bahamas can offer some amazing ocean beach time.\nDid you know that this archipelago consists of more than 700 islands and islets, while only 30 are inhabited? Nassau, the capital city of the Bahamas, lies on the island of New Providence, while the Grand Bahama is the closest to US island.\nThe Bahamas became an independent Commonwealth realm in 1973 with Elizabeth II as its queen.… Read more \n",
        "latlong": [
            25.03428,
            -77.39627999999999
        ]
    },
    "Valparaiso": {
        "owned": false,
        "title": "Been There – Valparaiso",
        "url": "https://starbucks-mugs.com/mug/been-there-valparaiso/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_valparaiso_1_1-407x320.jpg",
        "description": "\nStarbucks Been There – Valparaiso is the third BT mug from Chile released so far. Valparaiso is a major city and seaport located on the hills of the Pacific Ocean shore. People used to call it “Little San Francisco”, back in the days when it served as a major stopover for ships traveling between the Atlantic and Pacific oceans. Starbucks designers used the green and blue palette for the mug and by reviewing the points of interest and symbols, it looks like they picked those from both Valparaiso and Viña del Mar (“Vineyard of the Sea”).… Read more \n",
        "latlong": [
            -33.047238,
            -71.61268849999999
        ]
    },
    "Santiago": {
        "owned": false,
        "title": "Been There – Santiago",
        "url": "https://starbucks-mugs.com/mug/been-there-santiago/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_santiago_front-407x350.jpg",
        "description": "\nThis is Starbucks Been There – Santiago mug released for the capital and largest city of Chile. The city is also known as Santiago de Chile and can literally be translated from Spanish as “Saint-James”. Along with other nearby cities it forms Santiago Metropolitan Region which is home to almost half of the population of the country (around 7 million people live here).\nThe color palette used for this mug is green, and it seems that architectural points of interest are predominant in the design.… Read more \n",
        "latlong": [
            -33.4488897,
            -70.6692655
        ]
    },
    "Chile": {
        "owned": true,
        "title": "Been There – Chile",
        "url": "https://starbucks-mugs.com/mug/been-there-chile/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_chile_1_1-407x308.jpg",
        "description": "\nStarbucks Been There – Chile is one of my favorite mugs from South America probably because of the color palette they chose for it. Here are some symbols and points of interest for this country that can be found on the mug:\n– The Andes or Andean Mountains (Cordillera de Los Andes) – are the longest continental mountain range in the world with the length of about 4300 miles spanning across seven countries! Aconcagua is the highest peak being 22,841 ft high.… Read more \n",
        "latlong": [
            -35.675147,
            -71.542969
        ]
    },
    "Cordoba": {
        "owned": false,
        "title": "Been There – Cordoba",
        "url": "https://starbucks-mugs.com/mug/been-there-cordoba/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_cordoba_1_1-407x322.jpg",
        "description": "\nStarbucks Been There – Cordoba is the fifth and the last Argentinian mug from this series for now. It is the second-most populous city in Argentina and one of the oldest Spanish settlements in this region.\nHere are some points of interest worth visiting:\n– La Cañada de Córdoba is the canal going through the whole city. It’s a quaint, tree-lined avenue with iconic, stone walls and bridges that is a great pleasure to stroll along.\n– The Arc de Córdoba (Arco de Córdoba) was built in 1943 and can sometimes be seen on the postcards as the symbol of the city.… Read more \n",
        "latlong": [
            37.8881751,
            -4.7793835
        ]
    },
    "Rosario": {
        "owned": false,
        "title": "Been There – Rosario",
        "url": "https://starbucks-mugs.com/mug/been-there-rosario/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_rosario_front-407x308.jpg",
        "description": "\nStarbucks Been There – Rosario is yet another mug from Argentina. Rosario is the third most populous city in the country and a major port sitting on the west bank of the Paraná River. It is worth noting that it’s still not clear what is the actual foundation date of the city. Some say it’s October 7, 1793, however, most of the historians claim that the only right date is August 3, 1852, when town known as Pago de Los Arroyos (“land of the streams”) was declared a city.… Read more \n",
        "latlong": [
            -32.9587022,
            -60.69304159999999
        ]
    },
    "Mendoza": {
        "owned": false,
        "title": "Been There – Mendoza",
        "url": "https://starbucks-mugs.com/mug/been-there-mendoza/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_mendoza_front-407x324.jpg",
        "description": "\nComing back in time to review some BT mugs from South America. Starbucks Been There Mendoza is the mug from Argentina with blue, yellow and orange colors prevailing. Here are some symbols of this city:\n– A line of trees with what seems to be the road is a part of the green belt in the western part of the city, known as Parque General San Martin. It is a system of tree allees, roads and irrigation canals built entirely by people who decided to settle here and make it a nice place to live.… Read more \n",
        "latlong": [
            -32.8894587,
            -68.8458386
        ]
    },
    "Buenos Aires": {
        "owned": true,
        "title": "Been There – Buenos Aires",
        "url": "https://starbucks-mugs.com/mug/been-there-buenos-aires/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/08/bt_buenos_aires_1-407x342.jpg",
        "description": "\nStarbucks Been There – Buenos Aires complements Argentinian collection of BT mugs. It was no surprise to see it being released as Buenos Aires is the largest city and the capital of Argentina. The city, which name can be translated as “fair winds”, is the second-most visited city of Latin America and the top tourist destination. It is well known for its preserved Eclectic European architecture and rich cultural life. Interesting to know, that it’s neither part of Buenos Aires Province nor it’s capital.… Read more \n",
        "latlong": [
            -34.9361,
            -58.9378
        ]
    },
    "Argentina": {
        "owned": true,
        "title": "Been There – Argentina",
        "url": "https://starbucks-mugs.com/mug/been-there-argentina/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_argentina_front-407x319.jpg",
        "description": "\nI can finally get back and review some mugs from South America released through 2018-2019. Let me start with Been There – Argentina. This one is designed using green colors. Most of the symbols from the mug represent flora and fauna of the country. Here’s what I was able to identify:\n– The Andes is the longest continental mountain range in the world which stretches across all South America. It is the highest mountain range outside of Asia with the highest mountain Aconcagua being 22,837ft (6,960.8 meters) high.… Read more \n",
        "latlong": [
            -38.416097,
            -63.61667199999999
        ]
    },
    "Illinois 2": {
        "owned": false,
        "title": "Been There – Illinois 2",
        "url": "https://starbucks-mugs.com/mug/been-there-illinois-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/05/bt_illinois_v2_2-407x442.jpg",
        "description": "\nThere have been some updates in the design of existing mugs recently. One of those is Been There – Illinois v2. The only change I see are dashes between the words in Cave-in-Rock, a 55-foot wide riverside cave formed by wind and water erosion. Indeed, it is the right way of writing the name of this landmark of the Ohio River, city and State Park.\n\n… Read more \n",
        "latlong": [
            40.6331249,
            -89.3985283
        ]
    },
    "Hollywood Studios": {
        "owned": false,
        "title": "Been There Disney – Hollywood Studios",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-hollywood-studios/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_disney_hs_1_1-407x291.jpg",
        "description": "\nStarbucks Been There Disney – Hollywood Studios is the sixth and the last in the group of the Disney mugs which have been released today. It is using a completely new color palette, compared to YAHs for this park, and is obviously filled with the elements, Disney’s Hollywood Studios is famous for. Here are some of them:\n – Rock ‘n’ Roller Coaster Starring Aerosmith from Sunset Boulevard section of the park. It was opened on July 29, 1999, and has a sibling in Disneyland Paris.… Read more \n",
        "latlong": [
            28.3580628,
            -81.5590975
        ]
    },
    "Animal Kingdom": {
        "owned": false,
        "title": "Been There Disney – Animal Kingdom",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-animal-kingdom/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_disney_ak_1_1-407x342.jpg",
        "description": "\nStarbucks Been There Disney – Animal Kingdom mug is returning back to its roots with the green palette used in its design. The Tree of Life is back and it takes a huge portion of the mug’s layout. There are many more small and large elements, which is very common to the new Been There series. We can see numerous animals covering all sides for the mug, namely lions (one of them being Simba cave drawing though), rhinoceros, elephant, birds and couple of dinosaurs.… Read more \n",
        "latlong": [
            28.3574423,
            -81.5905788
        ]
    },
    "California Adventure": {
        "owned": false,
        "title": "Been There Disney – California Adventure",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-california-adventure/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_cali_adventure-407x281.jpg",
        "description": "\nAlright, so both Californian mugs have been released today. Here’s Starbucks Been There Disney California Adventure which I find to be the prettiest among new Disney mugs, just because I like the blue colors! As you can see, the box is orange, similar to Universal mugs. It is priced at $19.99, which is not cheap and pretty much what I expected it to be. … Read more \n",
        "latlong": [
            33.8062236,
            -117.9199281
        ]
    },
    "Epcot": {
        "owned": false,
        "title": "Been There Disney – Epcot",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-epcot/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_disney_epcot_1_1-407x301.jpg",
        "description": "\nI really like the vintage colors of Starbucks Been There Disney – Epcot mug, which has been released today. It reminds me of Epcot 35th Anniversary mug, which came out in 2017.\nBtw, if you’re still looking for the older versions from YAH series, here are some Amazon links: Epcot v2, Epcot v3… Read more \n",
        "latlong": [
            28.3764687,
            -81.5494034
        ]
    },
    "Disneyland": {
        "owned": false,
        "title": "Been There Disney – Disneyland",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-disneyland/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_disneyland-407x392.jpg",
        "description": "\nStarbucks Been There Disney – Disneyland is out! It’s time to head to the park and get one.\nP.S. If your Disney YAH collection is still not complete, here are some Amazon links to check out:\nDisneyland V1, Disneyland V2, Disneyland V3 Adventureland, Disneyland V4 New Orleans Square\n… Read more \n",
        "latlong": [
            33.8120918,
            -117.9189742
        ]
    },
    "Magic Kingdom": {
        "owned": false,
        "title": "Been There Disney – Magic Kingdom",
        "url": "https://starbucks-mugs.com/mug/been-there-disney-magic-kingdom/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/04/bt_magic_kingdom_release_preview-407x395.jpg",
        "description": "\nYay! These are out! Starbucks Been There Disney – Magic Kingdom looks great, I really like the colors. The full review is coming up next!\nP.S. Meanwhile, you still have time to buy these old versions from the YAH collection at Amazon: Magic Kingdom v1, Magic Kingdom v2 and Magic Kingdom v3… Read more \n",
        "latlong": [
            28.4188163,
            -81.5817689
        ]
    },
    "Bogota": {
        "owned": false,
        "title": "Been There – Bogota",
        "url": "https://starbucks-mugs.com/mug/been-there-bogota/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/03/bt_bogota_1_1-407x346.jpg",
        "description": "\nStarbucks Been There Bogota mug is designed using green and rose colors. Here are the most noticeable elements from the mug:\n – Capitolio Nacional (or National Capitol) is a building on Bolivar Square in central Bogotá which houses both houses of the Congress of Colombia. The construction began in 1876 and finished in 1926.\n – Statue of Simon Bolivar in the Parque de los Periodistas.\n – Lake Guatavita is a circular lake located in the Cordillera Oriental of the Colombian Andes 57 km (35 mi) northeast of Bogotá.… Read more \n",
        "latlong": [
            4.710988599999999,
            -74.072092
        ]
    },
    "Medellin": {
        "owned": false,
        "title": "Been There – Medellin",
        "url": "https://starbucks-mugs.com/mug/been-there-medellin/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/10/bt_medellin_1_1-407x327.jpg",
        "description": "\nHere’s Starbucks Been There Medellin mug and some symbols of this town. I am purposely avoiding talking about what this town is mostly known for (especially for foreigners) since the city is changing for the better and is trying hard to improve its image.\n – Rafael Uribe Uribe Palace of Culture – houses cultural programs such as concerts, conferences and art exhibitions.\n – Point Zero Bridge, decorated with a plumb-bob, symbolizes the center of the city and the point of origin for the surveying and numbering of Medellín\n – Metrocable – a gondola lift system implemented in order to connect hard-to-reach metro areas to city center.… Read more \n",
        "latlong": [
            6.2476376,
            -75.56581530000001
        ]
    },
    "San Juan": {
        "owned": false,
        "title": "Been There – San Juan",
        "url": "https://starbucks-mugs.com/mug/been-there-san-juan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/03/bt_san_juan_1_1-407x317.jpg",
        "description": "\nHere is Starbucks Been There San Juan, the mug for the capital and the largest city of Puerto Rico. It is the third oldest European-established capital city in the Americas, after Santo Domingo and Panama City.\nFrom the mug:\n – Cruise ship – since San Juan is a favorite destination for numerous cruises, you can see 5-6 huge liners docked in the port at times.\n – A colorful wooden door, with the Puerto Rican flag on it. I think designers just liked the look and colors of this door, since I could not find any special story behind it.… Read more \n",
        "latlong": [
            18.4670588,
            -66.1184593
        ]
    },
    "Puerto Rico": {
        "owned": false,
        "title": "Been There – Puerto Rico",
        "url": "https://starbucks-mugs.com/mug/been-there-puerto-rico/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/03/bt_puerto_rico_1_1-407x317.jpg",
        "description": "\nWith the release of Starbucks Been There Puerto Rico mug, we leave US and Canada behind and move into exploring the rest of the Americas. That’s right, with the introduction of the Been There Series, we are going to see the return of Caribbean and South American mugs. As a reminder, there were multiple Icons released for those regions, but no YAHs. I want to think this is Starbucks meeting the wishes of the collectors and I consider this a positive sign.… Read more \n",
        "latlong": [
            18.220833,
            -66.590149
        ]
    },
    "Montreal 2": {
        "owned": false,
        "title": "Been There – Montreal 2",
        "url": "https://starbucks-mugs.com/mug/been-there-montreal-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/02/bt_montreal_v2-407x441.jpg",
        "description": "\nThanks to a very vigilant Facebook user, it was brought to my attention that there is another Canadian mug revised by Starbucks. Been There – Montreal v2 introduces the update for “Parc du Mont-Royal”, which was “Parc du Mont Royal” in the initial release (v1). Even though it was a minor, hardly visible error, I think Starbucks did the right thing fixing it.\n\n… Read more \n",
        "latlong": [
            45.5018869,
            -73.56739189999999
        ]
    },
    "Maryland 2": {
        "owned": false,
        "title": "Been There – Maryland 2",
        "url": "https://starbucks-mugs.com/mug/been-there-maryland-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/02/bt_maryland_v2-407x337.jpg",
        "description": "\nStarbucks Been There – Maryland v2 has two elements updated:\n– there was this “nickname”, “Chesapeake State” which didn’t make any sense. I could not find any source which callled Maryland that way. This controversial detail has been replaced with White Oak, official tree of the state.\n– “Oh say can you see…” has been replaced with “O say, can you see…” and I am not sure how accurate it is. There are slightly different variations of the “The Star-Spangled Banner” out there in internet.… Read more \n",
        "latlong": [
            39.0457549,
            -76.64127119999999
        ]
    },
    "Ontario 2": {
        "owned": false,
        "title": "Been There – Ontario 2",
        "url": "https://starbucks-mugs.com/mug/been-there-ontario-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/02/bt_ontario_v2-407x369.jpg",
        "description": "\nHere’s the second Canadian BT mug which has been revised – Been There – Ontario v2. The change is much bigger than Canada v2 from my previous post. In particular, Starbucks removed “The Heartland Province” nickname making adjacent elements bigger; the “Ice wine” has been switched with “Icewine”, which is the proper way to call the wine made from grapes that have been left to freeze naturally on the vine.\n\n… Read more \n",
        "latlong": [
            51.253775,
            -85.3232139
        ]
    },
    "Canada 2": {
        "owned": false,
        "title": "Been There – Canada 2",
        "url": "https://starbucks-mugs.com/mug/been-there-canada-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/02/BT_Canada_v2-407x449.jpg",
        "description": "\nHere is another revised BT mug. The change we see in Been There – Canada v2 is really subtle. You actually have to play “spot the difference” game here. If you, like me, could not find it right away, here is the spoiler: the only difference is the comma in the line “The True North, strong and free”, which is a weird decision, since the official text of the Canadian anthem doesn’t have that comma. With this new releases, Starbucks is actually bringing more questions, rather than fixing things.… Read more \n",
        "latlong": [
            56.130366,
            -106.346771
        ]
    },
    "Denver 2": {
        "owned": false,
        "title": "Been There – Denver 2",
        "url": "https://starbucks-mugs.com/mug/been-there-denver-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/01/bt_denver_v2-407x311.jpg",
        "description": "\nHere’s another “updated” design, which has been spotted by a Facebook user today. The change we see for Starbucks Been There Denver v2 is kind of controversial. Because even though Denver’s Wikipedia page mentions “the Mile-High City” nickname once, I could not find it written with the hyphen anywhere else, including official site of the city of Denver. With that being said, I don’t consider this mug to be the “error fix”, but advise to buy v1 as soon as possible as they are going to disappear from stores pretty soon.… Read more \n",
        "latlong": null
    },
    "Arizona 2": {
        "owned": false,
        "title": "Been There – Arizona 2",
        "url": "https://starbucks-mugs.com/mug/been-there-arizona-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2021/08/bt_arizona_v2_preview-407x299.jpg",
        "description": "\nAin’t no error fix, but the desire to meet the people’s demand in removing “the Sand Hill State” wording from the mug. Even though no one heard of this nickname, some resources claim it is old, but legit. Nonetheless, with the release of Starbucks Been There Arizona v2 mug, that controversial element has been replaced with lizard. It’s worth mentioning, that ornament v2 was spotted before the bigger mug.\n\n… Read more \n",
        "latlong": [
            34.8625101,
            -110.3308814
        ]
    },
    "Michigan 2": {
        "owned": false,
        "title": "Been There – Michigan 2",
        "url": "https://starbucks-mugs.com/mug/been-there-michigan-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2019/01/bt_michigan_v2_2-407x417.jpg",
        "description": "\nAs you probably remember, in my previous post, I’ve predicted the appearance of Starbucks Been There Michigan v2 mug. And here it is, spotted online. The only difference this version is bringing, is “Winter Water Wonderland” slogan being replaced with “Water Winter Wonderland”. I do consider the Michigan v1 a State error mug, since this is the actual fix of the mistake made in the design. We’re now left guessing, why it took Starbucks so long to replace the mug, but it could easily be negligence, human factor.… Read more \n",
        "latlong": [
            44.3148443,
            -85.60236429999999
        ]
    },
    "Universal Orlando Resort": {
        "owned": false,
        "title": "Been There – Universal Orlando Resort",
        "url": "https://starbucks-mugs.com/mug/been-there-universal-orlando-resort/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/12/bt_uniersal_orlando_resort-407x295.jpg",
        "description": "\nHere is the second mug for Universal from the new series. Starbucks Been There Universal Orlando Resort mug comes in an orange box, similar to PPM BT and Universal mug from Hollywood, released earlier. … Read more \n",
        "latlong": [
            28.4723529,
            -81.4690029
        ]
    },
    "Universal Studios Hollywood": {
        "owned": false,
        "title": "Been There – Universal Studios Hollywood",
        "url": "https://starbucks-mugs.com/mug/been-there-universal-studios-hollywood/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/12/bt_universal_studios_hollywood-407x270.jpg",
        "description": "\nNot a city nor a state, but rather the attraction. Been There – Universal Studios Hollywood mug gets orange box, similar to PPM, released earlier this year. It’s exceeded my expectations in terms of release date and I like the design. What do you guys think?… Read more \n",
        "latlong": [
            34.13811680000001,
            -118.3533783
        ]
    },
    "North Carolina": {
        "owned": false,
        "title": "Been There – North Carolina",
        "url": "https://starbucks-mugs.com/mug/been-there-north-carolina/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_north_carolina_1_1-407x335.jpg",
        "description": "\nStarbucks Been There North Carolina mug was designed using blue pattern. And yes, the Wright Flyer is there! What’s more? We are going to find this out really soon.… Read more \n",
        "latlong": [
            35.7595731,
            -79.01929969999999
        ]
    },
    "Arizona": {
        "owned": true,
        "title": "Been There – Arizona",
        "url": "https://starbucks-mugs.com/mug/been-there-arizona/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/01/bt_arizona-407x336.jpg",
        "description": "\nYet another leaked photo of the mug from the new series – Been There – Arizona. Again we see pretty busy design completed using orange to red patterns.\nWhat was the inspiration for the artist here? Only seeing a small portion of the mug surface we can identify: Saguaro (tree-like cactus species), snake, canyon from Red Rock State Park (city of Sedona) and air balloon.\nThere is definitely much more from the mug to discover. Stay tuned for more info!\nUpdate from March 20, 2018:\nWe now have a better picture of the mug.… Read more \n",
        "latlong": [
            34.0489281,
            -111.0937311
        ]
    },
    "Canada": {
        "owned": true,
        "title": "Been There – Canada",
        "url": "https://starbucks-mugs.com/mug/been-there-canada/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_canada_1_1-407x364.jpg",
        "description": "\nI somehow missed to publish Starbucks Been There Canada mug. By doing that I am finishing the Canadian BT series so far (hoping there will be more in the future). As for this particular mug, Starbucks has combined most of the cliches about Canada existing.  … Read more \n",
        "latlong": [
            56.130366,
            -106.346771
        ]
    },
    "Atlanta": {
        "owned": false,
        "title": "Been There – Atlanta",
        "url": "https://starbucks-mugs.com/mug/been-there-atlanta/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_atlanta_1_3-407x332.jpg",
        "description": "\nStarbucks Been There Atlanta mug. I’ve spotted not just one but two radio cassette players on this mug (one on the front and one on the back). There should be some interesting story behind that. Will definitely find that out in my updated post.\nUpdate from 2018-07-09: as it was expected, the delay of the release of this mug was caused by a misprint. See v1 and v2 side by side: it should be “Chattahoochee river” instead of “Сhattahoochie river”.… Read more \n",
        "latlong": [
            33.748752,
            -84.38768449999999
        ]
    },
    "Boston": {
        "owned": false,
        "title": "Been There – Boston",
        "url": "https://starbucks-mugs.com/mug/been-there-boston/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_boston-407x342.jpg",
        "description": "\nStarbucks Been There Boston mug has not been found in stores yet, but we again have a leaked photo of the real mug. I will be monitoring the availability of this mug closely just because it’s in my “must have” list.\nUpdate from 2018-05-21: this mug turned out to be v1! See this comparison picture:\n\n“Boston Commons” is written instead of “Boston Common” – a typical mistake made by non-locals.… Read more \n",
        "latlong": [
            42.3600825,
            -71.0588801
        ]
    },
    "Los Angeles": {
        "owned": false,
        "title": "Been There – Los Angeles",
        "url": "https://starbucks-mugs.com/mug/been-there-los-angeles/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_los_angeles-407x343.jpg",
        "description": "\nI find new Starbucks Been There Los Angeles mug amazingly appealing. I think blue and orange look very good together and this mug has it all.\nUpdate from 2018-05-21: looks like it was BT LA version 1. See this side-by-side comparison:\n… Read more \n",
        "latlong": [
            34.0549076,
            -118.242643
        ]
    },
    "Florida": {
        "owned": false,
        "title": "Been There – Florida",
        "url": "https://starbucks-mugs.com/mug/been-there-florida/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_florida.jpg",
        "description": "\nThe Sunshine State is presented as the green Starbucks Been There Florida mug. It’s hard to imagine Florida without alligators and palm trees, thus they obviously made their way to the front of the mug. There’s more to discover, stay tuned. … Read more \n",
        "latlong": [
            27.6648274,
            -81.5157535
        ]
    },
    "Pike Place": {
        "owned": false,
        "title": "Been There – Pike Place",
        "url": "https://starbucks-mugs.com/mug/been-there-pike-place/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_pike_place-407x318.jpg",
        "description": "\nA BT mug I didn’t expect to be released that early has been spotted in Seattle today. As you can see from the photo, it is Starbucks Been There Pike Place mug. I didn’t mention that to you, but according to rumors, cities were only supposed to hit the stores in May. However, it looks like I didn’t properly inspect the leaked pamphlet:\n\nThus, Been There Pike Place Market was indeed planned for March 27 and so it happened.\nAn interesting detail about this one – the box is not blue as for other BTs, but orange.… Read more \n",
        "latlong": [
            47.6088107,
            -122.3415706
        ]
    },
    "Virginia": {
        "owned": false,
        "title": "Been There – Virginia",
        "url": "https://starbucks-mugs.com/mug/been-there-virginia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_virginia_preview-407x315.jpg",
        "description": "\nBlue and orange, yes, again. Starbucks Been There Virginia mug is just like that. Unless they are all different shades in reality. Let’s confirm that as we get better pictures.\n… Read more \n",
        "latlong": [
            37.4315734,
            -78.6568942
        ]
    },
    "Washington, D.C.": {
        "owned": false,
        "title": "Been There – Washington, D.C.",
        "url": "https://starbucks-mugs.com/mug/been-there-washington-d-c/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_washington_dc_preview-407x322.jpg",
        "description": "\nI really wonder if BTs of the same color will look similar if stacked in the cabinet or shelf. I feel like Starbucks was trying to save on paint… As you can see, Starbucks Been There Washington DC mug is somewhat a sibling of Virginia BT added today as well. So the difference is in the details, I guess.\n… Read more \n",
        "latlong": [
            38.9071923,
            -77.0368707
        ]
    },
    "Ohio": {
        "owned": false,
        "title": "Been There – Ohio",
        "url": "https://starbucks-mugs.com/mug/been-there-ohio/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_ohio-407x347.jpg",
        "description": "\nAnother red mug – Starbucks Been There Ohio. I am particularly interested what are those “X” and “O” symbols mean. This is something to ask Google for, or, if you know the answer, please leave a comment!… Read more \n",
        "latlong": [
            40.4172871,
            -82.90712300000001
        ]
    },
    "Hawaii": {
        "owned": false,
        "title": "Been There – Hawaii",
        "url": "https://starbucks-mugs.com/mug/been-there-hawaii/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_hawaii-407x328.jpg",
        "description": "\nAlright, so the new series mugs started to pop up here and there with the speed of light. One of the most recent releases – Starbucks Been There Hawaii mug. Stay tuned for the full review of the mug.\nUpdate from March 22, 2018: credits to wanderlustbeck, one of my readers, for providing a high quality photo of the Been There Hawaii.… Read more \n",
        "latlong": [
            19.8986819,
            -155.6658568
        ]
    },
    "Oregon": {
        "owned": false,
        "title": "Been There – Oregon",
        "url": "https://starbucks-mugs.com/mug/been-there-oregon/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_oregon-407x386.jpg",
        "description": "\nGreen and bright Starbucks Been There Oregon mug joins the family. The photo is blurry, stay tuned for better pictures and full review. … Read more \n",
        "latlong": [
            43.8041334,
            -120.5542012
        ]
    },
    "Colorado": {
        "owned": false,
        "title": "Been There – Colorado",
        "url": "https://starbucks-mugs.com/mug/been-there-colorado/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_colorado.jpg",
        "description": "\nStarbucks Been There Colorado mug is also blue – it seems most of the recent mugs are of this color. I wonder what will they look like when placed next to each other. Well, we are going to find that out soon!… Read more \n",
        "latlong": [
            39.5500507,
            -105.7820674
        ]
    },
    "Michigan": {
        "owned": false,
        "title": "Been There – Michigan",
        "url": "https://starbucks-mugs.com/mug/been-there-michigan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_michigan_v1-407x350.jpg",
        "description": "\nStarbucks Been There Michigan mug has been spotted today in the stores. Again, earlier than official release date of March 27. Looks like the most of the elements from the mug are related to wildlife. Stay tuned for full review.… Read more \n",
        "latlong": [
            44.3148443,
            -85.60236429999999
        ]
    },
    "California": {
        "owned": true,
        "title": "Been There – California",
        "url": "https://starbucks-mugs.com/mug/been-there-california/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_california-407x300.jpg",
        "description": "\nStarbucks Been There California mug is another fresh release for this hot season. The red color is dominating here.\nThe full review is pending, meanwhile here’s a quick interesting fact about the California State flag:\nThe inclusion of “California Republic” on the flag of California reflects a significant historical period known as the Bear Flag Revolt of 1846. During this uprising, American settlers in California, discontent with Mexican rule, declared California an independent republic. The flag they raised, featuring a grizzly bear and a red star, came to symbolize this brief period of autonomy.… Read more \n",
        "latlong": [
            36.778261,
            -119.4179324
        ]
    },
    "San Francisco": {
        "owned": false,
        "title": "Been There – San Francisco",
        "url": "https://starbucks-mugs.com/mug/been-there-san-francisco/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_san_francisco-407x314.jpg",
        "description": "\nI continue adding BT city mugs found in stores. Starbucks Been There San Francisco mug is one of the latest finds. As you can see, Golden Gate Bridge is obviously on the front. What else? Let me add all sides of the mug and review it.… Read more \n",
        "latlong": [
            37.7749295,
            -122.4194155
        ]
    },
    "Chicago": {
        "owned": false,
        "title": "Been There – Chicago",
        "url": "https://starbucks-mugs.com/mug/been-there-chicago/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_chicago-407x309.jpg",
        "description": "\nPlease meet the Windy City, Starbucks Been There Chicago mug. Designed using my favorite, from this series, color palette, it will certainly be a “must get” mug for many. The full review is coming!… Read more \n",
        "latlong": [
            41.8781136,
            -87.6297982
        ]
    },
    "New York": {
        "owned": false,
        "title": "Been There – New York",
        "url": "https://starbucks-mugs.com/mug/been-there-new-york/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_new_york-407x396.jpg",
        "description": "\nStarbucks Been There New York mug is the state mug and not the city as it was in the case of YAH. That’s why we see the Adirondack Mountains on the front of the mug – a beautiful park in the Upstate New York. Will definitely get back to it while doing a full review.… Read more \n",
        "latlong": [
            40.7127753,
            -74.0059728
        ]
    },
    "Texas": {
        "owned": false,
        "title": "Been There – Texas",
        "url": "https://starbucks-mugs.com/mug/been-there-texas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_texas-407x325.jpg",
        "description": "\nIf you remember my first post about the new collection coming, I used the blurry image of the Texas mug, since it was the only one we had available. Well, here it is, the real photo of Starbucks Been There Texas mug. I want you to compare these two images side-by-side:\n\nDo you see the difference? That’s right, they rearranged the elements on the mug. Does it mean there was the last minute change before the release? Or there was the pre-production version which never got to stores?… Read more \n",
        "latlong": [
            31.9685988,
            -99.9018131
        ]
    },
    "Las Vegas": {
        "owned": true,
        "title": "Been There – Las Vegas",
        "url": "https://starbucks-mugs.com/mug/been-there-las-vegas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_las_vegas-407x312.jpg",
        "description": "\nWhich city is primarily known for its gambling, shopping, fine dining, entertainment, and nightlife? That’s right, it’s Starbucks Been There Las Vegas mug. … Read more \n",
        "latlong": [
            36.171563,
            -115.1391009
        ]
    },
    "Seattle": {
        "owned": true,
        "title": "Been There – Seattle",
        "url": "https://starbucks-mugs.com/mug/been-there-seattle/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_seattle-407x314.jpg",
        "description": "\nI had no idea Seattle’s nickname is City of Goodwill till I saw Starbucks Been There Seattle mug. Indeed, this new collection allows you to learn more about places you’ve been to. Even before I do a full review I would like to mention, that famous Original Starbucks store is definitely on the front of the mug. Interesting enough, even Pike Place BT doesn’t have it.… Read more \n",
        "latlong": [
            47.6061389,
            -122.3328481
        ]
    },
    "Washington": {
        "owned": false,
        "title": "Been There – Washington",
        "url": "https://starbucks-mugs.com/mug/been-there-washington/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_washington-407x331.jpg",
        "description": "\nThe Evergreen State is obviously getting green mug – Starbucks Been There Washington. Let’s wait for better photos to identify elements from the mug.… Read more \n",
        "latlong": [
            38.9071923,
            -77.0368707
        ]
    },
    "South Dakota 2": {
        "owned": false,
        "title": "Been There – South Dakota 2",
        "url": "https://starbucks-mugs.com/mug/been-there-south-dakota-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/08/bt_south_dakota_2_3-407x309.jpg",
        "description": "\nI sincerely though we’re done with US Error mugs. Boy, was I wrong! Here comes Starbucks Been There South Dakota v2! The element which has been adjusted is word “pronghorn” instead of “prong horn deer”. And it is actually a valid fix, since pronghorn, the animal from the mug, is not a deer, and it’s closest living relatives are the giraffes and okapi.\nHere’s side by side comparison of two mugs together:\n\n… Read more \n",
        "latlong": [
            43.9695148,
            -99.9018131
        ]
    },
    "Charlotte 2": {
        "owned": false,
        "title": "Been There – Charlotte 2",
        "url": "https://starbucks-mugs.com/mug/been-there-charlotte-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/07/bt_charlotte_2_1-407x340.jpg",
        "description": "\nThis is the sixth BT city mug with error so far. With the release of Been There Charlotte v2, Starbucks has fixed the names of the streets on the sign on the front of the mug. Instead of “Tyron st.” and “Trader st.”, which is wrong, it now says “Tryon st.” and “Trade st.” So again, we see two errors on the same mug. Nice job, Starbucks.\nAs for the intersection itself, it splits Charlotte Center City (a.k.a Uptown) into four neighborhoods.… Read more \n",
        "latlong": null
    },
    "Detroit 2": {
        "owned": false,
        "title": "Been There – Detroit 2",
        "url": "https://starbucks-mugs.com/mug/been-there-detroit-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/07/bt_detroit_2_1-407x310.jpg",
        "description": "\nThis was one of the first mugs from BT collection added to the site, yet it was still a preview. The actual release only happened today, and as you can guess, the delay was also caused by a misprint. Starbucks Been There Detroit v2 is missing “Startup city USA” “nickname” above Ambassador Bridge (which was replaced by two clouds). I, sincerely, tried to research where is that “nickname” coming from and can only assume it was supposed to represent the new era of entrepreneurship of Detroit.… Read more \n",
        "latlong": null
    },
    "Atlanta 2": {
        "owned": false,
        "title": "Been There – Atlanta 2",
        "url": "https://starbucks-mugs.com/mug/been-there-atlanta-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/07/bt_atlanta_2_1-407x311.jpg",
        "description": "\nStarbucks Been There Atlanta v2 has been released a couple weeks ago, yet I had no pictures of v1 to compare with. Now I do. As you can see from the collage below, the actual misprint was “Chattahoochie river” instead of “Сhattahoochee river”. It still amazes me how bad quality control at Starbucks was, while designing this series.\n… Read more \n",
        "latlong": [
            33.748752,
            -84.38768449999999
        ]
    },
    "San Diego 2": {
        "owned": false,
        "title": "Been There – San Diego 2",
        "url": "https://starbucks-mugs.com/mug/been-there-san-diego-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_san_diego_2_1-407x333.jpg",
        "description": "\nWe have finally got the confirmation of what was the fix for Starbucks Been There San Diego v2 mug. It was actually saying “Americas finest city in motion” which doesn’t make any sense and it was replaced with “America’s finest city”\nSee two mugs side by side:\n… Read more \n",
        "latlong": [
            32.715738,
            -117.1610838
        ]
    },
    "Delaware 2": {
        "owned": false,
        "title": "Been There – Delaware 2",
        "url": "https://starbucks-mugs.com/mug/been-there-delaware-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_delaware_2_1-407x320.jpg",
        "description": "\nWe’ve been all waiting for the official release of this mug for quite a while. As you remember it was delayed due to an error made on the mug. As you can see, the “fixed” Starbucks Been There Delaware v2 mug is missing “Lower Slower” nickname on the front. So instead of making it “Slower Lower” they replaced it with crab. My guess, this phrase is copyrighted, and Starbucks decided to completely remove it, in order to avoid any lawsuits in the future.… Read more \n",
        "latlong": [
            38.9108325,
            -75.52766989999999
        ]
    },
    "Victoria": {
        "owned": false,
        "title": "Been There – Victoria",
        "url": "https://starbucks-mugs.com/mug/been-there-victoria/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_victoria-407x335.jpg",
        "description": "\nStarbucks Been There Victoria mug is the most recent release for Canada. It will definitely be in a great demand, yet somewhat easily accessible by Vancouver collectors. Getting there will include using the ferry, since Victoria is located on the southern tip of Vancouver Island… Read more \n",
        "latlong": [
            -36.9847807,
            143.3906074
        ]
    },
    "Ontario": {
        "owned": false,
        "title": "Been There – Ontario",
        "url": "https://starbucks-mugs.com/mug/been-there-ontario/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_ontario-407x299.jpg",
        "description": "\nStarbucks Been There Ontario is the first mug for this Canadian Province. If you’re still deciding whether you are going to collect Canadian BTs or not, I suggest starting with Provinces first (7 mugs only).  … Read more \n",
        "latlong": [
            51.253775,
            -85.3232139
        ]
    },
    "Calgary": {
        "owned": false,
        "title": "Been There – Calgary",
        "url": "https://starbucks-mugs.com/mug/been-there-calgary/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_calgary-407x426.jpg",
        "description": "\nAnother mug from BT Canadian Collection – Starbucks Been There Calgary has been spotted in stores. As per reports, the stocks are limited, but remember, the official release date is still June 26. Some stores are waiting for that day to put mugs on shelves. … Read more \n",
        "latlong": [
            51.04473309999999,
            -114.0718831
        ]
    },
    "Whistler": {
        "owned": false,
        "title": "Been There – Whistler",
        "url": "https://starbucks-mugs.com/mug/been-there-whistler/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_whistler-407x306.jpg",
        "description": "\nThis is not a province nor capital of the province, yet Starbucks Been There Whistler mug has been released as the part of the new collection too (similar to YAH and Icon). The reason is pretty simple, Whistler is the home to Whistler Blackcomb, one of the largest ski resorts in North America. … Read more \n",
        "latlong": [
            50.11616859999999,
            -122.9535117
        ]
    },
    "British Columbia": {
        "owned": false,
        "title": "Been There – British Columbia",
        "url": "https://starbucks-mugs.com/mug/been-there-british-columbia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_british_columbia_preview-407x371.jpg",
        "description": "\nWith the small delay, West Coast of Canada is joining the BT family – please meet Starbucks Been There British Columbia… Read more \n",
        "latlong": [
            53.7266683,
            -127.6476206
        ]
    },
    "Montreal": {
        "owned": false,
        "title": "Been There – Montreal",
        "url": "https://starbucks-mugs.com/mug/been-there-montreal/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_montreal-407x303.jpg",
        "description": "\nStarbucks Been There Montreal mug is finally in town! I have to admit I was wrong about the design of this particular mug.  It looks so much better in reality. It looks amazing. I really like it.\nThe full review will come soon, but for now, I can tell you, I don’t see Notre-Dame Basilica, which I find weird. Nonetheless there are so many other things to discover on this mug. Stay tuned.\nAs a bonus, the photo of Montreal and Quebec together:\n… Read more \n",
        "latlong": [
            45.5018869,
            -73.56739189999999
        ]
    },
    "Mississippi 2": {
        "owned": false,
        "title": "Been There – Mississippi 2",
        "url": "https://starbucks-mugs.com/mug/been-there-mississippi-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/06/bt_mississippi_v2_1_407-407x314.jpg",
        "description": "\nThe release of this mug was definitely delayed, but today, the 50th state has revealed its design. Please note, Starbucks Been There Mississippi is probably an error (misprint) mug since it came out much later than other states. Unfortunately, I don’t have any proof of that, but I secretly hope someone got it (either from manufacturer or store staff) and will show to the world sooner or later.  From first glance, it seems the mug is dedicated to wildlife. Let’s wait for other sides to have the full picture.… Read more \n",
        "latlong": [
            33.4379928,
            -90.2995785
        ]
    },
    "Vancouver Island": {
        "owned": false,
        "title": "Been There – Vancouver Island",
        "url": "https://starbucks-mugs.com/mug/been-there-vancouver-island/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_vancouver_island.jpg",
        "description": "\nHere is the preview of Starbucks Been There Vancouver Island mug, which is about to be released.\nI’ve combined all sides in a collage:\n… Read more \n",
        "latlong": [
            49.6506376,
            -125.4493906
        ]
    },
    "San Diego": {
        "owned": false,
        "title": "Been There – San Diego",
        "url": "https://starbucks-mugs.com/mug/been-there-san-diego/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/20210104_205428-407x305.jpg",
        "description": "\nA previously delayed, Starbucks Been There San Diego mug has been spotted in stores. At this point, I can only guess what was the reason for the delay. This can easily be the v2 and we are yet to discover if there was the v1 and what was the misprint.\nUpdate from 2018-06-30: we’re lucky to witness the back of Been There San Diego v1 It was confirmed that delay was caused by misprint. See two mugs side by side:\n… Read more \n",
        "latlong": [
            32.715738,
            -117.1610838
        ]
    },
    "Los Angeles 2": {
        "owned": true,
        "title": "Been There – Los Angeles 2",
        "url": "https://starbucks-mugs.com/mug/been-there-los-angeles-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_los_angeles_2_1-407x349.jpg",
        "description": "\nHere’s another “delayed” city mug for you guys: Starbucks Been There Los Angeles 2. And yes, it is different from previously posted LA version 1 Here is the picture of two mugs side by side:\n\nThe actual misprint is “City of The Angels” instead of “City of Angels”. Way too many errors in this series… Do you agree? It almost makes me think this was done on purpose. … Read more \n",
        "latlong": [
            34.0549076,
            -118.242643
        ]
    },
    "Boston 2": {
        "owned": false,
        "title": "Been There – Boston 2",
        "url": "https://starbucks-mugs.com/mug/been-there-boston-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_boston_2_1.jpeg",
        "description": "\nThanks to my amazing reader, I have this exclusive news to share with you. Here’s Starbucks Been There Boston v2 mug. Wait, what? You heard it right – this is version 2 of the previously posted Boston mug. Here’s the comparison picture for you:\n\nI know, these photos are really blurry, but we can still see, that v1 has “Boston Commons” on the back of the mug instead of “Boston Common” found on v2. Ironically this is a very common mistake made by tourists and non-locals.… Read more \n",
        "latlong": null
    },
    "North Dakota 2": {
        "owned": false,
        "title": "Been There – North Dakota 2",
        "url": "https://starbucks-mugs.com/mug/been-there-north-dakota-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_north_dakota_2_1-407x327.jpg",
        "description": "\nI’ve got some exclusive photos from one of the collectors and I hasten to share them with you. Here’s Starbucks Been There North Dakota v2 mug brand new and improved. Specifically, Starbucks fixed the error it made for “Geographical Center of North America” monument installed in Rugby, ND (see side-by-side photos). I also find it very amusing, that the picture of the monument was made smaller in order for it to be moved up North on the map of the US.… Read more \n",
        "latlong": [
            47.5514926,
            -101.0020119
        ]
    },
    "Montana 2": {
        "owned": false,
        "title": "Been There – Montana 2",
        "url": "https://starbucks-mugs.com/mug/been-there-montana-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_montana_2_preview-407x332.jpg",
        "description": "\nThe second, fixed version of recently revealed mug, Starbucks Been There Montana 2 is out! As a reminder, the misprint was on the front of the mug. It is now saying “Bitterroot” instead of “Bitteroot”. We can only guess how many mugs with error were produced, and what’s more important, how many were sold.\nUpdate from 2018-05-19: please see side-by-side comparison of the front of the mugs, where the misprint is (missing ‘r’ in the Bitterroot word).\n… Read more \n",
        "latlong": null
    },
    "Denver": {
        "owned": false,
        "title": "Been There – Denver",
        "url": "https://starbucks-mugs.com/mug/been-there-denver/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_denver-407x322.jpg",
        "description": "\nI somehow missed this mug, meanwhile Starbucks Been There Denver mug is being sold all across Colorado. From what I can see the mug is mostly dedicated to wildlife and outdoor activites, which makes complete sense since few places in North America offer such a bounty of wildlife-watching opportunities as Colorado and Denver area in particular. … Read more \n",
        "latlong": [
            39.7392358,
            -104.990251
        ]
    },
    "Nebraska 2": {
        "owned": false,
        "title": "Been There – Nebraska 2",
        "url": "https://starbucks-mugs.com/mug/been-there-nebraska-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_nebraska_2_2-407x420.jpg",
        "description": "\nMugs with fixed misprints, a.k.a. V2s, continue coming to the scene. It was last week when Starbucks Been There Nebraska v2 mug has finally been spotted in stores. As you can see, the state motto was fixed to “Good Life. Great Opportunity” as it was supposed to be initially.\nUpdate from 2018-05-19: added a side-by-side comparison of v1 and v2\n… Read more \n",
        "latlong": [
            41.4925374,
            -99.9018131
        ]
    },
    "North Dakota": {
        "owned": false,
        "title": "Been There – North Dakota",
        "url": "https://starbucks-mugs.com/mug/been-there-north-dakota/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_north_dakota_1_1-407x326.jpg",
        "description": "\nThanks to a collector, (see watermark), I can finally add Starbucks Been There – North Dakota mug to my site. Again, this is the error mug, so technically this is North Dakota v1 and it’s ultra rare. The fixed version is expected to be released pretty soon, that’s when I will post a side-by-side comparison photo for you guys. But for now, please see this all-sides collage. The actual misprint is on the back of the mug, where is says “Center of the United States” which is obviously the reference to the “Geographical Center of North America” monument installed in Rugby, ND.… Read more \n",
        "latlong": [
            47.5514926,
            -101.0020119
        ]
    },
    "Montana": {
        "owned": false,
        "title": "Been There – Montana",
        "url": "https://starbucks-mugs.com/mug/been-there-montana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_montana_1_1-407x339.jpg",
        "description": "\nAnother Starbucks Been There Mug – Montana. This is only the back of the mug and it’s too early to identify elements of the design, but it’s clear that it will be dedicated to wonders of nature and wildlife, which Montana is famous of. Will just mention Flathead Lake – one of the largest natural freshwater lakes by surface area in US. Stay tuned, better pics are yet to come.\nUpdate from 2018-05-12:\nThis was one of the first BT mugs I’ve posted at Starbucks-Mugs.com.… Read more \n",
        "latlong": [
            46.8796822,
            -110.3625658
        ]
    },
    "Maine 2": {
        "owned": false,
        "title": "Been There – Maine 2",
        "url": "https://starbucks-mugs.com/mug/been-there-maine-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_maine_2-407x307.jpg",
        "description": "\nHere’s the second, fixed version of previously posted mug – Starbucks Been There Maine v2. People reported seeing it the stores, but are not allowed to buy it. If you plan on getting it, stay alert. My understanding, it’s just the matter of couple days, till you see it officially released.\nHere is the collage of all sides. As you can see they’ve fixed the spelling for the mountain. It is now saying Mount Katahdin as it should be.\n\nUpdate from 2018-05-19: added a side-by-side comparison of v1 and v2\n… Read more \n",
        "latlong": [
            45.253783,
            -69.4454689
        ]
    },
    "Louisiana 2": {
        "owned": false,
        "title": "Been There – Louisiana 2",
        "url": "https://starbucks-mugs.com/mug/been-there-louisiana-2/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_louisiana_2_preview-407x199.jpg",
        "description": "\nStarbucks Been There Louisiana v2 opens the series of the releases of mugs replacing the error ones. The first version of this mug has two misprints, see images below:\n\n\n\nAs you can see, both issues were fixed and the new mug is going to be widely available in stores pretty soon.… Read more \n",
        "latlong": [
            30.5190775,
            -91.5208624
        ]
    },
    "Maine": {
        "owned": false,
        "title": "Been There – Maine",
        "url": "https://starbucks-mugs.com/mug/been-there-maine/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_maine_1-407x346.jpg",
        "description": "\nStarbucks Been There Maine v1 is not your regular mug. It was neither officially released nor sold in stores. As you probably remember, certain BT State mugs were designed with misprints. Oddly enough those errors hadn’t been spotted till mugs arrived at stores. Even then Starbucks managed to sold a bunch of Nebraska v1s before someone have noticed the problem and reported that to head office. Exactly at that moment, Starbucks reviewed all their designs and ordered to pull back and destroy error mugs.… Read more \n",
        "latlong": [
            45.253783,
            -69.4454689
        ]
    },
    "Niagara Falls": {
        "owned": false,
        "title": "Been There – Niagara Falls",
        "url": "https://starbucks-mugs.com/mug/been-there-niagara-falls/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_niagara_falls-407x317.jpg",
        "description": "\nOK, guys, I was holding on writing about Starbucks Been There Niagara Falls mug since nobody reported it being found in stores. Well, this happened today – Buffalo, NY is where it was spotted. I believe this mug is special, since it was announced under US album on Starbucks Pinterest page, and then it’s US city where it was “released” first. On the other hand, it says CAN14.95 on the bottom (again, as per collectors reports). So, the main question now: is Starbucks Been There Niagara Falls another mug from US cities wave or this is the first Canadian BT to be released?… Read more \n",
        "latlong": [
            43.0962143,
            -79.0377388
        ]
    },
    "Charlotte": {
        "owned": false,
        "title": "Been There – Charlotte",
        "url": "https://starbucks-mugs.com/mug/been-there-charlotte/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/05/bt_charlotte_1_1.jpg",
        "description": "\nHere’s Starbucks Been There Charlotte mug – the photo is real, but the mug is yet to be found in stores. From what I understand, this is a sneak peek directly from production factory. So, please monitor your stores, Charlotteans, and share real pictures with us, when you see it.\nUpdate from 2018-07-10: our reader Candace (see comments), pointed out that the street names on the sign on the front of the mug are misspelled. It says “Tyron st.” and “Trader st.”, while it should be “Tryon st.” and “Trade st.”.… Read more \n",
        "latlong": [
            35.2270869,
            -80.8431267
        ]
    },
    "Nashville": {
        "owned": false,
        "title": "Been There – Nashville",
        "url": "https://starbucks-mugs.com/mug/been-there-nashville/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_nashville-407x310.jpg",
        "description": "\nAnother confirmed release for today – Starbucks Been There Nashville mug has lots of music related elements and this is expected, as this city is a major music industry centre of the country. … Read more \n",
        "latlong": [
            36.1626638,
            -86.7816016
        ]
    },
    "Orlando": {
        "owned": false,
        "title": "Been There – Orlando",
        "url": "https://starbucks-mugs.com/mug/been-there-orlando/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_orlando-407x314.jpg",
        "description": "\nFor Starbucks Been There Orlando mug I am using official photos, but let me assure you, the mug is out and is for sale online (see below). From what I can see, Starbucks decided to not use themed parks elements here, and it makes complete sense. There is no doubt that Disney and Universal BT mugs will be released as a separate set later.\n… Read more \n",
        "latlong": [
            28.5383832,
            -81.3789269
        ]
    },
    "Portland": {
        "owned": true,
        "title": "Been There – Portland",
        "url": "https://starbucks-mugs.com/mug/been-there-portland/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_portland-407x301.jpg",
        "description": "\nFresh release from West Coast – Starbucks Been There Portland mug is green and looks similar to corresponding state mug – BT Oregon… Read more \n",
        "latlong": [
            45.515232,
            -122.6783853
        ]
    },
    "Kansas City": {
        "owned": false,
        "title": "Been There – Kansas City",
        "url": "https://starbucks-mugs.com/mug/been-there-kansas-city/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_kansas_city-407x359.jpg",
        "description": "\nStarbucks Been There Kansas City mug aroused suspicion when collectors noticed that the street sign on the front of the mug should say “E 18th St” and not just “18th ST”. I don’t think this is a big issue and I really doubt Starbucks will replace the mug. Anyway, let’s see how it goes. … Read more \n",
        "latlong": [
            39.0997265,
            -94.5785667
        ]
    },
    "Lake Tahoe": {
        "owned": true,
        "title": "Been There – Lake Tahoe",
        "url": "https://starbucks-mugs.com/mug/been-there-lake-tahoe/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_lake_tahoe-407x311.jpg",
        "description": "\nIt was reported that certain BT city mugs will be delayed till the end of May! Luckily Starbucks Been There Lake Tahoe mug is not one of them. … Read more \n",
        "latlong": [
            39.0968493,
            -120.0323507
        ]
    },
    "New Orleans": {
        "owned": false,
        "title": "Been There – New Orleans",
        "url": "https://starbucks-mugs.com/mug/been-there-new-orleans/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_new_orleans-407x306.jpg",
        "description": "\nStarbucks Been There New Orleans mug mug is pink inside. This looks weird, yet interesting. Would you buy it?… Read more \n",
        "latlong": [
            29.95106579999999,
            -90.0715323
        ]
    },
    "Phoenix": {
        "owned": false,
        "title": "Been There – Phoenix",
        "url": "https://starbucks-mugs.com/mug/been-there-phoenix/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_phoenix-407x312.jpg",
        "description": "\nSnakes and burning sun, that’s what we see on the front of the newly released Starbucks Been There Phoenix mug. Want to know more? Stay tuned.… Read more \n",
        "latlong": [
            33.4483771,
            -112.0740373
        ]
    },
    "Pittsburgh": {
        "owned": true,
        "title": "Been There – Pittsburgh",
        "url": "https://starbucks-mugs.com/mug/been-there-pittsburgh/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_pittsburgh-407x317.jpg",
        "description": "\nI continue adding US cities BT mugs which were spotted in stores and not just rumored. This one is Starbucks Been There Pittsburgh mug. More info will be added soon.… Read more \n",
        "latlong": [
            40.44062479999999,
            -79.9958864
        ]
    },
    "San Antonio": {
        "owned": false,
        "title": "Been There – San Antonio",
        "url": "https://starbucks-mugs.com/mug/been-there-san-antonio/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_san_antonio-407x311.jpg",
        "description": "\nMissed to add another city for Texas – Starbucks Been There San Antonio mug. This is the fifth BT mug from this series for this State (including BT Texas). And this is expected, since Texas is the second largest State in the US by both area and population. Let me remind you, YAH collection had 5 mugs too.… Read more \n",
        "latlong": [
            29.4251905,
            -98.4945922
        ]
    },
    "Philadelphia": {
        "owned": false,
        "title": "Been There – Philadelphia",
        "url": "https://starbucks-mugs.com/mug/been-there-philadelphia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_philadelphia-407x369.jpg",
        "description": "\nThere was no way Philly wasn’t getting Starbucks Been There Philadelphia mug. The city is notable for its rich history and has so much to offer.… Read more \n",
        "latlong": [
            39.9525839,
            -75.1652215
        ]
    },
    "Twin Cities": {
        "owned": false,
        "title": "Been There – Twin Cities",
        "url": "https://starbucks-mugs.com/mug/been-there-twin-cities/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_twin_cities-407x313.jpg",
        "description": "\nMinneapolis–Saint Paul metropolitan area was a definitive candidate for its own Starbucks Been There Twin Cities mug. This mug is blue and has a lot to discover in the design. Stay tuned for more information.… Read more \n",
        "latlong": [
            44.9374831,
            -93.20099979999999
        ]
    },
    "St. Louis": {
        "owned": false,
        "title": "Been There – St. Louis",
        "url": "https://starbucks-mugs.com/mug/been-there-st-louis/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_st_louis-407x330.jpg",
        "description": "\nAre there any people who doesn’t find Gateway Arch an amazing monument and must see attraction in St. Louis? It has obviously found its place on the new Starbucks Been There St. Louis mug. Come back for more details soon.… Read more \n",
        "latlong": [
            38.6270025,
            -90.19940419999999
        ]
    },
    "New York City": {
        "owned": false,
        "title": "Been There – New York City",
        "url": "https://starbucks-mugs.com/mug/been-there-new-york-city/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_new_york_city-407x327.jpg",
        "description": "\nIf you’re YAH mugs collector, you probably remember that YAH NY mug is actually dedicated to New York City. And now, after the recent release of BT Upstate NY mug, Starbucks brings Starbucks Been There New York City mug to action. Obviously, the latest release is depicting exclusively Big Apple’s icons and points of attraction. More details are coming soon.… Read more \n",
        "latlong": [
            40.7127753,
            -74.0059728
        ]
    },
    "Maui": {
        "owned": false,
        "title": "Been There – Maui",
        "url": "https://starbucks-mugs.com/mug/been-there-maui/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_maui-407x291.jpg",
        "description": "\nIn the new BT series, Hawaii mugs family is expanding with Starbucks Been There Maui. The island of Maui is the second-largest of the Hawaiian Islands, so it is nice to see it receiving its own mug. Stay tuned for more details.… Read more \n",
        "latlong": [
            20.7983626,
            -156.3319253
        ]
    },
    "Waikiki": {
        "owned": false,
        "title": "Been There – Waikiki",
        "url": "https://starbucks-mugs.com/mug/been-there-waikiki/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_waikiki-407x331.jpg",
        "description": "\nWe used to have Waikiki in the previous collections, new series is not an exception. Starbucks Been There Waikiki mug is using red color palette. More details to be added soon.… Read more \n",
        "latlong": [
            21.2793462,
            -157.8291847
        ]
    },
    "Houston": {
        "owned": false,
        "title": "Been There – Houston",
        "url": "https://starbucks-mugs.com/mug/been-there-houston/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_houston-407x317.jpg",
        "description": "\nI would like to continue with the third Texas city in the batch of recent releases – Starbucks Been There Houston. Really like this particular one, probably because of the color palette and the way the name is drawn.… Read more \n",
        "latlong": [
            29.7604267,
            -95.3698028
        ]
    },
    "Dallas": {
        "owned": false,
        "title": "Been There – Dallas",
        "url": "https://starbucks-mugs.com/mug/been-there-dallas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_dallas-407x334.jpg",
        "description": "\nThis week was pretty eventful in terms of BT releases. Namely, Wednesday, April 18 is the day when licensed stores started selling US BT cities. Yes, there was Austin earlier, but this time it was official green light from Starbucks, I guess. How do you guys like this Starbucks Been There Dallas mug? To be honest with you, I am getting more and more into this new collection. On the other side, locals complain that it doesn’t really feels like Dallas to them.… Read more \n",
        "latlong": [
            32.7766642,
            -96.79698789999999
        ]
    },
    "Vancouver": {
        "owned": true,
        "title": "Been There – Vancouver",
        "url": "https://starbucks-mugs.com/mug/been-there-vancouver/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_vancouver_preview-407x324.jpg",
        "description": "\nThis is 11th and the last preview available for BT Canada so far. West Coast at it’s finest, Starbucks Been There Vancouver mug it is. Please see two sides of this green mug combined in one picture for now. There will be more pictures soon, as these mugs are coming faster than expected.\n… Read more \n",
        "latlong": [
            49.2827291,
            -123.1207375
        ]
    },
    "Edmonton": {
        "owned": false,
        "title": "Been There – Edmonton",
        "url": "https://starbucks-mugs.com/mug/been-there-edmonton/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_edmonton_preview-407x327.jpg",
        "description": "\nI continue adding previews of Canadian cities from BT collection. This one is Starbucks Been There Edmonton mug. As usual, I am adding two sides in a collage and promise to come back to review the mug.\n… Read more \n",
        "latlong": [
            53.5460983,
            -113.4937266
        ]
    },
    "Austin": {
        "owned": true,
        "title": "Been There – Austin",
        "url": "https://starbucks-mugs.com/mug/been-there-austin/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_austin.jpg",
        "description": "\nI’ve posted some Canadian City mugs from BT series recently, but those were just previews. As you probably remember, those pictures had been revealed by Starbucks via Pinterest. The actual release was planned for June, and I didn’t really expect this to happen that early, namely appearing of Starbucks Been There Austin mug in store! Yes, it’s happening! Even though not all States have been officially released yet, Starbucks started to roll out cities! The list is pretty big and there is a good chance your city is also coming out.… Read more \n",
        "latlong": [
            30.267153,
            -97.7430608
        ]
    },
    "Louisiana": {
        "owned": false,
        "title": "Been There – Louisiana",
        "url": "https://starbucks-mugs.com/mug/been-there-louisiana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_louisiana-407x342.jpg",
        "description": "\nYou guys remember my post about error mug, right? Well, Nebraska’s design wasn’t the only one Starbucks made the mistake in. As you can guess, other mugs which hasn’t been spotted in stores yet, are the ones with “issues”. There was an assumption that other “error” mugs didn’t make it to stores or were destroyed before the release, however a photo of Starbucks Been There Louisiana mug has just been revealed in the Facebook community.\n\nLook closer at the back of the mug, it says “Laissez bons temps rouler” (Cajun French) that is literally translated from the English expression “Let the good times roll.” Well, the right phrase should be “Laissez les bons temps rouler”, which means Starbucks missed “les” word and is now going to replace the mug with the “fixed” one.… Read more \n",
        "latlong": [
            30.5190775,
            -91.5208624
        ]
    },
    "Banff": {
        "owned": false,
        "title": "Been There – Banff",
        "url": "https://starbucks-mugs.com/mug/been-there-banff/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_banff_preview-407x323.jpg",
        "description": "\nLike I’ve mentioned before, Alberta will be the biggest in terms of BTs, and we know why. Pretty much the main reason is Banff National Park and therefore Starbucks Been There Banff mug. It is using blue color scheme which makes sense, since this park is all about mountains with snow caps, lakes and skies.\nSee more details in the picture below. I will get back to it when this mug is officially released and we have photos of all sides.… Read more \n",
        "latlong": [
            51.1784304,
            -115.5707903
        ]
    },
    "Alberta": {
        "owned": false,
        "title": "Been There – Alberta",
        "url": "https://starbucks-mugs.com/mug/been-there-alberta/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_alberta_preview-407x332.jpg",
        "description": "\nIt was expected that this Province will get more BTs than others. One of the newly revealed previews shows Starbucks Been There Alberta mug itself.  It has “Wild Rose Country” slogan on the front which has been on Alberta’s plates since 1973. Did you know there was a proposal to remove this slogan from the plates in 2014? Apparently nobody liked the idea and it was decided to keep it. More details about the mug will come soon! Meanwhile, take a look at these two sides of the mug in the following collage:\n… Read more \n",
        "latlong": [
            53.9332706,
            -116.5765035
        ]
    },
    "Saskatchewan": {
        "owned": false,
        "title": "Been There – Saskatchewan",
        "url": "https://starbucks-mugs.com/mug/been-there-saskatchewan/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_saskatchewan_preview-407x330.jpg",
        "description": "\nStarbucks Been There Saskatchewan mug could be a rare find. I don’t see that many Starbucks stores there and it is pretty remote Province. If you have friends or relatives there who’s willing to help, it is time to make sure their contact information is up-to-date. You still have to wait till the official release, since this is only the preview and not real pictures from stores.\nMeanwhile, please take a look at two sides of the mug:\n… Read more \n",
        "latlong": [
            52.9399159,
            -106.4508639
        ]
    },
    "Winnipeg": {
        "owned": false,
        "title": "Been There – Winnipeg",
        "url": "https://starbucks-mugs.com/mug/been-there-winnipeg/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_winnipeg_preview-407x322.jpg",
        "description": "\nNot just the province of Manitoba gets the BT, but it’s capital too – Starbucks Been There Winnipeg mug. Stay tuned for more details.\n… Read more \n",
        "latlong": [
            49.8954221,
            -97.1385145
        ]
    },
    "Manitoba": {
        "owned": false,
        "title": "Been There – Manitoba",
        "url": "https://starbucks-mugs.com/mug/been-there-manitoba/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_manitoba_preview-407x327.jpg",
        "description": "\nThis Canadian Province was also missing mugs before, so it is twice as great to finally see one announced – Starbucks Been There Manitoba mug. Again, I am adding two sides now and will update the post later, with more details.\n… Read more \n",
        "latlong": [
            53.7608608,
            -98.81387629999999
        ]
    },
    "Ottawa": {
        "owned": false,
        "title": "Been There – Ottawa",
        "url": "https://starbucks-mugs.com/mug/been-there-ottawa/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_ottawa_preview-407x328.jpg",
        "description": "\nEver wondered what’s wrong with Ottawa and why it has never gotten any mug? Well, I won’t be able to answer that question but I am pleased to announce, soon-to-be-released, Starbucks Been There Ottawa mug. And yes, this is the first (and definitely not the last) Canadian City (not Province) mug from BT Collection on this site. Please see two sides of the mug below and keep an eye on updates!\n… Read more \n",
        "latlong": [
            45.4215296,
            -75.69719309999999
        ]
    },
    "Atlantic Canada": {
        "owned": false,
        "title": "Been There – Atlantic Canada",
        "url": "https://starbucks-mugs.com/mug/been-there-atlantic-canada/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_atlantic_canada_peview-407x335.jpg",
        "description": "\nIt was just recently revealed by insiders, that not all Canadian Provinces get their mug, despite of the initial rumors. Specifically New Brunswick, Newfoundland and Labrador, Nova Scotia and Prince Edward Island will join BT family with one and only mug – Starbucks Been There Atlantic Canada. Even though it makes sense (there are not that many Starbucks stores there) I do feel the frustration of the collectors living in these four provinces. Well, at the end, this is better than nothing.… Read more \n",
        "latlong": [
            43.37822,
            -64.9405185
        ]
    },
    "Quebec": {
        "owned": false,
        "title": "Been There – Quebec",
        "url": "https://starbucks-mugs.com/mug/been-there-quebec/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_quebec_preview-407x315.jpg",
        "description": "\nThere was something exciting that happened today – Starbucks posted some pictures from the new series on Pinterest, and yes, even for those mugs which haven’t been released yet. Starbucks Been There Quebec mug is one of them. Be aware, this is still a preview, even though pictures look real and not just like some render we’ve seen before.\n… Read more \n",
        "latlong": [
            46.8130816,
            -71.20745959999999
        ]
    },
    "South Dakota": {
        "owned": false,
        "title": "Been There – South Dakota",
        "url": "https://starbucks-mugs.com/mug/been-there-south-dakota/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_south_dakota-407x352.jpg",
        "description": "\nYou probably know like some States are considered remote and have less Starbucks stores? I guess we can say that, Starbucks Been There South Dakota mug comes from one of those States. There are more elements on the mug than just Mount Rushmore. Stay tuned for more details. … Read more \n",
        "latlong": [
            43.9695148,
            -99.9018131
        ]
    },
    "New Hampshire": {
        "owned": false,
        "title": "Been There – New Hampshire",
        "url": "https://starbucks-mugs.com/mug/been-there-new-hampshire/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_new_hampshire_1_r-407x311.jpg",
        "description": "\nAlong with Vermont, I have his neighbour to present to you – please meet Starbucks Been There New Hampshire mug. Again, I had it in my hands and I really liked bright colors and texture.\nI’ve combined all sides in this picture:\n\nMore details about what inspired the designer will be added to the site soon!… Read more \n",
        "latlong": [
            43.1938516,
            -71.5723953
        ]
    },
    "Vermont": {
        "owned": false,
        "title": "Been There – Vermont",
        "url": "https://starbucks-mugs.com/mug/been-there-vermont/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_vermont_1_r-407x321.jpg",
        "description": "\nFinally, more New England BTs. This one is Starbucks Been There Vermont mug. I saw it in person and I have to say it looks much better than I expected. Please see all sides in this collage:\n\nFul review is coming soon!… Read more \n",
        "latlong": [
            44.5588028,
            -72.57784149999999
        ]
    },
    "West Virginia": {
        "owned": false,
        "title": "Been There – West Virginia",
        "url": "https://starbucks-mugs.com/mug/been-there-west-virginia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_west_virginia-407x338.jpg",
        "description": "\nOne of the most anticipated BTs I think, Starbucks Been There West Virginia mug. There are not as many Starbucks stores in this State and I expect it will be little bit harder to get this particular mug (compared to most of the other states).\nI’ve combined all sides into a collage:\n… Read more \n",
        "latlong": [
            38.5976262,
            -80.4549026
        ]
    },
    "Idaho": {
        "owned": false,
        "title": "Been There – Idaho",
        "url": "https://starbucks-mugs.com/mug/been-there-idaho/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_idaho-407x337.jpg",
        "description": "\nI was waiting for better pictures of the Starbucks Been There Idaho mug before posting. I find this mug to be special since the title is written in lower case! I already see two birds on the front of the mug and lots of water all around. Will try to come back with the pictures of all sides of the mug as soon as possible. … Read more \n",
        "latlong": [
            44.0682019,
            -114.7420408
        ]
    },
    "Rhode Island": {
        "owned": false,
        "title": "Been There – Rhode Island",
        "url": "https://starbucks-mugs.com/mug/been-there-rhode-island/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_rhode_island_preview-407x317.jpg",
        "description": "\nThe Starbucks Been There Rhode Island mug has been finally revealed. It was promised to us, that all 50 states get the mug from the new series and it keeps happening, even though RI doesn’t have that many stores. Full review is coming soon.\n… Read more \n",
        "latlong": [
            41.5800945,
            -71.4774291
        ]
    },
    "Kentucky": {
        "owned": false,
        "title": "Been There – Kentucky",
        "url": "https://starbucks-mugs.com/mug/been-there-kentucky/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_kentucky-407x280.jpg",
        "description": "\nBig thank you to m83, our reader and forum user, who provided the photo of the Starbucks Been There Kentucky mug! And since he added photos of all sides, I’ve combined them into a collage:\n\nI do not have any excuse now to not try to identify all elements from it, stay tuned.… Read more \n",
        "latlong": [
            37.8393332,
            -84.2700179
        ]
    },
    "Minnesota": {
        "owned": false,
        "title": "Been There – Minnesota",
        "url": "https://starbucks-mugs.com/mug/been-there-minnesota/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_minnesota-407x308.jpg",
        "description": "\nAnother State which never had any mug, finally gets one – Starbucks Been There Minnesota. I actually like it, even though there is only one picture of the front of the mug so far, and it is pretty much fully dedicated to lakes and fishing. Will update the post with more info soon!… Read more \n",
        "latlong": [
            46.729553,
            -94.6858998
        ]
    },
    "Nebraska": {
        "owned": false,
        "title": "Been There – Nebraska",
        "url": "https://starbucks-mugs.com/mug/been-there-nebraska/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_nebraska_1_1-407x305.jpg",
        "description": "\nWow! Something interesting happened today! I was sure Starbucks learned his lesson after those issues with recalling some YAHs: Wisconsin v1 and Epcot v1 (not to forget non-accent Quebec v1 and Montreal v1) and releasing a second, fixed version. But no, I was wrong. What was revealed today is that Starbucks Been There Nebraska mug has an error in the design.\nLook, I made a collage of all sides of the mug. As you can see, the State slogan, above the flag says: “Great Life  Great Opportunity” while the real Nebraska’s brand is “Good Life.… Read more \n",
        "latlong": [
            41.4925374,
            -99.9018131
        ]
    },
    "Connecticut": {
        "owned": false,
        "title": "Been There – Connecticut",
        "url": "https://starbucks-mugs.com/mug/been-there-connecticut/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_connecticut-407x316.jpg",
        "description": "\nOne of the no-YAH states is here, Starbucks Been There Connecticut mug. This is obviously good news for New England, which didn’t get many mugs in the past. Mug review is yet to come.… Read more \n",
        "latlong": [
            41.6032207,
            -73.087749
        ]
    },
    "Arkansas": {
        "owned": false,
        "title": "Been There – Arkansas",
        "url": "https://starbucks-mugs.com/mug/been-there-arkansas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_arkansas-407x367.jpg",
        "description": "\nPlease meet Starbucks Been There Arkansas mug. Do you know how to spell the name of this state properly or “are you confusion“? We will talk more about it soon!… Read more \n",
        "latlong": [
            35.20105,
            -91.8318334
        ]
    },
    "Alabama": {
        "owned": false,
        "title": "Been There – Alabama",
        "url": "https://starbucks-mugs.com/mug/been-there-alabama/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_alabama_1_main.jpg",
        "description": "\nSweet Home Starbucks Been There Alabama mug has two planes on it. Why? I have no idea, but I am going to find this out! Stay tuned.\nApril 4, 2023 update:\nA new version has been released, with many elements changed. See the picture below for more details:\n… Read more \n",
        "latlong": [
            32.3182314,
            -86.902298
        ]
    },
    "New Mexico": {
        "owned": true,
        "title": "Been There – New Mexico",
        "url": "https://starbucks-mugs.com/mug/been-there-new-mexico/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_new_mexico-407x302.jpg",
        "description": "\nThis is not the best picture quality, but Starbucks Been There New Mexico mug is here. There are fewer and fewer BT States mugs to be discovered and I believe we gonna be done by the end of the week. Will update this post with better pics as soon as have them.… Read more \n",
        "latlong": [
            34.9727305,
            -105.0323635
        ]
    },
    "Wisconsin": {
        "owned": false,
        "title": "Been There – Wisconsin",
        "url": "https://starbucks-mugs.com/mug/been-there-wisconsin/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_wisconsin.jpg",
        "description": "\nStarbucks Been There Wisconsin mug is somewhat cute, thanks to that cow on the front of the mug. I also see a little maple syrup bottle. I didn’t know Wisconsin is known for it, need to read about this state more and write my findings here.… Read more \n",
        "latlong": [
            43.7844397,
            -88.7878678
        ]
    },
    "Illinois": {
        "owned": false,
        "title": "Been There – Illinois",
        "url": "https://starbucks-mugs.com/mug/been-there-illinois/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_illinois-407x345.jpg",
        "description": "\nStarbucks Been There Illinois mug is surprisingly grayish-blue. I am probably just used to YAH Illinois color scheme. Let me review all sides of the mug to find more. … Read more \n",
        "latlong": [
            40.6331249,
            -89.3985283
        ]
    },
    "Georgia": {
        "owned": false,
        "title": "Been There – Georgia",
        "url": "https://starbucks-mugs.com/mug/been-there-georgia/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_georgia-407x349.jpg",
        "description": "\nStarbucks Been There Georgia mug is designed using blue palette with the bit of orange. This small color touch makes it different from other blue BTs. Full review to come soon… Read more \n",
        "latlong": [
            42.315407,
            43.35689199999999
        ]
    },
    "Nevada": {
        "owned": true,
        "title": "Been There – Nevada",
        "url": "https://starbucks-mugs.com/mug/been-there-nevada/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_nevada-407x310.jpg",
        "description": "\nNevada is much more than just Las Vegas and Starbucks Been There Nevada mug has a lot to offer in terms of design elements. Can’t wait to review them all.\nUpdate from 2021-12-06: Nevada v2 has been released. Adding the collage below that compares v1 and v2 mugs.\n… Read more \n",
        "latlong": [
            38.8026097,
            -116.419389
        ]
    },
    "Kansas": {
        "owned": false,
        "title": "Been There – Kansas",
        "url": "https://starbucks-mugs.com/mug/been-there-kansas/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_kansas-407x310.jpg",
        "description": "\nStarbucks Been There Kansas mug is here! Sunflower state they call it and we see at least 6 sunflowers on the mug. There is more, come back later. … Read more \n",
        "latlong": [
            39.011902,
            -98.4842465
        ]
    },
    "New Jersey": {
        "owned": false,
        "title": "Been There – New Jersey",
        "url": "https://starbucks-mugs.com/mug/been-there-new-jersey/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_new_jersey-407x323.jpg",
        "description": "\nI would like to thank Grant, one of my readers, for this amazing picture of Starbucks Been There New Jersey mug. I actually like the color scheme of this one. It is so much better than red BT mugs. Again, this is just my preference and you might not agree with me. … Read more \n",
        "latlong": [
            40.0583238,
            -74.4056612
        ]
    },
    "Maryland": {
        "owned": false,
        "title": "Been There – Maryland",
        "url": "https://starbucks-mugs.com/mug/been-there-maryland/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_maryland-407x321.jpg",
        "description": "\nBT Collection is growing on the daily basis. It looks like licensed stores got them prior regular stores release (March 29). If I was you I would check your nearest licensed store ASAP. And for now, let me present Starbucks Been There Maryland mug. The main color is red and it has quite a few elements placed all around. The full review is yet to come!… Read more \n",
        "latlong": [
            39.0457549,
            -76.64127119999999
        ]
    },
    "Missouri": {
        "owned": false,
        "title": "Been There – Missouri",
        "url": "https://starbucks-mugs.com/mug/been-there-missouri/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_missouri-407x334.jpeg",
        "description": "\nHere is a pleasant surprise from Matt, one of my readers – a crisp, detailed picture of Starbucks Been There Missouri mug. Thank you Matt for the share! I definitely like this one a lot, something I expected though, real pictures look so much better than renders. Can’t wait to hold one with my hands!\nSee the thread here.… Read more \n",
        "latlong": [
            37.9642529,
            -91.8318334
        ]
    },
    "Utah": {
        "owned": true,
        "title": "Been There – Utah",
        "url": "https://starbucks-mugs.com/mug/been-there-utah/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_utah-407x359.jpg",
        "description": "\nCheck this Starbucks Been There Utah mug out. The picture is blurry, but at least it’s not a render, but a real photo of the mug in the box. Too early to describe the elements from the mug, let’s wait for better pics.… Read more \n",
        "latlong": [
            39.3209801,
            -111.0937311
        ]
    },
    "Iowa": {
        "owned": false,
        "title": "Been There – Iowa",
        "url": "https://starbucks-mugs.com/mug/been-there-iowa/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_iowa-407x328.jpg",
        "description": "\nNew mug, new tag! Starbucks Been There Iowa mug has been spotted today in the stores. It’s real, you can buy it too, if you happen to live in Iowa obviously.\nMore pics with full review will come soon!… Read more \n",
        "latlong": [
            41.8780025,
            -93.097702
        ]
    },
    "Massachusetts": {
        "owned": false,
        "title": "Been There – Massachusetts",
        "url": "https://starbucks-mugs.com/mug/been-there-massachusetts/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_massachusetts.jpg",
        "description": "\nThis one is special for me, and not just because it’s blue, but because it’s coming from New England (since there are no state YAHs from this region, new mugs are always welcomed). Starbucks Been There Massachusetts it is!\nFull description of the mug is yet to come.… Read more \n",
        "latlong": [
            42.4072107,
            -71.3824374
        ]
    },
    "Indiana": {
        "owned": false,
        "title": "Been There – Indiana",
        "url": "https://starbucks-mugs.com/mug/been-there-indiana/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_indiana-407x287.jpg",
        "description": "\nLooks like there is no pattern in the way new mugs are released. It is time for Starbucks Been There Indiana mug.\nPlease come back in few days for a more detailed review of the mug.… Read more \n",
        "latlong": [
            40.5512165,
            -85.60236429999999
        ]
    },
    "South Carolina": {
        "owned": false,
        "title": "Been There – South Carolina",
        "url": "https://starbucks-mugs.com/mug/been-there-south-carolina/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_south_carolina_v1_main.jpg",
        "description": "\nI had to add a new tag to the site, since this state had no mugs from any series so far. One and only Starbucks Been There South Carolina!\nWill review it as soon as I get better pics!\nUpdated: Starbucks released a new version of this mug. See a much better review of the design here.\n\n… Read more \n",
        "latlong": [
            33.836081,
            -81.1637245
        ]
    },
    "Alaska": {
        "owned": false,
        "title": "Been There – Alaska",
        "url": "https://starbucks-mugs.com/mug/been-there-alaska/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_alaska_main.jpg",
        "description": "\nThe Last Frontier state gets its BT too! Right, this is Starbucks Been There Alaska mug. How do you like it?\nI will definitely come back and review it better when I add all new releases to the site!\n… Read more \n",
        "latlong": [
            63.588753,
            -154.4930619
        ]
    },
    "Oklahoma": {
        "owned": false,
        "title": "Been There – Oklahoma",
        "url": "https://starbucks-mugs.com/mug/been-there-oklahoma/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_oklhahoma_1-407x326.jpg",
        "description": "\nStarbucks Been There Oklahoma mug is in da house! The picture is blurry though and I will definitely update it with the better one when it pops up.\nThe full review of the mug will come soon.\n… Read more \n",
        "latlong": [
            35.0077519,
            -97.092877
        ]
    },
    "Wyoming": {
        "owned": false,
        "title": "Been There – Wyoming",
        "url": "https://starbucks-mugs.com/mug/been-there-wyoming/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_wyoming-407x353.jpg",
        "description": "\nCan you guess what tag wasn’t used at Starbucks-Mugs.com yet? You got it – Wyoming! Well, that’s in the past, since Starbucks has just released Been There Wyoming mug. Unfortunately we only see the back of the mug as that’s what was spotted online. Still, the mug is real and it already has caused arguments among muggers on whether they are going to collect it or not! Personally, I think it is just amazing that all states get their respective mug, even those with very few number of Starbucks stores.… Read more \n",
        "latlong": [
            43.0759678,
            -107.2902839
        ]
    },
    "Pennsylvania": {
        "owned": true,
        "title": "Been There – Pennsylvania",
        "url": "https://starbucks-mugs.com/mug/been-there-pennsylvania/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/03/bt_penn_1_main-407x297.jpg",
        "description": "\nLike it or not, this is happening! No less than the first real BT mug was spotted in stores. And this is… Starbucks Been There Pennsylvania mug! I did expect these to come later, but it’s here and it’s real. Numerous stores across US and Canada already announced YAH retirement by placing signs next to stands with mugs earlier this week. I still thought we have time, but there isn’t. Hoard what you can hoard guys!\nP.S. I will update the post with the description of the mug later.… Read more \n",
        "latlong": [
            41.2033216,
            -77.1945247
        ]
    },
    "Delaware": {
        "owned": false,
        "title": "Been There – Delaware",
        "url": "https://starbucks-mugs.com/mug/been-there-delaware/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/04/bt_delaware-407x333.jpg",
        "description": "\nStarbucks Been There Delaware Mug was pretty easy to identify as it says “The Diamond State” right on the back. I also see the flag of the state and a beach chair. I will refrain from guessing what else is on the mug till it is released. Sorry guys.\nUpdate from 2018/03/17: adding the real picture of the mug. The full review to come soon.\nUpdate from 2018/04/12: adding the pic of the front and the back from eBay.\n\n\nUpdate from 2018/06/30: v2 is finally out and the phrase “Lower Slower” was replaced by a picture of the crab.… Read more \n",
        "latlong": [
            38.9108325,
            -75.52766989999999
        ]
    },
    "Miami": {
        "owned": false,
        "title": "Been There – Miami",
        "url": "https://starbucks-mugs.com/mug/been-there-miami/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_miami-407x313.jpg",
        "description": "\nAs you probably know, many US cities will also be a part of the new collection. This is Starbucks Been There Miami mug. Is there a palm tree? Yes, a huge one. What else? Too early to say, we need real pics and not just preview. I will update this post as soon as I get anything better, guys. Stay tuned!… Read more \n",
        "latlong": [
            25.7616798,
            -80.1917902
        ]
    },
    "Tennessee": {
        "owned": false,
        "title": "Been There – Tennessee",
        "url": "https://starbucks-mugs.com/mug/been-there-tennessee/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_tennessee-407x384.jpg",
        "description": "\nAnother leaked photo – Starbucks Been There Tennessee Mug. The quality of the image is very poor and I can only recognize the Tennessee flag and electric guitar – the latter referring to state playing a critical role in the development of many forms of American popular music. Beale Street in Memphis is considered by many to be the birthplace of the blues. It is also home to Sun Records, where musicians such as Elvis Presley, Johnny Cash, Carl Perkins, Jerry Lee Lewis, Roy Orbison, and Charlie Rich began their recording careers.… Read more \n",
        "latlong": [
            35.5174913,
            -86.5804473
        ]
    },
    "Detroit": {
        "owned": false,
        "title": "Been There – Detroit",
        "url": "https://starbucks-mugs.com/mug/been-there-detroit/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/02/bt_detroit_1_3-407x338.jpg",
        "description": "\nTo be honest, I am not a huge fan of “fake news” and I am only trying to post when the mug is confirmed by real picture, however, you guys need to know what’s going on. Thanks to leaks from insiders, we do have some more previews of new mugs coming for Starbucks Been There Mugs Collection. This particular picture is not even the front of the mug, but its back. It’s not the state, but a city – Starbucks Been There Detroit mug.… Read more \n",
        "latlong": [
            42.331427,
            -83.0457538
        ]
    },
    "Toronto": {
        "owned": false,
        "title": "Been There – Toronto",
        "url": "https://starbucks-mugs.com/mug/been-there-toronto/",
        "img": "https://starbucks-mugs.com/wp-content/uploads/2018/01/bt_toronto_preview-407x326.jpg",
        "description": "\nThere were some fears that the new Been There series is just a hoax. Well, probably not, since I’ve just discovered two new pics of the new collection. Even though these are of a very low quality it makes me believe these new mugs are real.\nAs we can see it really looks like hand drawn design, imagine it was a kid drawing it. I can tell you right away, the initial reaction of muggers is definitely not positive, but let’s see what it looks like in real life, it’s too early to judge.… Read more \n",
        "latlong": [
            43.653226,
            -79.3831843
        ]
    },
    "Mexico": {
        "owned": true,
        "latlong": [
            23.634501,
            -102.552784
        ]
    },
    "London": {
        "owned": true,
        "latlong": [
            51.5072178,
            -0.1275862
        ]
    },
    "England": {
        "owned": true,
        "latlong": [
            52.3555177,
            -1.1743197
        ]
    },
    "Turkey": {
        "owned": true,
        "latlong": [
            38.963745,
            35.243322
        ]
    },
    "Istanbul": {
        "owned": true,
        "latlong": [
            41.0082376,
            28.9783589
        ]
    },
    "Dubai": {
        "owned": true,
        "latlong": [
            25.2048493,
            55.2707828
        ]
    },
    "Izmir": {
        "owned": true,
        "latlong": [
            38.423734,
            27.142826
        ]
    },
    "United Arab Emirates": {
        "owned": true,
        "latlong": [
            23.424076,
            53.847818
        ]
    },
    "Punta del Este": {
        "owned": true
    }
}